["North Korea", ["bbc-news", "cnn", "fox-news", "abc-news", "breitbart-news", "axios", "the-hill", "the-washington-post"], {"bbc-news": " \"There are also many cases where the USB is set so it can only be viewed once on a certain computer, so you can't plug it in to another device or give it to someone else.", "cnn": " \"When a country has just lived through a coup attempt, it should urgently, honestly, examine what occurred ... Trump and many of his backers maliciously insist the election was stolen. \"When a country has just lived through a coup attempt, it should urgently, honestly, examine what occurred ... Trump and many of his backers maliciously insist the election was stolen. Most Americans \"don't agree with that protest,\" but GOP leaders are left \"riding the back of a tiger and they can't get off\" since leaders like Trump \"whip up their followers into a froth of hysteria.\" Most Americans \"don't agree with that protest,\" but GOP leaders are left \"riding the back of a tiger and they can't get off\" since leaders like Trump \"whip up their followers into a froth of hysteria.\" \"If history serves as a guide ... after a ceasefire is reached, the conflict will slowly fade from the headlines, the world will go back to its business and the Palestinians will largely be forgotten -- yet again. For those who sincerely want to see a just and lasting peace in the Middle East, this time must be different. The world, and especially the Biden administration, cannot look away but must engage on the question of Palestine. \"If history serves as a guide ... after a ceasefire is reached, the conflict will slowly fade from the headlines, the world will go back to its business and the Palestinians will largely be forgotten -- yet again. For those who sincerely want to see a just and lasting peace in the Middle East, this time must be different. The world, and especially the Biden administration, cannot look away but must engage on the question of Palestine. In Kushner's analysis, the road to peace in Israel ran not through Gaza, Jerusalem and the West Bank, but through the United Arab Emirates.\" In Kushner's analysis, the road to peace in Israel ran not through Gaza, Jerusalem and the West Bank, but through the United Arab Emirates.\" Israeli Prime Minister Benjamin Netanyahu's embrace of Trump helped erode support for Israel among American Jews, Freedman wrote. Israeli Prime Minister Benjamin Netanyahu's embrace of Trump helped erode support for Israel among American Jews, Freedman wrote. Israel's prime minister \"and Hamas each exploited or nurtured their own mobs to prevent an unprecedented national unity government from emerging in Israel -- a cabinet that for the first time would have included Israeli Jews and Israeli Arab Muslims together ... No, Hamas and Bibi don't talk. Israel's prime minister \"and Hamas each exploited or nurtured their own mobs to prevent an unprecedented national unity government from emerging in Israel -- a cabinet that for the first time would have included Israeli Jews and Israeli Arab Muslims together ... No, Hamas and Bibi don't talk. She and her husband are vaccinated, but since Salerno has multiple sclerosis, she is concerned that her MS treatment and weakened immune system could put her at higher risk should she contract the virus that causes Covid-19. \"With high vaccine rates and Covid-19 numbers falling in our state, we were starting to look forward to going back into the bookstore or out with friends,\" she wrote. She and her husband are vaccinated, but since Salerno has multiple sclerosis, she is concerned that her MS treatment and weakened immune system could put her at higher risk should she contract the virus that causes Covid-19. \"With high vaccine rates and Covid-19 numbers falling in our state, we were starting to look forward to going back into the bookstore or out with friends,\" she wrote.", "fox-news": " International Atomic Energy Agency Director General Rafael Grossi made the remark during a meeting of its board of governors, which is comprised of 35 nations including the U.S.\n\n\"The DPRK’s nuclear activities remain a cause for serious concern,\" he said.", "abc-news": " In their first meeting, Secretary of State Antony Blinken and Russian Foreign Minister Sergey Lavrov both discussed a desire to find ways to work together and advance areas where there are mutual interests -- a warmer tone than relations between the two nuclear-armed powers in recent years.", "breitbart-news": " Since the North Korean regime is extremely secretive, especially about the dictator’s health and private activities, outside observers were left poring over clues such as the movements of his personal railroad train and the whereabouts of his sister Kim Yo-jong – sometimes thought to be the next dictator-in-waiting, or at least an interim leader if Kim Jong-un is incapacitated. Kim Jong-un was out of the public eye for about a month before he reappeared at a Politburo meeting last week to discuss “urgent” state planning issues, South Korea’s NK News noted Tuesday. His watch strap, among other things, would certainly suggest so: https://t.co/JJDyt2Fa4x @nknewsorg pic.twitter.com/3r8KHfnw9y — James Pearson (@pearswick) June 8, 2021\n\nNK News quoted Massachusetts Institute of Technology (MIT) political science professor Vipin Narang speculating that if Kim made the effort to slim down intentionally, it “likely improves his position at home” because it would suggest Kim feels secure enough in power to spend some time on self-improvement, and getting healthy means he plans to stick around for the long term. The South Korean Unification Ministry declined to comment on Kim Jong-un’s health Thursday, although it said it is “analyzing photos when Kim Jong-un’s public activities are reported.”", "axios": " Driving the news: Director-General Rafael Mariano Grossi sat down with \"Axios on HBO\" at IAEA headquarters in Vienna, ahead of Iran's June 18 presidential election and a June 24 extension on negotiations seeking to restore curtailed surveillance of Iranian nuclear sites and salvage the 2015 deal. The big picture: Grossi also addressed North Korea; Israel's resistance to joining the Treaty of Non-Proliferation of Nuclear Weapons (NPT); and the limits of what the IAEA knows about the programs of the U.S., Russia and other nuclear powers.", "the-hill": " Biden’s summit with Moon comes as the administration looks to shape its foreign policy beyond former President Trump Donald TrumpBiden prepares to confront Putin Biden aims to bolster troubled Turkey ties in first Erdoğan meeting Senate investigation of insurrection falls short MORE, who engaged in several failed attempts to negotiate directly with North Korean leader Kim Jong Un Kim Jong UnOvernight Defense: Austin and Milley talk budget, Afghanistan, sexual assault and more at wide-ranging Senate hearing North Korea calls U.S.-South Korea missile development hostile policy Biden's invisible foreign policy success MORE on the country’s nuclear weapons program.", "the-washington-post": ""}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"bbc-news": "https://www.bbc.co.uk/news/world-asia-57225936", "cnn": "https://www.cnn.com/2021/05/23/opinions/he-spoke-truth-to-trump-opinion-column-galant/index.html", "fox-news": "https://www.foxnews.com/world/un-nuclear-watchdog-north-korea-activity-serious-concern", "abc-news": "https://abcnews.go.com/Politics/blinken-lavrov-play-nice-1st-meeting-us-waives/story?id=77789287", "breitbart-news": "https://www.breitbart.com/national-security/2021/06/10/photos-show-dramatic-weight-loss-for-north-korean-dictator-kim-jong-un/", "axios": "https://www.axios.com/iran-nuclear-deal-iaea-a573f571-abc0-423c-86b7-5d2d16643f5c.html", "the-hill": "https://thehill.com/policy/international/asia-pacific/556184-north-korea-calls-us-south-korea-missile-development", "the-washington-post": "https://www.washingtonpost.com/national-security/2021/05/21/medal-of-honor-ralph-puckett/"}]
