[["North Korea", ["bbc-news", "cnn", "fox-news", "abc-news", "breitbart-news", "axios", "the-hill", "the-washington-post"], {"bbc-news": "", "cnn": " \"When a country has just lived through a coup attempt, it should urgently, honestly, examine what occurred ... Trump and many of his backers maliciously insist the election was stolen. \"When a country has just lived through a coup attempt, it should urgently, honestly, examine what occurred ... Trump and many of his backers maliciously insist the election was stolen. Most Americans \"don't agree with that protest,\" but GOP leaders are left \"riding the back of a tiger and they can't get off\" since leaders like Trump \"whip up their followers into a froth of hysteria.\" Most Americans \"don't agree with that protest,\" but GOP leaders are left \"riding the back of a tiger and they can't get off\" since leaders like Trump \"whip up their followers into a froth of hysteria.\" \"If history serves as a guide ... after a ceasefire is reached, the conflict will slowly fade from the headlines, the world will go back to its business and the Palestinians will largely be forgotten -- yet again. For those who sincerely want to see a just and lasting peace in the Middle East, this time must be different. The world, and especially the Biden administration, cannot look away but must engage on the question of Palestine. \"If history serves as a guide ... after a ceasefire is reached, the conflict will slowly fade from the headlines, the world will go back to its business and the Palestinians will largely be forgotten -- yet again. For those who sincerely want to see a just and lasting peace in the Middle East, this time must be different. The world, and especially the Biden administration, cannot look away but must engage on the question of Palestine. In Kushner's analysis, the road to peace in Israel ran not through Gaza, Jerusalem and the West Bank, but through the United Arab Emirates.\" In Kushner's analysis, the road to peace in Israel ran not through Gaza, Jerusalem and the West Bank, but through the United Arab Emirates.\" Israeli Prime Minister Benjamin Netanyahu's embrace of Trump helped erode support for Israel among American Jews, Freedman wrote. Israeli Prime Minister Benjamin Netanyahu's embrace of Trump helped erode support for Israel among American Jews, Freedman wrote. Israel's prime minister \"and Hamas each exploited or nurtured their own mobs to prevent an unprecedented national unity government from emerging in Israel -- a cabinet that for the first time would have included Israeli Jews and Israeli Arab Muslims together ... No, Hamas and Bibi don't talk. Israel's prime minister \"and Hamas each exploited or nurtured their own mobs to prevent an unprecedented national unity government from emerging in Israel -- a cabinet that for the first time would have included Israeli Jews and Israeli Arab Muslims together ... No, Hamas and Bibi don't talk. She and her husband are vaccinated, but since Salerno has multiple sclerosis, she is concerned that her MS treatment and weakened immune system could put her at higher risk should she contract the virus that causes Covid-19. \"With high vaccine rates and Covid-19 numbers falling in our state, we were starting to look forward to going back into the bookstore or out with friends,\" she wrote. She and her husband are vaccinated, but since Salerno has multiple sclerosis, she is concerned that her MS treatment and weakened immune system could put her at higher risk should she contract the virus that causes Covid-19. \"With high vaccine rates and Covid-19 numbers falling in our state, we were starting to look forward to going back into the bookstore or out with friends,\" she wrote.", "fox-news": " International Atomic Energy Agency Director General Rafael Grossi made the remark during a meeting of its board of governors, which is comprised of 35 nations including the U.S.\n\n\"The DPRK’s nuclear activities remain a cause for serious concern,\" he said.", "abc-news": " Kim Jong Un is preparing for \"dialogue and confrontation\" with the U.S.\n\nSEOUL, South Korea -- In his first official reaction to the Biden administration, North Korean leader Kim Jong Un told his government to get ready for \"both dialogue and confrontation\" with the United States, \"especially to get fully prepared for confrontation,\" the Korean Central News Agency reported. North Korea \"is waiting for the U.S. to suggest an option, but if they are not satisfied, there's always a chance they will engage in provocations around Tokyo Olympics in July or ROK-US military exercises planned in August,\" Shin Beom-chul, the director at the Center of Diplomacy and National Security at the Research Institute for Economy and Society in Seoul, told ABC News.", "breitbart-news": " Kim Jong-un told members of his ruling communist party Wednesday that North Korea’s agricultural sector had “failed” and that the “people’s food situation is now getting tense,” the latest in a series of similar warnings that the nation is on the brink of famine. “Having a good crop is a militant task our Party and state must fulfill as a top priority issue to provide the people with a stable life and successfully step up socialist construction,” KCNA paraphrased Ri as saying, adding that “it is essential for the whole Party and state to concentrate on farming from a lesson of last year’s farming and under this year’s unfavorable conditions.”\n\nThe leaders deviated from the typical claims that the nation’s economic hardships were exclusively the product of international sanctions on North Korea’s illegal nuclear weapons program, instead admitting that “natural disaster” was behind the poor crop yield. “This year, due to strict quarantine rules because of the coronavirus, and with the Chinese border still being closed–meaning there are no food imports–it’s all going to lead to a further increase in food prices.”\n\nA third lamented, “I’ve never seen food prices rise so steeply like this, not even during the outbreak of the coronavirus, even after the border was completely sealed off and food routes from the outside were blocked.”\n\nThe United Nations revealed in a report published in March that it had evidence of “deaths by starvation” within the country and the exacerbation of a “serious food crisis.”", "axios": "", "the-hill": " Biden’s summit with Moon comes as the administration looks to shape its foreign policy beyond former President Trump Donald TrumpMaria Bartiromo defends reporting: 'Keep trashing me, I'll keep telling the truth' The Memo: The center strikes back Republicans eye Nashville crack-up to gain House seat MORE, who engaged in several failed attempts to negotiate directly with North Korean leader Kim Jong Un Kim Jong UnSullivan: Comments by North Korea's Kim an 'interesting signal' Kim says North Korea needs to be 'prepared' for 'confrontation' with US North Korea's Kim warns of possible food shortage MORE on the country’s nuclear weapons program.", "the-washington-post": ""}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"bbc-news": "https://www.bbc.co.uk/news/stories-57520169", "cnn": "https://www.cnn.com/2021/05/23/opinions/he-spoke-truth-to-trump-opinion-column-galant/index.html", "fox-news": "https://www.foxnews.com/world/un-nuclear-watchdog-north-korea-activity-serious-concern", "abc-news": "https://abcnews.go.com/International/north-korea-doors-open-dialogue-biden/story?id=78352871", "breitbart-news": "https://www.breitbart.com/asia/2021/06/16/kim-jong-un-north-korea-running-out-of-food-because-grain-production-failed/", "axios": "https://www.axios.com/north-korea-kim-jong-un-confrontation-6302c04d-a884-4fb7-8d77-f83a0fd6eed4.html", "the-hill": "https://thehill.com/policy/international/asia-pacific/556184-north-korea-calls-us-south-korea-missile-development", "the-washington-post": "https://www.washingtonpost.com/national-security/2021/05/21/medal-of-honor-ralph-puckett/"}, 2], ["Google", ["ars-technica", "engadget", "hacker-news", "recode", "techcrunch", "techradar", "the-next-web", "wired"], {"ars-technica": " “The AdX platform is only partially interoperable with DFP’s competing ad servers and does not allow the latter to organize a competition between AdX and its competitors—even though AdX itself has a privileged access to a significant portion of advertisers’ demand and while all of these competitors have adopted standards allowing for fairer competition,” the authority said.", "engadget": "", "hacker-news": " The specific example that pushed me over the edge to write this was searching for a news article I know exists on Battlefield 1 sales numbers, instead google's showing me the standard stuff (wiki articles that don't have what I'm looking for) and telling me about battlefield V or the new battlefield that's about to release.", "recode": "", "techcrunch": " “Customers across every industry are dealing with more demanding and data-intensive workloads and looking for strategic ways to speed up performance and reduce costs,” Google Cloud CEO Thomas Kurian said in a press release. “Our work with key strategic partners like AMD has allowed us to broaden our offerings and deliver customers the best price performance for compute-heavy, business-critical applications– all on the cleanest cloud in the industry.”\n\nGoogle has already signed up some high-profile customers for an early trial, including Twitter, Snap and DoIT.", "techradar": " Whether you want to translate text, identify plants or find answers to equations, Google Lens is an incredibly useful image recognition tool – and it’s really easy to install and use on an iOS device. Install the app and you’ll be able to use Google Lens with your camera in real time on iPhone (though not on iPad, sadly), as well as searching with images already saved to your camera roll. (Image credit: Future)\n\nThe key difference, though, is that Google Photos does not allow you to search in real-time with your iPhone or iPad camera. (Image credit: Future)\n\nOnce you’ve selected the relevant mode, simply aim your camera at the object which you’d like Google Lens to search with. As above, you don’t need to take another photo: just tap on one of the white circles within the image you already shot, to find out what Google Lens has identified. Don’t worry: you can easily use Google Lens to search with photos saved to your iPhone or iPad’s camera roll, any time. Likewise, even if Google Lens does recognize the object, the suggested search results sometimes aren’t the most useful – or accurate.", "the-next-web": " When people search Google News for the word “barn,” you’d probably hope it surfaced your work. As of the time of this article’s publishing, if you navigate to Google News and type “artificial intelligence queer” into the search box and then hit enter, you should be introduced to a lot of my work. Using Incognito Mode, Google News returns 120 results for “artificial intelligence queer,” of which 37 are stories that I wrote. Here’s what that means: my journalism represents approximately 30% of the Google News search results for “artificial intelligence queer,” even though only 24% of my listed articles are about anything queer-related. It turns out, when he searches for “artificial intelligence Arsenal,” more of his stories surfaced than when he just searched for “artificial intelligence.” But only a few of Tom’s pieces made the list either way. When I search for my pieces there’s a huge difference between just searching for “artificial intelligence” (only one result) and “artificial intelligence queer” (37 results). If I search for “AI queer” the number of my articles that surfaces drops to 21, but if I search for “artificial intelligence pronouns” it leaps to 44 out of 120. In fact, if I substitute “machine learning” for “artificial intelligence,” a term I don’t use at all in my profile, it surfaces zero results on its own and 27 results with “queer” added. Slapping some pronouns in my bio and having the privilege of working for a company that enthusiastically supports my reporting on queer issues shouldn’t give me a lion’s share of the results for something as broadly reported on as the search phrase “artificial intelligence queer.”\n\nIt’s ridiculous how many unrelated articles, written by me, you have to scroll before getting to something relevant. One of the stories I wrote about AI in the cannabis sector shows up if I search for “AI queer,” but it doesn’t show up if I search for “AI cannabis.”\n\nIt’s clear that my TNW author profile plays a large role in how Google News treats my work, but it’s also evident that the words “queer” and “pronouns” play a much larger role than any others when it comes to surfacing my work. And it does a disservice to both the queer and artificial intelligence communities when the algorithm surfaces my unrelated writings on, for example, quantum physics and Facebook when someone searches for “AI queer,” instead of important stories from reporters about LGBTQPIA+ issues in the STEM sectors.", "wired": ""}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"ars-technica": "https://arstechnica.com/tech-policy/2021/06/google-will-pay-268m-revamp-ad-platform-to-settle-antitrust-claims/", "engadget": "https://www.engadget.com/san-jose-google-downtown-west-approved-225211005.html", "hacker-news": "https://news.ycombinator.com/item?id=27379083", "recode": null, "techcrunch": "http://techcrunch.com/2021/06/17/google-announces-epyc-based-tau-virtual-machines-for-cloud/", "techradar": "https://www.techradar.com/how-to/how-to-use-google-lens-on-your-iphone-or-ipad", "the-next-web": "https://thenextweb.com/news/google-news-queer-ai-journalist", "wired": "https://www.wired.com/story/google-hopes-ai-turn-search-conversation/"}, 2]]