[["North Korea", ["bbc-news", "cnn", "fox-news", "abc-news", "breitbart-news", "axios", "the-hill", "the-washington-post"], {"bbc-news": " \"There are also many cases where the USB is set so it can only be viewed once on a certain computer, so you can't plug it in to another device or give it to someone else.", "cnn": " \"When a country has just lived through a coup attempt, it should urgently, honestly, examine what occurred ... Trump and many of his backers maliciously insist the election was stolen. \"When a country has just lived through a coup attempt, it should urgently, honestly, examine what occurred ... Trump and many of his backers maliciously insist the election was stolen. Most Americans \"don't agree with that protest,\" but GOP leaders are left \"riding the back of a tiger and they can't get off\" since leaders like Trump \"whip up their followers into a froth of hysteria.\" Most Americans \"don't agree with that protest,\" but GOP leaders are left \"riding the back of a tiger and they can't get off\" since leaders like Trump \"whip up their followers into a froth of hysteria.\" \"If history serves as a guide ... after a ceasefire is reached, the conflict will slowly fade from the headlines, the world will go back to its business and the Palestinians will largely be forgotten -- yet again. For those who sincerely want to see a just and lasting peace in the Middle East, this time must be different. The world, and especially the Biden administration, cannot look away but must engage on the question of Palestine. \"If history serves as a guide ... after a ceasefire is reached, the conflict will slowly fade from the headlines, the world will go back to its business and the Palestinians will largely be forgotten -- yet again. For those who sincerely want to see a just and lasting peace in the Middle East, this time must be different. The world, and especially the Biden administration, cannot look away but must engage on the question of Palestine. In Kushner's analysis, the road to peace in Israel ran not through Gaza, Jerusalem and the West Bank, but through the United Arab Emirates.\" In Kushner's analysis, the road to peace in Israel ran not through Gaza, Jerusalem and the West Bank, but through the United Arab Emirates.\" Israeli Prime Minister Benjamin Netanyahu's embrace of Trump helped erode support for Israel among American Jews, Freedman wrote. Israeli Prime Minister Benjamin Netanyahu's embrace of Trump helped erode support for Israel among American Jews, Freedman wrote. Israel's prime minister \"and Hamas each exploited or nurtured their own mobs to prevent an unprecedented national unity government from emerging in Israel -- a cabinet that for the first time would have included Israeli Jews and Israeli Arab Muslims together ... No, Hamas and Bibi don't talk. Israel's prime minister \"and Hamas each exploited or nurtured their own mobs to prevent an unprecedented national unity government from emerging in Israel -- a cabinet that for the first time would have included Israeli Jews and Israeli Arab Muslims together ... No, Hamas and Bibi don't talk. She and her husband are vaccinated, but since Salerno has multiple sclerosis, she is concerned that her MS treatment and weakened immune system could put her at higher risk should she contract the virus that causes Covid-19. \"With high vaccine rates and Covid-19 numbers falling in our state, we were starting to look forward to going back into the bookstore or out with friends,\" she wrote. She and her husband are vaccinated, but since Salerno has multiple sclerosis, she is concerned that her MS treatment and weakened immune system could put her at higher risk should she contract the virus that causes Covid-19. \"With high vaccine rates and Covid-19 numbers falling in our state, we were starting to look forward to going back into the bookstore or out with friends,\" she wrote.", "fox-news": " International Atomic Energy Agency Director General Rafael Grossi made the remark during a meeting of its board of governors, which is comprised of 35 nations including the U.S.\n\n\"The DPRK’s nuclear activities remain a cause for serious concern,\" he said.", "abc-news": " In their first meeting, Secretary of State Antony Blinken and Russian Foreign Minister Sergey Lavrov both discussed a desire to find ways to work together and advance areas where there are mutual interests -- a warmer tone than relations between the two nuclear-armed powers in recent years.", "breitbart-news": " Since the North Korean regime is extremely secretive, especially about the dictator’s health and private activities, outside observers were left poring over clues such as the movements of his personal railroad train and the whereabouts of his sister Kim Yo-jong – sometimes thought to be the next dictator-in-waiting, or at least an interim leader if Kim Jong-un is incapacitated. Kim Jong-un was out of the public eye for about a month before he reappeared at a Politburo meeting last week to discuss “urgent” state planning issues, South Korea’s NK News noted Tuesday. His watch strap, among other things, would certainly suggest so: https://t.co/JJDyt2Fa4x @nknewsorg pic.twitter.com/3r8KHfnw9y — James Pearson (@pearswick) June 8, 2021\n\nNK News quoted Massachusetts Institute of Technology (MIT) political science professor Vipin Narang speculating that if Kim made the effort to slim down intentionally, it “likely improves his position at home” because it would suggest Kim feels secure enough in power to spend some time on self-improvement, and getting healthy means he plans to stick around for the long term. The South Korean Unification Ministry declined to comment on Kim Jong-un’s health Thursday, although it said it is “analyzing photos when Kim Jong-un’s public activities are reported.”", "axios": " Driving the news: Director-General Rafael Mariano Grossi sat down with \"Axios on HBO\" at IAEA headquarters in Vienna, ahead of Iran's June 18 presidential election and a June 24 extension on negotiations seeking to restore curtailed surveillance of Iranian nuclear sites and salvage the 2015 deal. The big picture: Grossi also addressed North Korea; Israel's resistance to joining the Treaty of Non-Proliferation of Nuclear Weapons (NPT); and the limits of what the IAEA knows about the programs of the U.S., Russia and other nuclear powers.", "the-hill": " Biden’s summit with Moon comes as the administration looks to shape its foreign policy beyond former President Trump Donald TrumpBiden prepares to confront Putin Biden aims to bolster troubled Turkey ties in first Erdoğan meeting Senate investigation of insurrection falls short MORE, who engaged in several failed attempts to negotiate directly with North Korean leader Kim Jong Un Kim Jong UnOvernight Defense: Austin and Milley talk budget, Afghanistan, sexual assault and more at wide-ranging Senate hearing North Korea calls U.S.-South Korea missile development hostile policy Biden's invisible foreign policy success MORE on the country’s nuclear weapons program.", "the-washington-post": ""}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"bbc-news": "https://www.bbc.co.uk/news/world-asia-57225936", "cnn": "https://www.cnn.com/2021/05/23/opinions/he-spoke-truth-to-trump-opinion-column-galant/index.html", "fox-news": "https://www.foxnews.com/world/un-nuclear-watchdog-north-korea-activity-serious-concern", "abc-news": "https://abcnews.go.com/Politics/blinken-lavrov-play-nice-1st-meeting-us-waives/story?id=77789287", "breitbart-news": "https://www.breitbart.com/national-security/2021/06/10/photos-show-dramatic-weight-loss-for-north-korean-dictator-kim-jong-un/", "axios": "https://www.axios.com/iran-nuclear-deal-iaea-a573f571-abc0-423c-86b7-5d2d16643f5c.html", "the-hill": "https://thehill.com/policy/international/asia-pacific/556184-north-korea-calls-us-south-korea-missile-development", "the-washington-post": "https://www.washingtonpost.com/national-security/2021/05/21/medal-of-honor-ralph-puckett/"}], ["Lebron James", ["espn", "bleacher-report", "four-four-two", "nfl-news", "nhl-news", "talksport", "the-sport-bible", "bbc-sport"], {"espn": " LeBron James, Russell Westbrook and a slew of networks are among those releasing documentaries based on the tragic backstory of the Tulsa Race Massacre of 1921\n\nLOS ANGELES -- Several documentary filmmakers — some backed by NBA superstars — are shedding light on the historically ignored Tulsa Race Massacre of 1921, one of the most horrific tragedies in American history. “This has to do with African Americans systematically being run off their land with assets and property being destroyed,” said Stanley Nelson, who co-directed “Tulsa Burning: 1921 Race Massacre” with Marco Williams. She pitched her Tulsa massacre documentary to some networks nearly five years ago, but drew no interest because she believes the “gatekeepers” weren’t ready to welcome the story. “I just had to get it to the right gatekeepers,” said Koroma, director of “Dreamland: The Burning of Black Wall Street'' which airs Monday on CNN and later streams on HBO Max. But with all our powers combined, we can tell this story.”\n\nThe Tulsa massacre story had been largely forgotten or unknown to some until HBO series “Watchmen” and “Lovecraft Country” shed light on the dark tragedy within the last two years. “Black survivors only whispered about it, because there was a real fear among Black people that it could happen again, and it did in other places.”\n\nAs a curious child, Brown said she first learned about the massacre after reading about the history of enslaved Black people at school. “(The Tulsa massacre) is not known to the larger community, certainly not known by white America,” said Jonathan Silvers, who worked with Brown as the director on the PBS documentary.", "bleacher-report": " But the way the NBA handled James' health and safety protocol violation shortly before addressing a similar violation by Porzingis, raised a lot more questions than answers. Porzingis attended a strip club last Sunday following Dallas' Game 1 win over the Los Angeles Clippers, and NBA rules prohibit players from going into a \"bar, club, lounge or similar establishment, regardless of player's vaccination status.\" Similar to Porzingis, James' attendance was a violation of the league's health and safety protocol. Not only does the way the league handled the two player violations raise more questions, it also shines a brighter spotlight on how the NBA's health and safety protocols aren't necessarily aligned with the changing protocols in various NBA cities. For Porzingis, whom ESPN's Tim MacMahon reported is fully vaccinated, he would still be in violation of the league's health and safety protocol at a time when cities are relaxing restrictions for those who are fully vaccinated and federal guidelines are changing quickly. There are several factors still unknown about James' attendance at the outdoor event and those individuals at the strip club when Porzingis was there, complicating determining whether either player violated local guidelines as they relate to outdoor gatherings or indoor bars/clubs in Los Angeles.", "four-four-two": "", "nfl-news": "", "nhl-news": "", "talksport": "", "the-sport-bible": "", "bbc-sport": ""}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"espn": "https://abcnews.go.com/Entertainment/wireStory/tulsa-massacre-documentaries-offer-deep-dive-tragedy-77986783", "bleacher-report": "https://bleacherreport.com/articles/2943818-is-lebron-james-getting-preferential-treatment-with-nbas-covid-protocols", "four-four-two": null, "nfl-news": null, "nhl-news": null, "talksport": null, "the-sport-bible": null, "bbc-sport": "https://www.bbc.co.uk/sport/basketball/57361225"}], ["Google", ["ars-technica", "engadget", "hacker-news", "recode", "techcrunch", "techradar", "the-next-web", "wired"], {"ars-technica": " “The AdX platform is only partially interoperable with DFP’s competing ad servers and does not allow the latter to organize a competition between AdX and its competitors—even though AdX itself has a privileged access to a significant portion of advertisers’ demand and while all of these competitors have adopted standards allowing for fairer competition,” the authority said.", "engadget": "", "hacker-news": " The specific example that pushed me over the edge to write this was searching for a news article I know exists on Battlefield 1 sales numbers, instead google's showing me the standard stuff (wiki articles that don't have what I'm looking for) and telling me about battlefield V or the new battlefield that's about to release.", "recode": "", "techcrunch": " “Customers across every industry are dealing with more demanding and data-intensive workloads and looking for strategic ways to speed up performance and reduce costs,” Google Cloud CEO Thomas Kurian said in a press release. “Our work with key strategic partners like AMD has allowed us to broaden our offerings and deliver customers the best price performance for compute-heavy, business-critical applications– all on the cleanest cloud in the industry.”\n\nGoogle has already signed up some high-profile customers for an early trial, including Twitter, Snap and DoIT.", "techradar": " Whether you want to translate text, identify plants or find answers to equations, Google Lens is an incredibly useful image recognition tool – and it’s really easy to install and use on an iOS device. Install the app and you’ll be able to use Google Lens with your camera in real time on iPhone (though not on iPad, sadly), as well as searching with images already saved to your camera roll. (Image credit: Future)\n\nThe key difference, though, is that Google Photos does not allow you to search in real-time with your iPhone or iPad camera. (Image credit: Future)\n\nOnce you’ve selected the relevant mode, simply aim your camera at the object which you’d like Google Lens to search with. As above, you don’t need to take another photo: just tap on one of the white circles within the image you already shot, to find out what Google Lens has identified. Don’t worry: you can easily use Google Lens to search with photos saved to your iPhone or iPad’s camera roll, any time. Likewise, even if Google Lens does recognize the object, the suggested search results sometimes aren’t the most useful – or accurate.", "the-next-web": " When people search Google News for the word “barn,” you’d probably hope it surfaced your work. As of the time of this article’s publishing, if you navigate to Google News and type “artificial intelligence queer” into the search box and then hit enter, you should be introduced to a lot of my work. Using Incognito Mode, Google News returns 120 results for “artificial intelligence queer,” of which 37 are stories that I wrote. Here’s what that means: my journalism represents approximately 30% of the Google News search results for “artificial intelligence queer,” even though only 24% of my listed articles are about anything queer-related. It turns out, when he searches for “artificial intelligence Arsenal,” more of his stories surfaced than when he just searched for “artificial intelligence.” But only a few of Tom’s pieces made the list either way. When I search for my pieces there’s a huge difference between just searching for “artificial intelligence” (only one result) and “artificial intelligence queer” (37 results). If I search for “AI queer” the number of my articles that surfaces drops to 21, but if I search for “artificial intelligence pronouns” it leaps to 44 out of 120. In fact, if I substitute “machine learning” for “artificial intelligence,” a term I don’t use at all in my profile, it surfaces zero results on its own and 27 results with “queer” added. Slapping some pronouns in my bio and having the privilege of working for a company that enthusiastically supports my reporting on queer issues shouldn’t give me a lion’s share of the results for something as broadly reported on as the search phrase “artificial intelligence queer.”\n\nIt’s ridiculous how many unrelated articles, written by me, you have to scroll before getting to something relevant. One of the stories I wrote about AI in the cannabis sector shows up if I search for “AI queer,” but it doesn’t show up if I search for “AI cannabis.”\n\nIt’s clear that my TNW author profile plays a large role in how Google News treats my work, but it’s also evident that the words “queer” and “pronouns” play a much larger role than any others when it comes to surfacing my work. And it does a disservice to both the queer and artificial intelligence communities when the algorithm surfaces my unrelated writings on, for example, quantum physics and Facebook when someone searches for “AI queer,” instead of important stories from reporters about LGBTQPIA+ issues in the STEM sectors.", "wired": ""}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"ars-technica": "https://arstechnica.com/tech-policy/2021/06/google-will-pay-268m-revamp-ad-platform-to-settle-antitrust-claims/", "engadget": "https://www.engadget.com/how-to-watch-google-io-2021-160830701.html", "hacker-news": "https://news.ycombinator.com/item?id=27379083", "recode": null, "techcrunch": "http://techcrunch.com/2021/06/17/google-announces-epyc-based-tau-virtual-machines-for-cloud/", "techradar": "https://www.techradar.com/how-to/how-to-use-google-lens-on-your-iphone-or-ipad", "the-next-web": "https://thenextweb.com/news/google-news-queer-ai-journalist", "wired": "https://www.wired.com/story/google-hopes-ai-turn-search-conversation/"}]]