[["Google", ["ars-technica", "engadget", "hacker-news", "recode", "techcrunch", "techradar", "the-next-web", "wired"], {"ars-technica": ["Antitrust settlement forces Google to revamp ad platform", " “The AdX platform is only partially interoperable with DFP’s competing ad servers and does not allow the latter to organize a competition between AdX and its competitors—even though AdX itself has a privileged access to a significant portion of advertisers’ demand and while all of these competitors have adopted standards allowing for fairer competition,” the authority said."], "engadget": ["Google quietly ends support for its augmented reality Measure app", ""], "hacker-news": ["Ask HN: Has Google search got noticably worse recently?", " The specific example that pushed me over the edge to write this was searching for a news article I know exists on Battlefield 1 sales numbers, instead google's showing me the standard stuff (wiki articles that don't have what I'm looking for) and telling me about battlefield V or the new battlefield that's about to release."], "recode": [null, ""], "techcrunch": ["Google announces EPYC-based Tau virtual machines for Cloud – TechCrunch", " “Customers across every industry are dealing with more demanding and data-intensive workloads and looking for strategic ways to speed up performance and reduce costs,” Google Cloud CEO Thomas Kurian said in a press release. “Our work with key strategic partners like AMD has allowed us to broaden our offerings and deliver customers the best price performance for compute-heavy, business-critical applications– all on the cleanest cloud in the industry.”\n\nGoogle has already signed up some high-profile customers for an early trial, including Twitter, Snap and DoIT."], "techradar": ["How to use Google Lens on your iPhone or iPad", " Whether you want to translate text, identify plants or find answers to equations, Google Lens is an incredibly useful image recognition tool – and it’s really easy to install and use on an iOS device. Install the app and you’ll be able to use Google Lens with your camera in real time on iPhone (though not on iPad, sadly), as well as searching with images already saved to your camera roll. (Image credit: Future)\n\nThe key difference, though, is that Google Photos does not allow you to search in real-time with your iPhone or iPad camera. (Image credit: Future)\n\nOnce you’ve selected the relevant mode, simply aim your camera at the object which you’d like Google Lens to search with. As above, you don’t need to take another photo: just tap on one of the white circles within the image you already shot, to find out what Google Lens has identified. Don’t worry: you can easily use Google Lens to search with photos saved to your iPhone or iPad’s camera roll, any time. Likewise, even if Google Lens does recognize the object, the suggested search results sometimes aren’t the most useful – or accurate."], "the-next-web": ["Google News thinks I’m the queerest AI journalist on Earth", " When people search Google News for the word “barn,” you’d probably hope it surfaced your work. As of the time of this article’s publishing, if you navigate to Google News and type “artificial intelligence queer” into the search box and then hit enter, you should be introduced to a lot of my work. Using Incognito Mode, Google News returns 120 results for “artificial intelligence queer,” of which 37 are stories that I wrote. Here’s what that means: my journalism represents approximately 30% of the Google News search results for “artificial intelligence queer,” even though only 24% of my listed articles are about anything queer-related. It turns out, when he searches for “artificial intelligence Arsenal,” more of his stories surfaced than when he just searched for “artificial intelligence.” But only a few of Tom’s pieces made the list either way. When I search for my pieces there’s a huge difference between just searching for “artificial intelligence” (only one result) and “artificial intelligence queer” (37 results). If I search for “AI queer” the number of my articles that surfaces drops to 21, but if I search for “artificial intelligence pronouns” it leaps to 44 out of 120. In fact, if I substitute “machine learning” for “artificial intelligence,” a term I don’t use at all in my profile, it surfaces zero results on its own and 27 results with “queer” added. Slapping some pronouns in my bio and having the privilege of working for a company that enthusiastically supports my reporting on queer issues shouldn’t give me a lion’s share of the results for something as broadly reported on as the search phrase “artificial intelligence queer.”\n\nIt’s ridiculous how many unrelated articles, written by me, you have to scroll before getting to something relevant. One of the stories I wrote about AI in the cannabis sector shows up if I search for “AI queer,” but it doesn’t show up if I search for “AI cannabis.”\n\nIt’s clear that my TNW author profile plays a large role in how Google News treats my work, but it’s also evident that the words “queer” and “pronouns” play a much larger role than any others when it comes to surfacing my work. And it does a disservice to both the queer and artificial intelligence communities when the algorithm surfaces my unrelated writings on, for example, quantum physics and Facebook when someone searches for “AI queer,” instead of important stories from reporters about LGBTQPIA+ issues in the STEM sectors."], "wired": ["Google Hopes AI Can Turn Search Into a Conversation", ""]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"ars-technica": "https://arstechnica.com/tech-policy/2021/06/google-will-pay-268m-revamp-ad-platform-to-settle-antitrust-claims/", "engadget": "https://www.engadget.com/google-ends-support-augmented-reality-measure-app-075038678.html", "hacker-news": "https://news.ycombinator.com/item?id=27379083", "recode": null, "techcrunch": "http://techcrunch.com/2021/06/17/google-announces-epyc-based-tau-virtual-machines-for-cloud/", "techradar": "https://www.techradar.com/how-to/how-to-use-google-lens-on-your-iphone-or-ipad", "the-next-web": "https://thenextweb.com/news/google-news-queer-ai-journalist", "wired": "https://www.wired.com/story/google-hopes-ai-turn-search-conversation/"}, 7, 1624420372.339201], ["", ["bbc-news", "cnn", "fox-news", "abc-news", "breitbart-news", "axios", "the-hill", "the-washington-post"], {"bbc-news": ["Republicans block 9/11-style congressional probe of Capitol riot", ""], "cnn": ["Opinion: Democrats, act now to protect US democracy from death spiral", " JUST WATCHED Joe Manchin plays monkey wrench to Democrats' plans Replay More Videos ... MUST WATCH Joe Manchin plays monkey wrench to Democrats' plans 01:51\n\nBut now GOP-controlled state legislatures across the country have begun taking steps to curtail voting rights, many of which will adversely impact voters of color. As people who've committed our whole lives to movements for justice and a multiracial democracy, we know that immediate federal protection against current assaults on voting rights is non-negotiable."], "fox-news": ["'The Squad' wields outsized power as Pelosi grapples with slimmest majority since World War II", " House Democrats, however, have touted their unity as they've been able to pass major legislation this year, including the $1.9 trillion coronavirus relief bill that President Biden signed into law, as well as their other legislative priorities that await Senate action, such as election reform overhaul, D.C. statehood, expanded gun background checks and police reform legislation. HOUSE APPROVES LEGISLATION TO FORM JAN. 6 BIPARTISAN COMMISSION TO INVESTIGATE CAPITOL RIOT\n\n\"While Democrats have spent the first five months passing urgently needed relief for the American people, Republicans have spent the first five months of the 117th Congress in disarray, ousting a member of their own senior leadership team for telling the truth about the election, while embracing Marjorie Taylor Greene and Matt Gaetz,\" one senior Democratic aide told Fox News. 'SQUAD' DEMS MAY UNRAVEL POLICE-REFORM DEAL IN PUSH TO END QUALIFIED IMMUNITY: 'WEAPON OF STRUCTURAL RACISM'\n\nNow, House progressives are threatening to undo all that progress by sending a letter to House and Senate leadership saying ending qualified immunity must be included in the legislation as a way to hold officers accountable."], "abc-news": ["Texas GOP's Allen West resigns after combative run as chair", " Texas GOP Chairman Allen West is stepping down after a short but combative run of using the job to antagonize top Republicans in America’s biggest red state\n\nAUSTIN, Texas -- Texas GOP Chairman Allen West said Friday he is stepping down after a short but combative run of using the job to antagonize top Republicans in America's biggest red state, including protesting outside Gov. Matt Mackowiak, a Republican strategist in Austin and chairman of the Travis County GOP where the state party offices are based, said West had “decimated\" field efforts at a time when Democrats are gaining ground in Texas and had let voter registration efforts slide."], "breitbart-news": ["CNN’s Lemon: Republicans Are ‘the Party of Antisemitism’", " CNN anchor Don Lemon said Tuesday the Republican Party was “the party of insensitive statements about the Holocaust and Jewish people.”\n\nBased on that conclusion, he called the GOP “the party of antisemitism.”\n\nLemon said, “We’ve learned that hate flourishing from anti-Asian hate to anti-Semitism, to the trolls trying to bring America down like the QAnon congresswoman doubling down on her blatant anti-Semitism and ignorance today, comparing a vaccine logo — oh, God, to the yellow star. Well, it’s yellow, not gold, the Nazis forced Jewish people to wear.”\n\nReferencing Marjorie Taylor Greene’s comments comparing mask mandates to the Holocaust, Lemon continued, “It took leaders of her party five whole days to speak out about the lunacy of one freshman congresswoman. It took them five days to condemn Marjorie Taylor Greene’s antisemitism.”\n\nHe continued, “I want you to think about this, whatever you do for a living, if there was someone in your workplace who said some stuff like this, what would happen to them? I think you know the answer.”\n\nLemon added, “Sources telling CNN that GOP donors and House members urged McCarthy to urge him to say something, but he’s unlikely to kick her out of the conference. That’s what Republicans are signing up for, allegiance to —you know how this part goes, say it with me, a disgraced, twice-impeached, one-term former president who could face potential criminal charges over his family business."], "axios": ["New tech antitrust hurdle: GOP divisions", " What they're saying: \"Mr. Jordan has repeatedly said that everything is on the table when it comes to holding Big Tech accountable,\" Russell Dye, communications director for Jordan and House Judiciary Republicans, told Axios in a statement, noting that Democrats have yet to introduce new, major antitrust bills."], "the-hill": ["Autocracy is bad for business", " One of the leading books on the death of democracy in Hungary under Viktor Orbán bears a title that captures the problem for business very well — “The Post-Communist Mafia State.” The Georgia legislature’s move to withdraw tax breaks from Delta Airlines employs a widely understood tactic of “new autocrats” like Orbán — who rely more on punitive state economic pressures rather than on state violence to squelch dissent and break down democracy. If state electoral bodies controlled by Republican hard-liners falsify election results, the next election may lead to street battles, violence and chaos that will make the Jan. 6 attack on the Capitol look like child’s play."], "the-washington-post": ["As DeSantis takes aim at cruise industry, Republicans step up attacks on longtime allies in corporate America", ""]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"bbc-news": "https://www.bbc.co.uk/news/world-us-canada-57272756", "cnn": "https://www.cnn.com/2021/06/22/opinions/voting-rights-democracy-death-spiral-arnwine-barber-hair-jackson/index.html", "fox-news": "https://www.foxnews.com/politics/squad-power-pelosi-slim-democratic-house-majority", "abc-news": "https://abcnews.go.com/Politics/wireStory/texas-gops-allen-west-resigns-combative-run-chair-78086762", "breitbart-news": "https://www.breitbart.com/clips/2021/05/25/cnns-lemon-republicans-are-the-party-of-antisemitism/", "axios": "https://www.axios.com/tech-antitrust-hurdle-republican-party-splits-c7324063-53ba-458e-b0e2-fbf2e475a8a8.html", "the-hill": "https://thehill.com/opinion/international/556869-autocracy-is-bad-for-business", "the-washington-post": "https://www.washingtonpost.com/us-policy/2021/06/08/republicans-business-desantis-cruise/"}, 6, 1624420561.44785], ["", ["bbc-news", "cnn", "fox-news", "abc-news", "breitbart-news", "axios", "the-hill", "the-washington-post"], {"bbc-news": ["Republicans block 9/11-style congressional probe of Capitol riot", ""], "cnn": ["Terry McAuliffe is the face of the Democratic Party, circa 2021?", " That’s surprising, given not only Democrats’ focus nationally on the diversity of their coalition, but also because 1 in 5 residents of the commonwealth are Black – and the percentage of African American voters in a Democratic primary in Virginia is far higher than that."], "fox-news": ["'The Squad' wields outsized power as Pelosi grapples with slimmest majority since World War II", " House Democrats, however, have touted their unity as they've been able to pass major legislation this year, including the $1.9 trillion coronavirus relief bill that President Biden signed into law, as well as their other legislative priorities that await Senate action, such as election reform overhaul, D.C. statehood, expanded gun background checks and police reform legislation. HOUSE APPROVES LEGISLATION TO FORM JAN. 6 BIPARTISAN COMMISSION TO INVESTIGATE CAPITOL RIOT\n\n\"While Democrats have spent the first five months passing urgently needed relief for the American people, Republicans have spent the first five months of the 117th Congress in disarray, ousting a member of their own senior leadership team for telling the truth about the election, while embracing Marjorie Taylor Greene and Matt Gaetz,\" one senior Democratic aide told Fox News. 'SQUAD' DEMS MAY UNRAVEL POLICE-REFORM DEAL IN PUSH TO END QUALIFIED IMMUNITY: 'WEAPON OF STRUCTURAL RACISM'\n\nNow, House progressives are threatening to undo all that progress by sending a letter to House and Senate leadership saying ending qualified immunity must be included in the legislation as a way to hold officers accountable."], "abc-news": ["Georgia Democrats seize new power, run for statewide offices", " Boosted by President Biden's win and two U.S. Senate victories, high-profile Democratic candidates in Georgia are running for statewide office in a way unseen in years\n\nATLANTA -- For more than a decade, Georgia Democrats struggled to lure highly qualified, big-name candidates to run for statewide office. Boosted by significant electoral victories in the 2020 election, a near-win of the governor’s office in 2018 and rapidly changing state demographics, seven sitting Democratic lawmakers have declared candidacies for one of Georgia’s eight statewide offices — a full nine months away from the 2022 qualifying deadline. Among them are names that have drawn national notice, including Democratic state Rep. Bee Nguyen, a candidate for secretary of state who seeks to leverage her party’s outrage over Georgia’s restrictive new voting law to raise money nationwide, and state Sen. Jen Jordan, who is running for attorney general. Before Biden’s victory, the last Democrats to win statewide were four incumbents who retained down-ballot offices in 2006, even as Republican Sonny Perdue swept to reelection as governor."], "breitbart-news": ["Dem Chicago Alderman: Democrats Seem ‘Enamored with the Mentality of Being Enablers to Criminality’ – City ‘Under Siege’", " On Thursday’s broadcast of the Fox News Channel’s “The Story,” Chicago Alderman Raymond Lopez (D) said that Chicago Mayor Lori Lightfoot’s (D) policies have “put the entire city under siege” and that “the Democratic Party on so many levels seems to be enamored with the mentality of being enablers to criminality.”\n\nLopez said, “The only thing that is equitable about what the mayor’s policies have been is to put the entire city under siege and to spread fear and violence into every neighborhood, so much so that it’s now commonplace and doesn’t even raise an eye nationally.”\n\nHe added that history has proven his criticisms of the mayor on crime correct, such as the lack of preparation for riots last year, “and even some of my fellow Democrats privately will concede that they wish that we did more to make our neighborhoods safe again."], "axios": ["Democrat Melanie Stansbury wins House seat to replace Deb Haaland", " Democrat Melanie Stansbury defeated her Republican opponent Mark Moores in the special election to represent New Mexico's 1st congressional district, a House seat vacated when Deb Haaland was confirmed as President Biden's Interior secretary, per AP."], "the-hill": ["Corporate social responsibility should mean offsetting business ties in China", " Again, companies do not need to withdraw all business with China tomorrow — but as corporate boards continue investing and operating in China, they should consider these suggestions:\n\nFirst, companies should work to find alternate sources of goods and services to reduce dependence on China. I hope these offsets are not needed permanently — when China ceases its genocide, stops arresting legislators in Hong Kong and lowers its tensions with Taiwan, companies should resume strong business ties with China."], "the-washington-post": ["Pressure mounts on Manchin as ‘panic’ sets in among Democrats over voting rights", " Sen. Amy Klobuchar (D-Minn.), who has helped spearhead the For the People Act in the Senate, accused Republicans of waging a “continuing insurrection” after their 2020 electoral losses."]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"bbc-news": "https://www.bbc.co.uk/news/world-us-canada-57272756", "cnn": "https://www.cnn.com/2021/06/09/politics/terry-mcauliffe-face-of-the-democratic-party/index.html", "fox-news": "https://www.foxnews.com/politics/squad-power-pelosi-slim-democratic-house-majority", "abc-news": "https://abcnews.go.com/Politics/wireStory/democrats-seizing-growing-power-run-statewide-offices-78220990", "breitbart-news": "https://www.breitbart.com/clips/2021/06/17/dem-chicago-alderman-democrats-seem-enamored-with-the-mentality-of-being-enablers-to-criminality-city-under-siege/", "axios": "https://www.axios.com/new-mexico-special-election-results-fb50e9da-b28c-4db9-9d9f-615b26947653.html", "the-hill": "https://thehill.com/opinion/international/558270-corporate-social-responsibility-should-mean-offsetting-business-ties-in", "the-washington-post": "http://www.washingtonpost.com/politics/manchin-voting-rights/2021/06/02/103db892-c320-11eb-93f5-ee9558eecf4b_story.html"}, 6, 1624420624.585834], ["Apple", ["ars-technica", "engadget", "hacker-news", "recode", "techcrunch", "techradar", "the-next-web", "wired"], {"ars-technica": ["watchOS 8 brings new health and messaging features to the Apple Watch this year", " Apple's also adding severe weather alerts, next hour precipitation notifications, Find Me integration to track Air Tags, support for multiple simultaneous timers (great for cooking, and supported by Siri), a new Tips app, Contacts app, and Radio support within the Music app. All of these new functions will be compatible with Apple Watches Series 3 and up, save for the Portrait watch face which will not be available on Apple Watch Series 3. watchOS 8 beta will be available starting in July, while the final release hits supported Apple Watch devices this fall."], "engadget": ["Apple Podcasts subscriptions launch globally", ""], "hacker-news": ["Ask HN: What's an interesting DIY genetic engineering project?", " Given some hundreds of dollars and breaking no federal laws, what kind of gene editing can a software dev get done in their kitchen?"], "recode": ["No article found", ""], "techcrunch": ["Apple Music launches Spatial Audio and Lossless Audio, adds Spatial Audio playlists – TechCrunch", ""], "techradar": ["New MacBook Pro could appear at WWDC 2021 sporting M2 chip", " Huberty said: “Based on our checks, we believe it’s likely Apple launches a new MacBook featuring in-house designed silicon.”\n\nThere are already several rumors flying around indicating the same, with recent speculation coming from another analyst, Wedbush’s Daniel Ives, who said one of the surprises of WWDC would be the revelation of new MacBook Pro 14-inch and MacBook Pro 16-inch models. Certainly there are more than a few reports pointing to a second half of 2021 launch for the rumored new MacBook Pro model(s), and indeed we’ve even heard some talk of potential delays related to component shortages (which could even threaten to push the on-sale timeframe to 2022 – a possibility we’ve heard a couple of times now)."], "the-next-web": ["You’ll only get 3 free months of Apple TV+ with your new devices soon", " Ivan covers Big Tech, India, policy, AI, security, platforms, and apps for TNW. Ivan covers Big Tech, India, policy, AI, security, platforms, and apps for TNW. Here’s what the full text says:\n\nEligible devices activated July 1, 2021 or later will qualify for offers of 3 months free Apple TV+. [Read: Why entrepreneurship in emerging markets matters]\n\nApple’s new move indicates that the company is not bothered about raking up subscriber numbers, and is now shifting gears to make some money\n\nApple TV+ has some great titles such as The Morning Show, Ted Lasso, and Servent."], "wired": ["Apple World's Full Scope Is Coming Into Focus", " Apple’s Monday morning keynote address for its annual WWDC developer conference—an event that’s designed to get app-makers excited to make more apps—emphasized above all tight interoperability between Apple devices, Apple software, and Apple’s growing list of subscription services. When you buy one Apple product, you find yourself wanting to buy more because the experience is designed to be better with more of them.”\n\nTry the Combo Platter\n\nFor anyone not already super familiar with Apple’s tech ecosystem, the keynote might have been a dizzying deluge of product names and integrations. But as you watched Apple’s presenters hop from new feature to new feature, you may have noticed that many of iOS 15’s coming enhancements position the iPhone as a kind of command center for other Apple products—one that highlights Apple’s subscription services above others. But those music tracks are Apple Music tracks, and if you’d like to co-watch an episode of Apple TV+ hit show Ted Lasso with a friend, you’d better both be Apple TV+ subscribers."]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"ars-technica": "https://arstechnica.com/gadgets/2021/06/watchos-8-brings-new-health-tracking-features-to-the-apple-watch-this-year/", "engadget": "https://www.engadget.com/apple-podcasts-subscriptions-launch-102556622.html", "hacker-news": "https://news.ycombinator.com/item?id=27475080", "recode": null, "techcrunch": "http://techcrunch.com/2021/06/08/apple-music-launches-spatial-audio-and-lossless-audio-adds-spatial-audio-playlists/", "techradar": "https://www.techradar.com/news/new-macbook-pro-could-appear-at-wwdc-2021-sporting-m2-chip", "the-next-web": "https://thenextweb.com/news/apple-tv-trial-july-three-months", "wired": "https://www.wired.com/story/if-you-want-to-live-in-apple-world-gather-all-your-idevices/"}, 1, 1624421797.2568982]]