[["Republican", {"fox-news": ["https://www.foxnews.com/us/nebraska-republican-anti-crt-resolution", "Nebraska Republican pushes anti-CRT resolution at state university", " The University of Nebraska (NU) is set to consider a proposal opposing critical race theory (CRT), arguing that it \"does not promote inclusive and honest dialogue and education on campus.\" It reads in part: \"Whereas we oppose discrimination in any form and whereas critical race theory does not promote inclusive and honest dialogue and education on campus and whereas critical race theory proponents seek to silence opposing views and disparage important American ideals, be it resolved that the regents of the University of Nebraska oppose any imposition of critical race theory in curriculum.\" WEBSITE LAUNCHED TO TRACK CRITICAL RACE THEORY TEACHING IN HIGHER EDUCATION\n\nWhile it's difficult to track resolutions like these, Pillen's campaign claims he's the first public university regent in the country to introduce such a resolution. Bill Richardson, a Cornell Law School professor and founder of criticalrace.org, which tracks CRT training in higher education, told Fox News that Pillen's resolution gave an honest account of CRT's downsides. \"Numerous universities and colleges have issued public statements supporting, and in some cases mandating, a critical race theory approach to the curriculum, usually using code words such as 'antiracism' or ‘equity,’\" he told Fox News via email.", "conservative"], "the-hill": ["https://thehill.com/policy/finance/overnights/561983-on-the-money-job-openings-stayed-at-record-high-of-92-million-in", "On The Money: Job openings stayed at record high of 9.2 million in May | Biden to issue executive order to curtail noncompete clauses | Top Republican signals early resistance to any global tax deal", " LEADING THE DAY\n\nADVERTISEMENT\n\nBiden to issue executive order to curtail noncompete clauses: President Biden Joe BidenWife of assassinated Haitian president taken to Florida for treatment 4 suspected killers of Haitian president fatally shot by police Senate eyes taking up bipartisan infrastructure deal as soon as July 19 MORE plans to sign an executive order to crack down on noncompete agreements used by employers to prevent their employees from moving to rival firms, the White House announced Wednesday. It makes sense,” White House press secretary Jen Psaki Jen PsakiOn The Money: Job openings stayed at record high of 9.2 million in May | Biden to issue executive order to curtail noncompete clauses | Top Republican signals early resistance to any global tax deal Hillicon Valley: Trump files lawsuit against Facebook, Twitter, and Google | New cyberattacks ramp up tensions with Russia | 36 states, DC sue Google alleging antitrust violations in app store Inside Biden's pragmatic approach to coronavirus rules MORE said during a press briefing. Top Republican signals early resistance to any global tax deal: Rep. Kevin Brady Kevin Patrick BradyOn The Money: Job openings stayed at record high of 9.2 million in May | Biden to issue executive order to curtail noncompete clauses | Top Republican signals early resistance to any global tax deal Top Republican signals early resistance to any global tax deal 130 countries announce support for global minimum tax MORE (R-Texas) on Wednesday said he thinks it will be challenging for Congress to sign off on an international tax deal, as the Biden administration seeks to make progress on such an agreement this week. \"I think this is frankly years from being done, and I'm confident that Congress will reject any tax agreement that advantages foreign companies and workers over U.S. companies, or surrenders a key part of America's tax base that we'll need frankly to pay for our government services going forward,\" Brady, the top Republican on the House Ways and Means Committee, said on a call with reporters. Brady's comments come as Treasury Secretary Janet Yellen Janet Louise YellenOn The Money: Job openings stayed at record high of 9.2 million in May | Biden to issue executive order to curtail noncompete clauses | Top Republican signals early resistance to any global tax deal Top Republican signals early resistance to any global tax deal The Hill's Morning Report - Cheney 'honored' to serve on select committee MORE is set to attend the Group of 20 (G-20) finance ministers meeting later this week in Venice, Italy.", "center"], "breitbart-news": ["https://www.breitbart.com/politics/2021/07/07/irs-grants-christian-group-tax-exempt-status-after-equating-bibles-teachings-with-republican-party/", "IRS Grants Christian Group Tax-Exempt Status After Initial Denial", " The Internal Revenue Service (IRS) granted a Christian group, Christians Engaged, tax-exempt status after initially denying it, saying, “[B]ible teachings are typically affiliated with the [Republican] party and candidates,” First Liberty Institute announced on Wednesday. It received a rejection letter on May 18, 2021, from Exempt Organizations Director Stephen A. Martin, saying the group “engage[s] in prohibited political campaign intervention” and “operate[s] for a substantial non-exempt private purpose and for the private interests of the [Republican] party.”\n\nMartin stated in his letter that the group does not meet requirements for tax exemption because biblical causes tend to favor the Republican Party:\n\nSpecifically, you educate Christians on what the Bible says in areas where they can be instrumental including the areas of sanctity of life, the definition of marriage, biblical justice, freedom of speech, defense, and borders and immigration, U.S. and Israel relations. On June 25, 15 Republican lawmakers sent a letter to Commissioner Charles Rettig demanding the IRS reverse its decision to deny the group tax-exempt status and terminate the employees responsible for the “blatantly biased, discriminatory, and flawed reasoning that led to the determination.”\n\nLawmakers and counsel for First Liberty Institute Lea Patterson both previously expressed worry that the IRS’s denial could set a precedent for future discrimination against other religious organizations and churches. Patterson told Breitbart News on Wednesday that the IRS “simply granted Christians Engaged tax-exempt status without explanation.”\n\n“Certainly, our hope is that no other religious group or church will have to go through this, and the IRS will adhere to its own regulations and the law,” she said.", "conservative"], "cnn": ["https://www.cnn.com/2021/07/07/politics/jim-hagedorn-kidney-cancer/index.html", "Minnesota Republican congressman announces reoccurrence of kidney cancer", "(CNN) Republican Rep. Jim Hagedorn announced a reoccurrence of his kidney cancer on Wednesday. The Minnesota lawmaker was first diagnosed with stage IV kidney cancer on February 15, 2019, and had been receiving care at Rochester's Mayo Clinic.\n\n\"Over the weekend, recent tests conducted at the Mayo Clinic revealed a reoccurrence of my kidney cancer. The new diagnosis was surprising considering that just 14 weeks ago no cancer was detected,\" Hagedorn said in a statement\n\nHagedorn said that his diagnosis has not prevented him from doing his job and that he has no intentions of slowing down.\n\n\"Since initially being diagnosed with advanced kidney cancer 29 months ago, my doctors consider my response to treatment and recovery as exceptional. Since that time, I have maintained a full, active schedule in Congress, campaigned aggressively for re-election, and lived and enjoyed life to the fullest,\" he said.\n\n\"Be assured, I will continue to fight for America and serve the people of Minnesota's First Congressional District with the highest level of energy and enthusiasm.\"\n\nRead More", "liberal"], "axios": ["https://www.axios.com/russian-hackers-breach-republican-national-committee-f4d69a30-338e-45f9-8344-020b29952938.html", "Republican National Committee says Russian-linked hackers breached one of its contractors", " Zoom out: Cozy Bear, also known as APT 29, has been tied to the Russian foreign intelligence service and accused of breaching the Democratic National Committee in 2016 as well as carrying out a supply-chain cyberattack involving SolarWinds Corp., which infiltrated nine U.S. government agencies.", "center"], "the-washington-post": ["https://www.washingtonpost.com/politics/republican-trump-2022-midterms-election-falsehoods/2021/07/04/3a43438c-d36f-11eb-ae54-515e2f63d37d_story.html", "In ramp-up to 2022 midterms, Republican candidates center pitches on Trump’s false election claims", " “What’s really frightening right now is the extent of the effort to steal power over future elections,” said Jena Griswold, the Democratic secretary of state in Colorado.", "liberal"]}, {"fox-news": ["positive", 0.625313], "the-hill": ["positive", 0.579416], "breitbart-news": ["negative", 0.606856], "cnn": ["positive", 0.795035], "axios": ["negative", 0.886406], "the-washington-post": ["positive", 0.526124]}, 30, 1625762773.4033349], ["amazon", {"cnn": ["https://www.cnn.com/2021/07/08/cnn-underscored/amazon-fashion-finds-for-summer/index.html", "29 Amazon fashion finds for summer", " Women’s styles\n\nLemedy Yoga Tank Top (starting at $18.99; amazon.com)\n\nAmazon Lemedy Yoga Tank Top\n\n“I’m seeing lots of above the knee spandex shorts paired with cropped tops or sports bra type tops,” says stylist Sheyna Imm. R. Vivimos Half-Sleeve Cotton Flowy Long Dress (starting at $31.99; amazon.com)\n\nAmazon R. Vivimos Half-Sleeve Cotton Flowy Long Dress\n\nOne summer style trend Imm is seeing a lot is “prairie-esque summer dresses” that are easy to wear, comfortable and universally flattering. Meladyan Round Neck Basic Racerback Camisole (starting at $8.99; amazon.com)\n\nAmazon Meladyan Round Neck Basic Racerback Camisole\n\nOne of Noory’s summer style must-haves is a simple white tank, which can be easily paired with virtually any bottom — denim shorts, floral skirts, Bermuda shorts, you name it. Amazon Essentials Drawstring Linen Wide-Leg Pant ($28.40; amazon.com)\n\nAmazon Amazon Essentials Drawstring Linen Wide-Leg Pant\n\nImm recommends “a loose fitting linen pant in a light, neutral color” as an easy way to stay comfortable while looking chic. Imm’s favorite way to style these pants is with a black tank top for a “chic, easy, and flirty look that’s still professional.”\n\nLe Specs Outta Love Sunglasses ($59; amazon.com)\n\nAmazon Le Specs Outta Love Sunglasses\n\n“Le Specs is currently one of my favorite brands in the sunglasses world,” says Noory. Daily Ritual Georgette Fluid Drape Standard-Fit Slip Dress ($29.90; amazon.com)\n\nAmazon Daily Ritual Georgette Fluid Drape Standard-Fit Slip Dress\n\n“Less is always more,” Imm says, “but especially in the summer.” Keep your look stylish yet simple with a slip-style dress, one of Imm’s summer staples. Amiblvowa Knit Two-Piece Outfit (starting at $17.99; amazon.com)\n\nAmazon Amiblvowa Knit Two-Piece Outfit\n\n“I love a set,” says Noory, who’s a big fan of how versatile they can be. Levi’s Tailored High Loose Jeans ($80.99; amazon.com)\n\nAmazon Levi's Tailored High Loose Jeans\n\n“This style of wide leg pant is very much trending,” says Noory, who notes that this jean cut is popular with both women and men. Yathon Sleeveless Cotton Summer Beach Dress (starting at $19.98; amazon.com)\n\nAmazon Yathon Sleeveless Cotton Summer Beach Dress\n\n“A simple sundress is an effortless and quick way to achieve a put-together look,” says Noory. Popyoung Summer Casual T-Shirt Dress (starting at $18.99; amazon.com)\n\nAmazon Popyoung Summer Casual T-Shirt Dress\n\nIf you’re looking for a more casual dress, a T-shirt dress is always a great option to have on hand for warmer days. Men’s styles\n\nGoodthreads Standard-Fit Short-Sleeve Printed Poplin Shirt (starting at $22.60; amazon.com)\n\nAmazon Goodthreads Standard-Fit Short-Sleeve Printed Poplin Shirt\n\nAccording to Noory, a printed button-down short-sleeved shirt is the perfect summer staple. Birkenstock Arizona Soft Footbed Shoe (starting at $89.95; amazon.com)\n\nAmazon Birkenstock Arizona Soft Footbed Shoe\n\nImm calls these classic, unisex Birkenstock sandals “a timeless go-to for myself and many others.” Not only are they easy and completely comfortable, they’re also an iconic option that will always be in style. Cubavera Short Sleeve 100% Linen Guayabera (starting at $50.96; amazon.com)\n\nAmazon Cubavera Short Sleeve 100% Linen Guayabera\n\n“Guayabera-style, short-sleeved button-ups are amazing for hot weather,” Imm says. Wrangler Authentics Short Sleeve Classic Woven Shirt (starting at $20.14; amazon.com)\n\nAmazon Wrangler Authentics Short Sleeve Classic Woven Shirt\n\n“A light chambray denim shirt is perfect for tossing on,” says Imm, whether “for a bit of sun relief or in the cooler evenings.” This highly rated option from Wrangler is totally classic and easy to style. Volcom Vmonty Stretch Chino Short (starting at $21.64; amazon.com)\n\nAmazon Volcom Vmonty Stretch Chino Short\n\nBermuda shorts are trending for both men and women this summer, and Noory notes it specifically as a must-have in any guy’s wardrobe. Hanes ComfortSoft Moisture-Wicking Tagless Tank Multipack (starting at $15.99; amazon.com)\n\nHanes Hanes ComfortSoft Moisture-Wicking Tagless Tank Multipack\n\n“A white tank top is always an important building piece and wardrobe staple,” says Imm, who’s a big fan of these affordable tanks from Hanes, noting that they work wonderfully for both men and women. “It instantly makes me feel like I’m on vacation.”\n\nGitman Vintage Large Dot Short Sleeve Shirt ($97.50; amazon.com)\n\nAmazon Gitman Vintage Large Dot Short Sleeve Shirt\n\nFor summertime, Noory encourages folks to experiment with prints.", "liberal"], "breitbart-news": ["https://www.breitbart.com/entertainment/2021/07/07/quentin-tarantino-i-would-far-rather-people-watch-movies-for-free-on-youtube-than-give-another-dime-to-amazon-or-apple/", "Quentin Tarantino: ‘I Would Far Rather People Watch Movies for Free on YouTube than Give Another Dime to Amazon or Apple’", " “As far I’m concerned, YouTube is one of the best training platforms out there to watch movies and I would far rather people watch movies for free on YouTube than give another dime to either Amazon or Apple,” Quentin Tarantino said on the most recent edition of Pure Cinema Podcast.", "conservative"], "abc-news": ["https://abcnews.go.com/Politics/pentagon-cancels-10b-jedi-cloud-contract-involving-amazon/story?id=78692791", "Pentagon cancels embattled $10B JEDI cloud contract with Microsoft", " \"The 20 months since DoD selected Microsoft as its JEDI partner highlights issues that warrant the attention of policymakers: when one company can delay, for years, critical technology upgrades for those who defend our nation, the protest process needs reform,\" Townes-Whitley wrote.", "liberal"], "axios": ["https://www.axios.com/pentagon-jedi-cloud-contract-f2b05140-bcdf-468a-af38-272a3cb0c1c4.html", "Pentagon cancels $10 billion cloud contract awarded to Microsoft", "The Department of Defense announced Tuesday it was canceling the massive cloud contract awarded to Microsoft in 2019, saying it \"no longer meets its needs.\"\n\nWhy it matters: The JEDI contract was the largest-ever of its kind, with an estimated value of roughly $10 billion over a 10-year stretch. The deal, initially intended to modernize the Pentagon's IT operations, was the subject of a drawn-out legal battle with Amazon and Microsoft.\n\nAmazon filed a lawsuit in 2019 claiming that former President Trump had a bias against CEO Jeff Bezos that influenced the Pentagon's decision to award the contract to Microsoft.\n\nThe Pentagon reaffirmed its decision to award the contract to Microsoft in September 2020.\n\nWhat they're saying: \"One contract has never, and will never, define our relationship with the DoD or any customer. Our decades-long partnership with the DoD will continue — and we stand ready to support our nation’s men and women in uniform as they address our national security needs,\" Microsoft said in a statement.\n\nWhat to watch: In a press release, the Pentagon said it is still seeking an enterprise-scale cloud capability and announced a new multivendor contract, which both Microsoft and Amazon will be asked to bid for.", "center"], "the-washington-post": ["https://www.washingtonpost.com/business/2021/07/06/pentagon-cancels-10-billion-jedi-contract-challenged-by-amazon-ending-long-contested-cloud-procurement-deal/", "Pentagon cancels $10 billion JEDI contract challenged by Amazon, ending long-contested cloud-computing deal", "“The troops expect to have information at their fingertips, and that information comes through the cloud, so they are missing out on what everyday Americans have access to,” said Arnold Punaro, a retired Marine Corps general and Democratic Senate staffer who now works as an industry consultant. “We’ve been waiting around because of this bureaucratic procurement process, which in my view was flawed from the outset.”", "liberal"], "bbc-news": ["https://www.bbc.co.uk/news/technology-57704479", "Jeff Bezos steps down as Amazon boss", "\"I came up with a clever way for us to lose as little money as possible, and sort of fix the problem. But when I talked to Jeff about it he looked at me and said, 'you're thinking about this all wrong'.", "center"], "fox-news": ["https://www.foxnews.com/lifestyle/best-patriotic-films-stream-july-4", "The best patriotic films on Netflix, Prime Video, Hulu to stream July 4", " The war drama is just as captivating whether it’s the first or 10th time you’ve watched it, and you’ve never seen a better pessimistic newspaper reporter than Janssen in his role of George Beckworth. Here are the basics of the origin story of John Clark, a key action hero in Clancy’s Jack Ryan world: An elite Navy SEAL (Jordan) in Aleppo, Syria, discovers an international conspiracy in the midst of trying to obtain justice in the murder of his pregnant wife.", "conservative"]}, {"cnn": ["positive", 0.994744], "breitbart-news": ["negative", 0.648706], "abc-news": ["negative", 0.777241], "axios": ["negative", 0.897899], "the-washington-post": ["positive", 0.660234], "bbc-news": ["negative", 0.901186], "fox-news": ["positive", 0.992877]}, 11, 1625762991.861231], ["iphone", {"techradar": ["https://www.techradar.com/uk/news/these-cheap-iphone-se-deals-from-carphone-warehouse-come-with-free-airpods", "Here's how to get a free pair of AirPods with some cheap iPhone SE deals", "The iPhone SE is Apple's one and only budget handset and because of that, it is rare to see any real promotions appear. However, Carphone Warehouse is currently offering a pretty great package for this cheap Apple device.\n\nAcross three iPhone SE deals, Carphone Warehouse is including a free pair of Apple's 2nd gen AirPods. Despite this free gift, these are very affordable tariffs that all come with large data plans.\n\nThe cheapest of the three comes in at only £24.99 a month and £49 upfront. Despite that, you're securing 20GB of data which, for a lot of people, is actually plenty even with a fair bit of streaming and downloading.\n\nFor an additional £1 a month you can jump that data cap up to 50GB or for £2 a month more, you can go all the way up to unlimited data. With this blend of data, affordability and the free gifts, these are some of the best iPhone SE contracts around right now.\n\nThese iPhone SE deal in full:\n\niPhone SE deals: how good's the phone?\n\nApple's take on a mid-range handset, the Californian tech giant utilises its iPhone 8 blueprint and spins it into a new budget-friendly iPhone. The second iteration of the iPhone SE, 2020's version may look like an iPhone gone by, but it has all the inner workings of a flagship.\n\nWith a 4.7-inch Retina HD LCD display with True Tone, the iPhone SE is a blessing as Apple returns to its roots of a far smaller handset than that of its more recent models, second only in the official line-up to the new iPhone 12 mini. Thick bezelled with a single 12MP sensor, that is where the similarities to that of the iPhone 8 stop.\n\nThe aforementioned camera comes equipped with features like Portrait and Night mode shooting, as well as Depth Control. The handset is also powered by the very same chipset as the iPhone 11, the A13 Bionic, meaning, for a cheap iPhone, this makes it one efficient, powerful beast.\n\nRead our iPhone SE review in full", "centrist"]}, {"techradar": ["negative", 0.657445]}, 4, 1625763031.521276], ["apple watch", {"techradar": ["https://www.techradar.com/news/cheap-apple-watch-deal-the-apple-watch-se-is-on-sale-for-just-dollar249-at-amazon", "Cheap Apple Watch deal: the Apple Watch SE is on sale for just $249 at Amazon", "If you're looking for a cheap Apple Watch deal, then you've come to the right place. We've spotted the Apple Watch SE on sale for just $249 (was $279) at Amazon. That's a $30 discount on the budget smartwatch and the lowest price we've seen this year.\n\nApple Watch deal\n\nApple Watch SE: $279 $249 at Amazon\n\nSave $30 - Amazon has the Apple Watch SE on sale for $249 - only $20 more than the record-low price and the best deal we've found this year. Today's offer applies to the White sport band and - in our eyes - is the better choice than the Apple Watch 6 as it comes with Fitness Plus and sheds the unnecessary ECG and blood oxygen tracking.\n\nView Deal\n\nReleased in September of last year, the Apple Watch SE shares many of the same features as the Apple Watch 6 but at a lower price point. While the SE lacks the always-on display and ECG app, the smartwatch does track activity, sleep, and calories burned and will notify you when a high or low heart rate is detected. The water-resistant smartwatch also helps you stay connected with the ability to receive notifications, take calls, and reply to texts directly from your wrist.\n\n\n\nAs we've mentioned above, this is the best deal you can find right now and a fantastic price for a feature-packed smartwatch. Today's offer applies to the 40mm White sport band, and we don't know how long Amazon will have the smartwatch at this special price.\n\nMore Apple Watch deals\n\nShop more offers with our roundup of the best cheap Apple Watch deals and sales that are happening now.", "centrist"], "engadget": ["https://www.engadget.com/apple-watch-series-6-gps-lte-product-red-edition-deal-amazon-123944170.html", "The Product Red Apple Watch Series 6 with LTE is $100 off at Amazon", " Buy Apple Watch Series 6 (40mm, GPS + Cellular) at Amazon - $399 Buy Apple Watch Series 6 (44mm, GPS + Cellular) at Amazon - $429\n\nAside from the red case and band color, the other caveat to this deal is that you'll have to wait to get your new gadget.", "centrist"]}, {"techradar": ["positive", 0.624124], "engadget": ["positive", 0.651404]}, 4, 1625763192.634721], ["Donald Trump", {"breitbart-news": ["https://www.breitbart.com/politics/2021/07/07/ibram-x-kendi-to-be-racist-is-to-constantly-consistently-deny-like-donald-trump/", "Kendi: ‘To Be Racist Is to Constantly, Consistently Deny … Like Trump'", " “To be antiracist is to admit the times which we’re being racist,” said Critical Race Theory activist Ibram X. Kendi during an American Federation of Teachers (AFT) conference Wednesday. Ingram asked Kendi what he views as “the danger based from the laws we’re seeing across the country, limiting what is being allowed to be taught in schools – and not just bad laws, but school board level policies that use terms like Critical Race Theory.”\n\n“As far as I know, and what the AFT has researched, that’s the theory taught in law school, not a curriculum taught in high school,” Ingram said, observing a view that was asserted as well by AFT President Randi Weingarten:\n\n#CriticalRaceTheory is not taught in K-12 schools. A Harvard CAPS/Harris poll released at the end of June found 61 percent of registered voters said children should not be taught America is “structurally racist.”\n\nThe online survey of 2,006 registered voters asked participants, “Do you believe that kids in elementary school should be taught that America is structurally racist and is dominated by white supremacy or should they not be taught this?”\n\nIn response, 39 percent said children “should be taught that America is structurally racist,” and 61 percent answered children “should not be taught this.”\n\nTo another question regarding the teaching of the First Amendment, 81 percent responded elementary school students should learn about the First Amendment and the importance of free speech, as opposed to 19 percent who said American children should not learn about the First Amendment.", "conservative"], "cnn": ["https://www.cnn.com/2021/07/06/politics/donald-trump-j-d-vance-ohio-senate-race/index.html", "Donald Trump is still the king of the GOP -- J.D. Vance just proved why", " By July 5, he was apologizing for (and deleting) past tweets that were critical of Trump. In 2016, Vance wrote in USA Today that \"Trump's actual policy proposals, such as they are, range from immoral to absurd.\" \"Like a lot of people, I criticized Trump back in 2016,\" Vance explained. The political reality at the present moment, and this has been the case since at least 2017, is that you simply cannot win a contested Republican primary unless you are outspokenly pro-Trump. * Wealthy businessman Mike Gibbons served as the co-chair for Trump's fundraising effort in the Buckeye State and said this recently of the former President : \"I was his co-chair, I raised a lot of money for him, I gave a large amount of money and I support his policies, period.\" The Vance flip-flop, then, is simply the latest proof that there is no room for a candidate to have ANY views EVER that are anything less than utterly supportive of Trump. That doesn't mean that, say, Alaska Sen. Lisa Murkowski (R), who is backed by establishment Republicans and opposed by Trump, can't win in 2022. What it means is that, broadly speaking, any GOP candidate who is not already an incumbent is going to have a VERY hard time winning (or even being competitive) in a Republican primary if they are anything but absolutely loyal to Trump.", "liberal"], "fox-news": ["https://www.foxnews.com/media/cnns-jim-acosta-booed-at-donald-trump-border-event", "CNN's Jim Acosta booed at Donald Trump border event", " CNN'S ACOSTA RECEIVES GOP PUSHBACK OVER CLAIM HE WAS BLOCKED AT LAST SECOND FROM TRUMP BORDER BRIEFING\n\nAcosta later tweeted about the event writing \"At border event with Trump and Abbott I asked Trump if he’s going to apologize for January 6.", "conservative"]}, {"breitbart-news": ["negative", 0.883981], "cnn": ["negative", 0.794008], "fox-news": ["negative", 0.807821]}, 13, 1625763702.7283258], ["Florida Building Collapse", {"No Source Found": ["http://news-flash-proj.herokuapp.com", "No article found", "No recent news on the topic of Florida+Building+Collapse", "centrist"]}, {"No Source Found": ["positive", 0.556006]}, 1, 1625763704.812705], ["France", {"bbc-news": ["https://www.bbc.co.uk/sport/cycling/57765177", "Tour de France 2021: Peter Sagan withdraws because of knee injury", " Last updated on .From the section Cycling\n\nPeter Sagan won the World Road Race Championships in 2015, 2016 and 2017\n\nTriple world champion Peter Sagan withdrew from the Tour de France on Thursday because of a knee injury.", "center"], "abc-news": ["https://abcnews.go.com/International/wireStory/caledonia-1st-leader-favor-split-france-78728162", "New Caledonia gets 1st leader in favor of split from France", " The New Caledonia government has elected the first pro-independence figure as president of the South Pacific archipelago, a French territory that won broad autonomy more than two decades ago\n\nNOUMEA, New Caledonia -- The New Caledonia government elected Thursday the first pro-independence figure as president of the South Pacific archipelago, a French territory that won broad autonomy following violence in 1988 and is scheduled to hold an independence referendum in five months. Louis Mapou, a member of New Caledonia's indigenous Kanak population, received six of 11 government votes, while French loyalist Thierry Santa got four. “Many think that we’ll have difficulty working for everyone, but I can guarantee you that working for New Caledonia will be the watchword of our commitment.”\n\nThe 270,000 inhabitants of the archipelago east of Australia include both the descendants of European colonizers and Kanaks, who once suffered from strict segregation policies.", "liberal"], "breitbart-news": ["https://www.breitbart.com/sports/2021/06/30/authorities-arrest-fan-involved-in-tour-de-france-crash/", "Authorities Arrest Fan Involved in Tour de France Crash", " pic.twitter.com/oxeQAK7WVI — Julio Deluxe (@Julio_Deluxe) June 26, 2021\n\nThe woman’s attempt to cheer on her grandparents – “Allez Opi Omi” translates to “Go Grandpa-Grandma” – triggered a major investigation and her arrest. According to Reuters, “The spectator is accused of involuntarily causing injury and putting the life of others at risk.”\n\n“The riders union Cyclistes Professionnels Associés released a statement on Tuesday demanding that talks be held with the International Cycling Union and event organizers on how to improve the safety for cyclists, explaining that changes are ‘more necessary than ever,'” the Hill reports.", "conservative"]}, {"bbc-news": ["negative", 0.581342], "abc-news": ["positive", 0.929142], "breitbart-news": ["negative", 0.739897]}, 4, 1625763709.711382], ["Coronavirus", {"axios": ["https://www.axios.com/study-coronavirus-delta-variant-antibody-vaccine-d68778f6-72a8-4471-918c-5011f53c1f42.html", "Study: Delta coronavirus variant evades antibodies through mutations", "One dose of the Pfizer or AstraZeneca coronavirus vaccine \"barely\" protects against the Delta variant of the virus, because of mutations the variant has developed, according to a new study published in the journal Nature Thursday.\n\nWhy it matters: The study found that two doses of those vaccines generated a neutralizing response to the variant in 95% of people, highlighting the importance of full vaccination against COVID-19.\n\nThe findings may also offer an explanation for why the Delta variant is rapidly spreading in multiple countries around the world — including the U.S., where it is now the most dominant version of the virus.\n\nHow it works: The team of French researchers tested how efficiently antibodies produced through natural infections or vaccines neutralized variants of the coronavirus, including Delta, which was first identified in India.\n\nThey discovered that the Delta variant has developed mutations to cell entry mechanisms that allow it to evade certain antibodies.\n\nWhile one dose of Pfizer's or AstraZeneca's vaccines was less effective at neutralizing the variant compared to two, it still performed better than the antibodies produced through natural infection, suggesting that people who contracted the virus may still need vaccine to help defend against variants.\n\nFlashback: A study in The Lancet published in June found that the Delta variant is primarily a threat to people who have not been vaccinated.\n\nUnvaccinated people were twice as likely to be hospitalized if they were infected by the Delta variant compared to infections from the Alpha variant, which was first detected in the United Kingdom.\n\nWhat they're saying: \"In parts of the Midwest and upper mountain states, [the Centers for Disease Control and Prevention's] early sequence data suggests the Delta variant accounts for approximately 80% of cases,\" said CDC Director Rochelle Walensky during a briefing on Thursday.\n\n\"To be clear, there will likely continue to be an increase in cases among unvaccinated Americans, and in communities with low vaccination rates, particularly given the spread of the more transmissible Delta variant,\" Jeffrey Zients, the White House coronavirus response coordinator, said.\n\nGo deeper: Delta variant threatens masking guidance", "center"], "cnn": ["https://www.cnn.com/2021/07/07/health/origins-coronavirus-letter-virologists-scn/index.html", "Coronavirus almost certainly came from an animal, not a lab leak, top scientists argue", " (CNN) The coronavirus pandemic almost certainly originated from an animal, probably at a wildlife market in China, and not from a laboratory leak, a group of virus experts said Wednesday. It is signed by some of the leading experts in coronaviruses and the genetics of viruses, including Kristian Andersen of The Scripps Research Institute in La Jolla, California; evolutionary biologist Michael Worobey of the University of Arizona; Andrew Rambaut of the Institute of Evolutionary Biology at the University of Edinburgh; Stephen Goldstein of the Department of Human Genetics at the University of Utah; Angela Rasmussen of the University of Saskatchewan; Joel Wertheim of the University of California, San Diego; and Jeremy Farrar of Britain's Wellcome Trust.", "liberal"], "the-hill": ["https://thehill.com/homenews/administration/561960-inside-bidens-pragmatic-approach-to-coronavirus-rules", "Inside Biden's pragmatic approach to coronavirus rules", " So a vaccine mandate kind of pushes every button on the political right.”\n\nWhite House press secretary Jen Psaki Jen PsakiOn The Money: Job openings stayed at record high of 9.2 million in May | Biden to issue executive order to curtail noncompete clauses | Top Republican signals early resistance to any global tax deal Hillicon Valley: Trump files lawsuit against Facebook, Twitter, and Google | New cyberattacks ramp up tensions with Russia | 36 states, DC sue Google alleging antitrust violations in app store Inside Biden's pragmatic approach to coronavirus rules MORE was asked multiple times Wednesday — first on a CNN appearance and later on Air Force One — about why the administration doesn’t step in more forcefully to encourage private universities, businesses and other institutions to implement vaccine mandates. William Galston, a senior fellow in the Brookings Institution’s governance studies program and former deputy assistant for domestic policy for President Bill Clinton William (Bill) Jefferson ClintonHuawei hires three new lobbying firms Inside Biden's pragmatic approach to coronavirus rules Sustained economic growth needs congressional regulatory reform MORE, said that the White House could potentially make it harder for businesses or local areas to implement vaccine requirements by putting its “finger on the scales.”\n\n“I think that there are good reasons for the administration to continue to emphasize the voluntary approach,” Galston said. “Individual businesses would be the only way, and why should someone who was naturally infected and has the antibodies be required to get one?”\n\nSome health experts and former government officials warn that recommending vaccine mandates or implementing a federal mandate of some kind could backfire by further fueling organized anti-vaccination efforts.", "center"], "breitbart-news": ["https://www.breitbart.com/asia/2021/07/07/coronavirus-wuhan-hubei-heavily-burdened/", "Coronavirus Comes Home: Wuhan, Hubei 'Heavily Burdened'", " “[The] Chinese foreign ministry confirmed that some Chinese nationals who returned from Afghanistan tested positive for COVID-19 [Chinese coronavirus] after Wuhan, capital of Central China’s Hubei Province, reported a total of 56 COVID-19 positive cases,” the Global Times wrote on July 7. China’s Ministry of Foreign Affairs released a statement through its official Sina Weibo microblogging account on July 7, saying some Chinese nationals who recently returned to Hubei province from Afghanistan “have been diagnosed with COVID-19 [Chinese coronavirus] confirmed cases and asymptomatic cases.”\n\n“Many netizens have speculated whether the returnees are a part of an evacuation plan by the Chinese government, but the ministry did not specify on that,” the Global Times noted on Wednesday.", "conservative"], "abc-news": ["https://abcnews.go.com/Health/delta-now-dominant-coronavirus-variant-us-cdc/story?id=78704682", "Delta now dominant coronavirus variant in the US, CDC says", " Data updated by the CDC on Tuesday evening shows the so-called delta variant, also known as B.1.617.2, was estimated to account for 51.7% of all new cases of COVID-19 across the country as of July 3. A little over a month ago, CDC data showed the delta variant was estimated to account for just 3% of all new cases in the U.S.\n\nHealth officials and experts alike have warned that the delta variant is a more infectious version of the disease, and preliminary data indicates it may increase the risk of hospitalization.", "liberal"], "bbc-news": ["https://www.bbc.co.uk/sport/formula1/57731866", "Australian Grand Prix: Formula 1 race and Moto GP round called off", "Melbourne's Albert Park has been the home of the race in Australia since 1996\n\nThe Australian Grand Prix has been called off for the second year in a row because of the coronavirus pandemic.\n\nThe Australian round of the MotoGP world championship, scheduled for 24 October, has also been cancelled.\n\nThe Formula 1 event was due to take place from 19-21 November but has been abandoned because of tight border controls in Australia.\n\nAustralian Grand Prix Corporation chairman Paul Little said he was \"deeply disappointed\" in a statement.\n\n\"We appreciate the challenge Australia faces with current international travel restrictions and the importance of vaccinations,\" he added.\n\nThe Australian Grand Prix was called off in 2020 and put in place to open the current season on 14 March, only for the date to be moved to November because of border controls.\n\nIts November date race was only to be followed by two more in the F1 season - Saudi Arabia and the season-ending Grand Prix in Abu Dhabi.\n\nBut Australian border rules require visitors to quarantine for 14 days, a condition of entry expected to be in place until at least the end of the year.\n\nOrganisers of the event ultimately cited \"restrictions and logistical challenges relating to the ongoing Covid-19 pandemic,\" for the cancellation.\n\nFormula 1 chief Stefano Domenicali said a 23-race season would still be possible despite the cancellation.\n\n\"While it is disappointing we won't be racing in Australia this season, we are confident we can deliver a 23-race season in 2021 and we have a number of options to take forward,\" he said.\n\nMcLaren's Australian driver Daniel Ricciardo said the news was a \"huge disappointment\" for drivers but add they \"understand the reasons\".\n\n\"For me personally, I can't wait to have the chance to race at home again, and it'll be even sweeter when we do because it's been so long,\" Ricciardo added. \"Fingers crossed things can change for 2022 and we get to see the awesome fans at Albert Park again and put on a good show for them.\"\n\nThe Australian round of the MotoGP world championship, scheduled to take place at Phillip Island, has also now been wiped out for a second successive year.\n\nThe event organisers said: \"The ongoing pandemic and resulting travel complications and logistical restrictions mean it has not been possible to confirm the viability of the event at this time, and it will therefore not feature on the 2021 calendar.\"\n\nThe Malaysia MotoGP has been brought forward to take place on from 22-24 October, the original dates of the Australia event.\n\nAnalysis - China race unlikely\n\nChief F1 writer Andrew Benson:\n\nThe autumn period of the season is proving problematic for Formula 1, because of the complications of long-distance travel, and the different stages of the pandemic in various parts of the world.\n\nSingapore last month preceded Australia in cancelling its Grand Prix as a result of its tight border controls, and the schedule for October and November looks thin.\n\nThere are questions over the Japanese and Mexican races at the beginning and end of October, as well as the Brazilian event on the first weekend in November.\n\nJapan will make a final decision on its race at Suzuka on 8-10 October after the Olympics, and its destiny likely hangs on whether there are any Covid-related problems at the Tokyo Games.\n\nMexico and Brazil both have high rates of infection, which was the reason those races were cancelled last year.\n\nHowever, both Mexico City and Sao Paulo want to run their Grands Prix and, with vaccine programmes accelerating around the world, F1 may well decide to push ahead with them.\n\nThis decision is influenced by the fact that Sao Paulo has said it expects to have all its citizens double vaccinated by September, and that the majority of the F1 team personnel are either fully vaccinated or close to it by now.\n\nThat changes the balance of risk in the eyes of the sport's bosses.\n\nChina, whose race was postponed in March and has not yet been officially cancelled, has been mooted as a potential destination in November, but BBC Sport understands a race there is now highly unlikely this year.\n\nTo fill any remaining gaps, F1 has the option of adding a second race in Austin, Texas, in addition to the US Grand Prix on 22-24 October, and a second race in Bahrain, which hosted the season-opener in March. This could take place on the track's outer loop, the layout that hosted last year's Sakhir Grand Prix.\n\nAnd F1 bosses continue to look at other options as Domenicali pushes ahead with his plans to host a record-breaking 23-race season.", "center"], "the-washington-post": ["https://www.washingtonpost.com/health/2021/07/04/johnson-johnson-vaccine-second-dose/", "You had the Johnson & Johnson coronavirus vaccine. Should you try to get a booster dose of Pfizer or Moderna?", "But she was concerned about a rare post-vaccination breakthrough infection — though not because she worried it would make her sick. Instead, if she were exposed and her immune system did not roundly defeat the infection, she feared any surviving pathogens may have the opportunity to evolve into more resistant strains. The emergence of the delta variant, a version of the coronavirus that more easily spreads from person to person, troubled Rasmussen. The Pfizer shot, she said, could reinforce her protection against that variant or help stop her from spreading it.", "liberal"]}, {"axios": ["positive", 0.58917], "cnn": ["negative", 0.720102], "the-hill": ["positive", 0.542798], "breitbart-news": ["negative", 0.687792], "abc-news": ["negative", 0.503939], "bbc-news": ["positive", 0.762839], "the-washington-post": ["negative", 0.540204]}, 15, 1625763778.090175], ["Nintendo", {"fox-news": ["https://www.foxnews.com/lifestyle/rare-nintendo-game-selling-for-over-100000", "Rare 'Zelda' Nintendo game selling for over $100,000 at auction", "This definitely counts as a high score.\n\nWhile \"Super Mario Brothers\" is arguably the most famous game for the original Nintendo Entertainment System, \"The Legend of Zelda\" was also very popular. Many people who grew up in the ‘80s probably remember owning the bright gold cartridge.\n\nIt may come as a surprise that some versions of this game are actually incredibly rare and are worth a lot of money.\n\nThe online auction site Heritage Auctions launched its first video game auction with a sealed copy of \"The Legend of Zelda.\" This particular copy is from one of the game’s earliest production runs and the current bid at the time of writing this article is $110,000.\n\nGOODWILL WORKER FINDS RARE, $10K ATARI VIDEO GAME IN BOX OF DONATIONS\n\nThe original box for the game has apparently never been opened and has been placed inside another sealed plastic container. It has a grade of 9.0 from Wata Games, one of the most prominent game grading companies.\n\nWhile finding used copies of \"The Legend of Zelda\" may not be particularly hard, this version comes from an early production run. The description on the auction says \"No Rev-A, Round SOQ,\" which is likely confusing to people unfamiliar with video game history.\n\nFOLLOW US ON FACEBOOK FOR MORE FOX LIFESTYLE NEWS\n\nAccording to Wata Games, early production Nintendo games were made on cartridges that were connected with five screws but were eventually updated to a new three-screw design. To mark the new cartridge design, Nintendo would put the code \"Rev-A\" on the box, meaning that a box without this code has one of the early cartridge designs. \"SOQ\" stands for \"Seal of Quality,\" which was another label Nintendo would put on the boxes.\n\nEarly games came with a round seal of quality, while later games came with an oval seal.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nWhile this particular game doesn’t come from the first production run of \"The Legend of Zelda,\" only a single copy from that run is known to still exist. This version, which comes from a production run that’s believed to have run in 1987, is considered to be one of the earliest known sealed copies of the game.\n\nIn a press release, Heritage Auctions Video Games Director Valarie McLeckie said, \"'The Legend of Zelda’ marks the beginning of one of the most important sagas in gaming; its historical significance can't be understated. This is the only copy from this production run we've ever offered in sealed condition, and may very well be the only one we ever offer in this elite level of preservation for many years. Its rarity is superior to that of any sealed game we've offered to date, it is a true collector's piece.\"", "conservative"], "cnn": ["https://www.cnn.com/2021/07/06/cnn-underscored/nintendo-switch-oled-model/index.html", "Nintendo Switch OLED Model details: Everything you need to know", "CNN —\n\nAfter years of anticipation, a new version of the Nintendo Switch is finally here. The Nintendo Switch OLED model is exactly what it sounds like — a Switch with an upgraded OLED display — but it also brings a number of other promising upgrades to Nintendo’s hybrid games console.\n\nThe Nintendo Switch OLED is launching on Oct. 8 for $349, with preorders set to open soon. Here’s everything you need to know about the new system, and how it stacks up to the existing Switch and Switch Lite.\n\nNintendo Switch, meet OLED\n\nNintendo\n\nAs its name suggests, the biggest change to the new Nintendo Switch is its 7-inch OLED display, which is both larger and more advanced than the 6.2 and 5.5-inch LCD screens on the Switch and Switch Lite, respectively.\n\nOLED screens are designed to deliver deeper blacks and more vibrant colors than standard LCD displays, as each pixel is individually controlled. In our testing of various TVs, laptops and phones with OLED, we’ve found these types of screens to deliver a really nice boost in color and contrast. As such, we’re eager to see how titles such as Super Mario Odyssey and The Legend of Zelda: Breath of the Wild look on the new model.\n\nPlus: Why the Nintendo Switch is still the best console you can buy\n\nIt’s worth noting that while the new Switch display uses OLED, it still carries the same 720p resolution as previous versions. So while colors may pop a bit more, you won’t necessarily notice a finer level of detail while exploring Hyrule or jumping around the Mushroom Kingdom.\n\nSome welcome design changes with mostly the same specs\n\nNintendo\n\nA fancy new OLED screen isn’t all the new Nintendo Switch has going for it. The OLED model has a wider adjustable kickstand that spans the entire back of the system and allows for multiple viewing angles, which is a nice step up from the small and somewhat flimsy stand on the base Switch model. There’s also a built-in Ethernet port for those who want to use wired internet for the best possible connection when duking it out online in Super Smash Bros. Ultimate or Mario Kart 8 Deluxe.\n\nThe Switch OLED comes with 64GB of onboard storage for digital game downloads, which is double the 32GB you get on the Switch and Switch Lite. Nintendo also says the Switch OLED features “enhanced audio” compared to the previous models, which is a claim we’re looking forward to testing.\n\nKeep in mind that the Switch OLED has the exact same processor, RAM and general specs as other versions of the system, so you won’t be getting a bump in performance or loading times while playing games. If you’ve been holding your breath for a “Nintendo Switch Pro” with 4K output or more overall muscle, you’ll have to keep waiting.\n\nPlus: Forget hunting that Xbox Series X — why Xbox Game Pass is all you need now\n\nThe latest Switch also comes in a slick new white color scheme, which extends to both the Joy-Con controllers as well as the dock. And if you’d rather keep things basic, you can still get a standard black model with red and blue Joy-Cons.\n\nLet’s recap: Release date, preorders and how the OLED compares\n\nNintendo\n\nAt just $50 more than the current Nintendo Switch, the $349 Switch OLED is shaping up to be the version to get for those that haven’t jumped into the Switch family yet. Aside from featuring a promising OLED screen, it also gets you a more refined design with a better kickstand, a handy Ethernet port and more onboard storage.\n\nIf you only plan on gaming on the go or just want the most portable (and cheapest) Switch out there, the $199 Nintendo Switch Lite is probably best for you. And if you mainly play in TV mode, this new model performs identically to the $299 Nintendo Switch when connected to a display. There’s little reason for existing Switch owners to upgrade here, but those that don’t yet have a Switch will be treated to the most feature-packed version of the system yet.\n\nNintendo Switch OLED with White Joy-Con ($349.99; bestbuy.com or gamestop.com\n\nNintendo Switch OLED with Neon Joy-Con ($349.99; bestbuy.com or gamestop.com\n\nThe Switch OLED is set to arrive Oct. 8, and we expect preorders to open soon at the links above. Be sure to stay tuned for our hands-on testing and verdict later this year.", "liberal"], "bbc-news": ["https://www.bbc.co.uk/news/technology-57734949", "Nintendo Switch OLED Model gets an upgraded screen", "Despite the bigger screen, there is only the smallest difference - a few millimetres - in the size of the device itself. It is also very slightly heavier, though the average user is unlikely to notice the new weight.", "center"], "axios": ["https://www.axios.com/nintendo-switch-oled-release-date-b6662772-1677-4241-9290-3fa0bb5e4e1b.html", "Nintendo Switch OLED coming this October", "Nintendo is releasing a new Switch with a bigger, better screen on Oct. 8 for $349.99.\n\nBetween the lines: A newer Switch model has been expected for months, though fans and insiders originally expected a more powerful machine.\n\nIn Tuesday's announcement, Nintendo emphasized the new unit's brighter screen but made no indication that it will run games better.\n\nThe company's specs for the system list the same video resolutions for handheld and TV mode as the original Switch.\n\nThe new console includes a 7-inch OLED screen, 64GB storage, enhanced audio, and a wide adjustable stand.\n\nThe original Switch includes 32GB of storage and retails for $300.\n\nThe last Switch released was the Nintendo Switch Lite, which offered a cheaper, smaller alternative that you couldn't connect to a TV.\n\nA tweet previously embedded here has been deleted or was tweeted from an account that has been suspended or deleted.\n\nFlashback: Although most expected Nintendo to debut the console at E3, no such announcement came as the company focused on upcoming games.", "center"]}, {"fox-news": ["positive", 0.704257], "cnn": ["positive", 0.842069], "bbc-news": ["positive", 0.62571], "axios": ["negative", 0.759111]}, 2, 1625763832.628333], ["Hurricane Elsa", {"No Source Found": ["http://news-flash-proj.herokuapp.com", "No article found", "No recent news on the topic of Hurricane+Elsa", "centrist"]}, {"No Source Found": ["positive", 0.537209]}, 1, 1625763897.991949], ["Britney Spears", {"bbc-news": ["https://www.bbc.co.uk/news/entertainment-arts-57761474", "Britney Spears: Mother says pop star should be allowed to choose her own lawyer", "Last week a US judge denied the pop star's request to remove her father Jamie from his role overseeing her conservatorship. Judge Brenda Penny said she could not make a ruling until the singer files a formal petition to terminate the arrangement.", "center"], "breitbart-news": ["https://www.breitbart.com/entertainment/2021/07/07/britney-spears-court-appointed-attorney-resigns/", "Britney Spears’ Court-Appointed Attorney Resigns", "LOS ANGELES (AP) — Britney Spears’ court-appointed attorney on Tuesday filed documents to resign from her conservatorship, the latest of several such moves that have come in the fallout from the pop singer’s comments in court decrying the legal arrangement that controls her money and affairs.\n\nSamuel Ingham III filed documents in Los Angeles Superior Court requesting that the court appoint Spears a new attorney, and saying his resignation would take effect as soon as that happened.\n\nDuring her June 23 speech in court, in which she condemned the conservatorship and asked Judge Brenda Penny to end it, Spears was critical of Ingham, and said she wished the court would allow her to hire a lawyer of her choice.\n\nLast week, Bessemer Trust, the estate-management company that Spears had requested replace her father as conservator of her finances, filed its own documents withdrawing from the case. The filing said that circumstances had changed after Spears’ comments in court on June 23.\n\nAt a hearing in November, Penny denied Spears’ request to have her father replaced entirely, but said James Spears and Bessemer Trust could work together as co-conservators of her finances.\n\nAnd on Monday, in a letter obtained by entertainment industry publication Deadline, Britney Spears’ longtime manager Larry Rudolph also resigned, saying she had no intention of resuming her career after a 2 1/2 year hiatus that has left him with no work to do for her.\n\nA veteran probate attorney, Ingham was for years a largely silent figure in the conservatorship, at least publicly, but became a more vocal advocate for Britney Spears starting last year. His statements in court that she feared her father and would not resume her career so long as he had power over it were an early crack in the presumed consensus among the figures involved in the conservatorship.\n\nAt the June 23 hearing, Ingham said that Britney Spears had not asked him to file a petition to end the conservatorship, but said he expected she might do so soon. In her remarks critical of Ingham, Spears said during the hearing that she hadn’t known she could file such a petition, and she still has not.", "conservative"], "the-hill": ["https://thehill.com/blogs/in-the-know/in-the-know/561779-britney-spears-longtime-attorney-in-conservatorship-case", "Britney Spears' longtime attorney in conservatorship case resigns", " ADVERTISEMENT\n\nIn Spears’s first testimony to the court since her conservatorship began, she said Ingham never informed her she could petition to end her conservatorship and told her not to speak up about her complaints with the conservatorship that she called “abusive.”\n\n“My lawyer, Sam, has been very scared for me to go forward,” Spears said in court.", "center"], "abc-news": ["https://abcnews.go.com/Entertainment/wireStory/britney-spears-court-appointed-attorney-resigns-78699399", "Britney Spears' court-appointed attorney resigns", "LOS ANGELES -- Britney Spears' court-appointed attorney on Tuesday filed documents to resign from her conservatorship, the latest of several such moves that have come in the fallout from the pop singer's comments in court decrying the legal arrangement that controls her money and affairs.\n\nSamuel Ingham III filed documents in Los Angeles Superior Court requesting that the court appoint Spears a new attorney, and saying his resignation would take effect as soon as that happened.\n\nDuring her June 23 speech in court, in which she condemned the conservatorship and asked Judge Brenda Penny to end it, Spears was critical of Ingham, and said she wished the court would allow her to hire a lawyer of her choice.\n\nLast week, Bessemer Trust, the estate-management company that Spears had requested replace her father as conservator of her finances, filed its own documents withdrawing from the case. The filing said that circumstances had changed after Spears' comments in court on June 23.\n\nAt a hearing in November, Penny denied Spears' request to have her father replaced entirely, but said James Spears and Bessemer Trust could work together as co-conservators of her finances.\n\nAnd on Monday, in a letter obtained by entertainment industry publication Deadline, Britney Spears' longtime manager Larry Rudolph also resigned, saying she had no intention of resuming her career after a 2 1/2 year hiatus that has left him with no work to do for her.\n\nA veteran probate attorney, Ingham was for years a largely silent figure in the conservatorship, at least publicly, but became a more vocal advocate for Britney Spears starting last year. His statements in court that she feared her father and would not resume her career so long as he had power over it were an early crack in the presumed consensus among the figures involved in the conservatorship.\n\nAt the June 23 hearing, Ingham said that Britney Spears had not asked him to file a petition to end the conservatorship, but said he expected she might do so soon. In her remarks critical of Ingham, Spears said during the hearing that she hadn't known she could file such a petition, and she still has not.\n\n———", "liberal"], "fox-news": ["https://www.foxnews.com/entertainment/britney-spears-lawyer-samuel-ingham-resigns-conservatorship", "Britney Spears' lawyer, Samuel Ingham, resigns after 13 years", " Britney Spears’ court-appointed conservatorship attorney of 13 years, Samuel D. Ingham II, has officially filed his application to resign as her counsel, Fox News has confirmed. BRITNEY SPEARS' FATHER JAMIE SPEARS BLAMES JODI MONTGOMERY FOR BLOCKING STAR'S PERSONAL CARE, MEDICAL FREEDOM\n\nDavid Glass, a certified family law attorney and partner with Enenstein Law who also holds a Ph.D. in Clinical Psychology, previously told Fox News that he believes in the event Ingham was no longer Spears’ acting attorney either by removal or his own resignation, the judge presiding over the case would likely appoint a new attorney of the court’s choosing. INSIDE BRITNEY SPEARS, SAM ASGHARI’S HAWAIIAN GETAWAY FOLLOWING BOMBSHELL CONSERVATORSHIP HEARING: REPORT\n\n\"The judge would do something to the effect of choosing who the next attorney is – someone who is really just Sam Ingham – a person who is well respected in the community,\" Glass, who is not involved in the case, said. The news comes as the pop star's longtime manager, Larry Rudolph, also resigned on Monday after Spears expressed her desire to go on an indefinite performing hiatus and amid consistent finger-pointing between Spears’ conservatorship team. CLICK HERE TO SIGN UP FOR OUR ENTERTAINMENT NEWSLETTER\n\nSpears' co-conservator Bessemer Trust has also jumped ship from overseeing and assisting in the performer’s career and finances following a judge's denial of her request to remove her father, Jamie, from being a conservator and dissolving a legal arrangement they established in 2008.", "conservative"], "cnn": ["https://www.cnn.com/2021/07/06/entertainment/britney-spears-manager-larry-rudolph-resigns-letter-conservatorship/index.html", "Britney Spears' longtime manager Larry Rudolph resigns, citing singer's desire to retire", " \"It has been over 2 1/2 years since Britney and I last communicated, at which time she informed me she wanted to take an indefinite work hiatus,\" Rudolph wrote in the letter first obtained by Deadline .", "liberal"]}, {"bbc-news": ["negative", 0.814859], "breitbart-news": ["negative", 0.900473], "the-hill": ["negative", 0.751663], "abc-news": ["negative", 0.913596], "fox-news": ["negative", 0.69678], "cnn": ["negative", 0.849086]}, 2, 1625763909.465023], ["New York City Mayor", {"fox-news": ["https://www.foxnews.com/politics/eric-adams-wins-democratic-primary-race-for-new-york-city-mayor", "Eric Adams wins Democratic primary race for New York City mayor", " Adams -- who if elected would only be the second Black mayor of the Big Apple -- beat out presidential hopeful turned-mayoral candidate Andrew Yang, Maya Wiley, who was endorsed by New York Democrat Rep. Alexandria Ocasio-Cortez, and top contender Kathryn Garcia.", "conservative"]}, {"fox-news": ["positive", 0.644957]}, 6, 1625763930.491926], ["Big tech censorship", {"No Source Found": ["http://news-flash-proj.herokuapp.com", "No article found", "No recent news on the topic of Big+tech+censorship", "centrist"]}, {"No Source Found": ["negative", 0.516612]}, 1, 1625764016.89248], ["Billionaire", {"techcrunch": ["http://techcrunch.com/2021/07/06/max-q-billionaire-blast-off-boys-club/", "Max Q: Billionaire Blast-off Boys Club – TechCrunch", " The billionaire bragging rights battle no one asked for\n\nRichard Branson surprised absolutely no one by announcing last week that he’d be aboard the next Virgin Galactic to fly to low Earth orbit, which is set to take off on July 11, and be the space tourism company’s first to carry a full crew complement.", "centrist"], "the-next-web": ["https://thenextweb.com/news/richard-branson-beat-bezos-for-first-billionaire-in-space-title", "Richard Branson will snatch away Bezos’ ‘first billionaire in space’ title", " Ivan covers Big Tech, India, policy, AI, security, platforms, and apps for TNW. Ivan covers Big Tech, India, policy, AI, security, platforms, and apps for TNW. On July 11, it’s time to turn that dream into a reality aboard the next @VirginGalactic spaceflight https://t.co/x0ksfnuEQ3#Unity22pic.twitter.com/GWskcMSXyA — Richard Branson (@richardbranson) July 1, 2021\n\nThis flight will grant bragging rights to the Virgin Atlantic owner over Bezos, who’s set to reach space with his brother and a mysterious paying customer on July 20. 👏👏👏\n\n\"Mary Wallace Funk, a trailblazing 82-year-old pilot who was prevented from becoming an astronaut in the 1960s because she was a woman, will join Jeff Bezos on his rocket ship company’s first human flight into space…\"https://t.co/g7ihLyxtKxpic.twitter.com/bB28vif8Vz — Subrahmanyam KVJ (@SuB8u) July 2, 2021\n\nIn an interview with CNBC, when asked about this space race with Bezos, Branson jokingly said, “Jeff who?”\n\nIn a statement, Branson said, “I truly believe that space belongs to all of us.” I can’t wait to take the bus to the moon, Richard.", "centrist"]}, {"techcrunch": ["negative", 0.757221], "the-next-web": ["positive", 0.875718]}, 2, 1625764020.6961448], ["Joe Maichin", {"No Source Found": ["http://news-flash-proj.herokuapp.com", "No article found", "No recent news on the topic of Joe+Maichin", "centrist"]}, {"No Source Found": ["negative", 0.516612]}, 1, 1625764113.3612359], ["Germany", {"abc-news": ["https://abcnews.go.com/International/wireStory/exiled-turkish-journalist-attacked-home-germany-78727313", "Exiled Turkish journalist attacked outside home in Germany", " A Turkish journalist who is critical of President Recep Tayyip Erdogan’s government and has been living in exile in Germany says three men attacked and injured him outside his house in suburban Berlin\n\nANKARA, Turkey -- A Turkish journalist who is critical of President Recep Tayyip Erdogan’s government and has been living in exile in Germany said he was attacked and injured outside his home in suburban Berlin by three men who reportedly warned him to stop writing. Braemer said: “Following first investigations, which started yesterday, it cannot be excluded that his job as a journalist is the background for this assault.”\n\nIn a video posted on Twitter, Acarer said that one of his attackers warned him in Turkish: “You will not write.\"", "liberal"], "breitbart-news": ["https://www.breitbart.com/clips/2021/07/06/msnbcs-watts-americas-neo-fascism-right-like-40s-germany-pushing-race-war/", "MSNBC’s Watts: America’s Neo-Fascism Right Like 40s Germany — Pushing ‘Race War’", " MSNBC national security analyst, former FBI special agent Clint Watts said Tuesday on MSNBC’s “Deadline” that far-right groups in America are neo-fascists that resemble the Nazi Party. My biggest concern is that because there has been no real repercussions to the political leaders for the big lie about voter fraud that did not occur, there’s been no repercussions for the extremists that stormed their own house, you will see them again begin to embrace violent rhetoric or incitement which will lead to violence, not just at a federal location but state and local locations.", "conservative"], "bbc-news": ["https://www.bbc.co.uk/news/uk-wales-57743923", "Euro 2020: £36,000 raised for crying Germany fan to go to charity", "The initial target of the appeal was £500, with Mr Hughes saying he hoped her parents would \"spend this on a nice treat for her so that she knows that not everyone from the UK is horrible\".", "center"], "cnn": ["https://www.cnn.com/2021/07/02/politics/biden-ambassador-nominations-germany/index.html", "Biden announces pick for US ambassador to Germany", " His nomination of Gutmann as the top US envoy to Germany -- his first pick for an ambassador to a G7 country -- comes ahead of Chancellor Angela Merkel's expected visit to the White House, which could be her last as head of state.", "liberal"]}, {"abc-news": ["positive", 0.504869], "breitbart-news": ["positive", 0.690392], "bbc-news": ["negative", 0.654556], "cnn": ["positive", 0.968158]}, 4, 1625764141.322825], ["Youtube", {"breitbart-news": ["https://www.breitbart.com/entertainment/2021/07/07/quentin-tarantino-i-would-far-rather-people-watch-movies-for-free-on-youtube-than-give-another-dime-to-amazon-or-apple/", "Quentin Tarantino: ‘I Would Far Rather People Watch Movies for Free on YouTube than Give Another Dime to Amazon or Apple’", " “As far I’m concerned, YouTube is one of the best training platforms out there to watch movies and I would far rather people watch movies for free on YouTube than give another dime to either Amazon or Apple,” Quentin Tarantino said on the most recent edition of Pure Cinema Podcast.", "conservative"], "the-hill": ["https://thehill.com/policy/technology/561788-youtube-algorithm-keeps-recommending-regrettable-videos", "YouTube algorithm keeps recommending 'regrettable' videos", " YouTube users have reported potentially objectionable content in thousands of videos recommended to them using the platform's algorithm, according to the nonprofit Mozilla Foundation.", "center"], "fox-news": ["https://www.foxnews.com/politics/youtube-removes-videos-exposing-chinas-abuse-uyghurs-citing-policy-violation-report", "YouTube removes videos exposing China's abuse of Uyghurs, citing policy violation: report", " According to Reuters, 12 of Bilash's videos were removed this year by YouTube amid an apparent campaign by groups who deny China is committing genocide to mass-report the Atajurt Kazakh Human Rights videos.", "conservative"], "the-washington-post": ["https://www.washingtonpost.com/nation/2021/07/02/taylor-swift-california-cop/", "An officer played a Taylor Swift song to keep his recording off YouTube. Instead it went viral.", "Kelly said that, although the deputy is still at work, the matter has been referred to the office’s internal affairs department and is being investigated. There is no policy barring an officer from doing what’s shown in the video, but “there is a code of conduct on how we should carry ourselves in public,” Kelly said, adding that the sheriff’s office does not “condone” the deputy’s behavior.", "liberal"]}, {"breitbart-news": ["negative", 0.648706], "the-hill": ["negative", 0.637084], "fox-news": ["negative", 0.699357], "the-washington-post": ["negative", 0.614154]}, 1, 1625764485.836276]]