[["Obama", {"breitbart-news": ["https://www.breitbart.com/clips/2021/07/02/obama-dhs-secy-johnson-the-situation-on-the-southern-border-is-troubling-number-of-attempted-crossings-way-too-high/", "Obama DHS Sec’y Johnson: ‘The Situation on the Southern Border Is Troubling’ – Number of Attempted Crossings ‘Way Too High’", " On Friday’s broadcast of CNN’s “New Day,” former DHS Secretary Jeh Johnson said that “the situation on the southern border is troubling” and that the 180,000 people attempting to enter the U.S. encountered by Border Patrol in May “is way too high.”\n\nJohnson said that South Dakota Gov.", "conservative"], "the-hill": ["https://thehill.com/blogs/in-the-know/in-the-know/561209-obama-michelle-is-top-dog-in-our-house", "Obama: Michelle is 'top dog' in our house", " \"I'm generally the brunt of every joke in my household,\" Obama said of life with wife Michelle and the couple's two adult daughters, in a Thursday interview on Dax Shepard and Monica Padman's Spotify podcast, \"Armchair Expert.\"", "center"], "cnn": ["https://www.cnn.com/2021/06/29/politics/obama-misinformation-comments-ala/index.html", "Obama says rise of misinformation 'worries me' and should worry everyone", " (CNN) Former President Barack Obama said Tuesday that the rise in misinformation that led to the January 6 insurrection was apparent during his administration, but the speed and prevalence with which misinformation has increased in recent years \"worries\" him and should worry everyone. \"But to see not only a riot in the Capitol around what historically had been a routine process of certifying an election, but to know that one of our two major political parties, a strong majority of people in this party, actually believed in a falsehood about those election results, the degree to which misinformation is now disseminated at warp speed in coordinated ways that we haven't seen before, and that the guardrails I thought were in place around many of our democratic institutions really depend on the two parties agreeing to those ground rules and that one of them right now doesn't seem as committed to them as in previous generations, that worries me,\" Obama said.", "liberal"]}, {"breitbart-news": ["negative", 0.536428], "the-hill": ["positive", 0.587656], "cnn": ["positive", 0.553308]}, 3, 1625620651.1521091], ["Republican", {"breitbart-news": ["https://www.breitbart.com/politics/2021/07/06/working-people-vote-republican-former-gov-paul-lepage-launches-comeback-bid-in-maine/", "Former Gov. Paul LePage Launches Comeback Bid in Maine", " Chip in: https://t.co/Xb5s7rREEO pic.twitter.com/i0tcinzQ2C — Paul LePage (@PaulLePage2022) July 5, 2021\n\nLePage, who has announced a formal fall kickoff for the campaign, was first elected to serve as governor of Maine in fall 2010 and was sworn in the following January.", "conservative"], "axios": ["https://www.axios.com/russian-hackers-breach-republican-national-committee-f4d69a30-338e-45f9-8344-020b29952938.html", "Republican National Committee says Russian-linked hackers breached one of its contractors", " Zoom out: Cozy Bear, also known as APT 29, has been tied to the Russian foreign intelligence service and accused of breaching the Democratic National Committee in 2016 as well as carrying out a supply-chain cyberattack involving SolarWinds Corp., which infiltrated nine U.S. government agencies.", "center"], "the-hill": ["https://thehill.com/homenews/campaign/561707-pompeo-to-headline-south-carolina-republican-partys-annual-fundraiser", "Pompeo to headline South Carolina Republican Party's annual fundraiser", " Ronald Reagan, former Sen. Rick Santorum (Pa.) and Sen. Ted Cruz Rafael (Ted) Edward CruzMatthew McConaughey says US 'going through puberty' in July 4 message Republicans eyeing White House take hard line on immigration DNC chair hits Cruz over Biden criticism: 'You aren't qualified enough to tie his shoes' MORE (Texas).", "center"], "fox-news": ["https://www.foxnews.com/us/gop-policy-adviser-chen-enters-california-controller-race", "Republican policy adviser Chen enters California controller race", " Lanhee Chen, an academic and former policy adviser for Republican candidates including 2012 GOP presidential nominee Mitt Romney, announced Tuesday he's running for California controller. While the state controller doesn't set policy, Chen said his policy background will help him bring ideas and fresh thinking to the office, including how to better provide oversight of state agencies and programs.", "conservative"], "cnn": ["https://www.cnn.com/2021/07/06/politics/republican-lanhee-chen/index.html", "Republican policy guru wants to end California's 'one-party monopoly'", " Chen, a fellow at the Hoover Institution who guided the policy agenda for the presidential campaigns of Mitt Romney and Marco Rubio and was a health policy advisor on the re-election campaign of former President George W. Bush, is launching his 2022 bid for state controller Tuesday.", "liberal"], "the-washington-post": ["https://www.washingtonpost.com/politics/republican-trump-2022-midterms-election-falsehoods/2021/07/04/3a43438c-d36f-11eb-ae54-515e2f63d37d_story.html", "In ramp-up to 2022 midterms, Republican candidates center pitches on Trump’s false election claims", " “What’s really frightening right now is the extent of the effort to steal power over future elections,” said Jena Griswold, the Democratic secretary of state in Colorado.", "liberal"]}, {"breitbart-news": ["positive", 0.869397], "axios": ["negative", 0.886406], "the-hill": ["positive", 0.746843], "fox-news": ["negative", 0.678923], "cnn": ["negative", 0.508578], "the-washington-post": ["positive", 0.526124]}, 1, 1625620872.3211021]]