[["Google", {"the-next-web": ["https://thenextweb.com/news/developers-implement-google-translate-apps-syndication", "Here’s how developers can implement the Google Translate API in their apps", " The company markets not just to professional coders but to a broader spectrum of users, including those with “limited machine learning expertise” who can quickly “create high-quality, production-ready models.”\n\nFor the latter, you can just upload translated language pairs (a structured list of words/phrases with their translations) and AutoML Translation will train a custom translation model. Typically, you’ll be using Google’s Translate API and its Media Translation API (if you need voice support). Go to the shell prompt on your Mac OS X, Linux, or Windows (Powershell) system and set the environment variable GOOGLE_APPLICATION_CREDENTIALS to the path of your JSON service account key using the following commands. If you’re using Linux or macOS:\n\nexport GOOGLE_APPLICATION_CREDENTIALS=\"[PATH]\"\n\nFor Windows, in PowerShell:\n\n$env:GOOGLE_APPLICATION_CREDENTIALS=\"[PATH]\"\n\nOr, from a command prompt:\n\nset GOOGLE_APPLICATION_CREDENTIALS=[PATH]\n\nThen install and initialize Google’s Cloud SDK. curl -s -X POST -H \"Content-Type: application/json\" \\ -H \"Authorization: Bearer \"$(gcloud auth application-default print-access-token) \\ --data \"{ 'q': 'The quick brown fox jumps over the lazy dog', 'source': 'en', 'target': 'fr', 'format': 'text' }\" \"https://translation.googleapis.com/language/translate/v2\"\n\nThe response should resemble the following:\n\n{ \"data\": { \"translations\": [ { \"translatedText\": \"Le renard brun rapide saute par-dessus le chien paresseux\" } ] } }\n\nCongratulations!", "centrist"], "techradar": ["https://www.techradar.com/news/a-major-copy-and-paste-upgrade-is-coming-to-microsoft-edge-and-google-chrome", "This copy-and-paste upgrade will change how you use Microsoft Edge and Google Chrome", " Here's our list of the best VPN services around\n\nCheck out our list of the best anonymous browsers out there\n\nWe've built a list of the best proxy services on the market\n\nIf adopted by developers, the new APIs could create a scenario whereby users can freely copy files between progressive web apps (PWAs) and software installed on Windows, macOS and mobile platforms.", "centrist"], "techcrunch": ["https://techcrunch.com/2021/07/10/this-week-in-apps-android-ad-prices-jump-tiktok-resumes-google-plays-antitrust-lawsuit/", "This Week in Apps: Android ad prices jump, TikTok resumes, Google Play’s antitrust lawsuit – TechCrunch", " Sign up here: techcrunch.com/newsletters\n\nTop Stories\n\nAndroid ad prices jump in wake of privacy updates on iOS\n\nThe Wall St. Journal reported this week how Apple’s privacy changes are changing the world of mobile advertising — in this case, ad pricing across platforms. The news outlet has been covering the broader impact of Apple’s decision to let users block apps from tracking them, noting how ad sales, including Facebook’s ad business, would be affected. First Look: Pok Pok’s award-winning kids’ app Pok Pok Playroom shows off its sound design\n\nRecently launched Pok Pok Playroom from Pok Pok, a spinout from app maker Snowman (Alto’s Adventure, Alto’s Odyssey, Skate City), just took home an Apple Design Award in the “Delight and Fun” category for its app launched just months ago. 75% of the top 20 most-used apps on iPhone were made by Apple, and 60% of the top Android apps were made by Google, but here’s the funny thing: The study was paid for by Facebook, a company that’s looking for any angle to make it seem like it’s not a monopoly. Slide\n\nA new app from gift card marketplace Raise.com, Slide, offers users 4% cash back on their purchases online and at over 150 popular stores, including Lowe’s, Petco, ULTA, Office Depot, Bed Bath & Beyond, Chipotle, Panera Bread, Chili’s, DoorDash, Domino’s, Aeropostale, Express, H&M, Foot Locker, Loft, REI, GameStop, AMC, Groupon, Southwest Airlines, Uber, AutoZone, and others.", "centrist"], "ars-technica": ["https://arstechnica.com/gadgets/2021/07/rupert-murdochs-answer-to-google-news-is-dead-after-only-18-months/", "Rupert Murdoch’s answer to Google News is dead after only 18 months", " Advertisement\n\nOn Knewz' politics page, the conservative slant was even more apparent, with links to Glenn Beck's The Blaze, Ben Shapiro's The Daily Wire, and Tucker Carlson's The Daily Caller appearing more frequently than links to News Corp's own Wall Street Journal. The Wall Street Journal said that News Corp \"has complained [Google News] doesn't adequately recompense publishers\" in its coverage of Knewz's launch, and repeated the observation again in its coverage today of the service's death. The farewell message at knewz.com today simply says, \"We certainly had provenance, but no profits,\" and offers a selection of links to \"some of the world's most trusted news sites\"—all of which are News Corp-owned outlets—including (bizarrely) realtor.com and mansionglobal.com. In February 2021, News Corp reached an agreement with Google in which the search giant would provide \"significant payments\" to continue sourcing headlines from News Corp owned outlets including Fox News, the New York Post, the Sun, and the Wall Street Journal.", "centrist"], "engadget": ["https://www.engadget.com/google-meet-filters-masks-ios-android-084044336.html", "Google Meet gets fun filters and masks on iOS and Android", "Google has rolled out an update for the Meet video calling app that could make personal calls more enjoyable. The Meet app for Android and iOS now has filters and masks you can play with — simply tap the sparkle button at the bottom right corner of your video call to bring up the Effects options. You'll find Blur effects and backgrounds in there like you would on enterprise and education accounts, but you'll now also find \"Styles\" and \"Filters\" among the options in the carousel.\n\nUnder Styles, you'll see lens flare effects and color overlays you can apply to your video. If you want to see the truly fun options, though, look under Filters for cute animal masks and virtual accessories you can virtually put on your face and head. These new effects are already live, and based on our tests, they're available for use even if you start a meeting through Gmail instead of through the Meet app itself.\n\nAdd cats, astronauts, jellyfish and more to your Meet calls. New filters, masks and effects are now available for Meet on Android and iOS. Try it today → https://t.co/DDSvWFxDG8 pic.twitter.com/hylhsCcUuj — Google (@Google) July 7, 2021\n\nAs 9to5Google notes, Google has been releasing a number of features that would make the service a more veritable Zoom rival. This time, the tech giant is hoping to win over personal users with a feature that could convince them to use Meet for calls with friends and family. The publication previously reported that Google will eventually replace its Duo app with Meet entirely. This move could be a step towards that, as well, seeing as some of Meet's new masks and filters came straight out of Duo's library.", "centrist"]}, {"the-next-web": ["positive", 0.76455], "techradar": ["positive", 0.512769], "techcrunch": ["positive", 0.602029], "ars-technica": ["negative", 0.824275], "engadget": ["positive", 0.86971]}, 1, 1626107781.524571], ["Heat wave", {"abc-news": ["https://abcnews.go.com/US/wireStory/wildfires-rage-us-west-grapples-heat-wave-drought-78797529", "Wildfires rage as US West grapples with heat wave, drought", " Firefighters are working in extreme temperatures across the U.S. West and struggling to contain wildfires, the largest burning in California and Oregon, as another heat wave baked the region, straining power grids\n\nFirefighters were working in extreme temperatures across the U.S. West and struggling to contain wildfires, the largest burning in California and Oregon, as another heat wave baked the region, straining power grids.", "liberal"], "axios": ["https://www.axios.com/heat-wave-continues-west-wildfires-grow-7285bff3-8637-414b-b5bd-03efa73625f0.html", "Heat wave roasts West: Wildfires explode in size", "The latest in a series of severe heat waves to affect the West continues Monday, although conditions are not expected to be quite as extreme as they were during the weekend.\n\nThe big picture: The heat, combined with a deepening drought and lightning strikes, has set more than 1 million acres of land in California, Oregon, Washington, and Canada ablaze, with smoke obscuring the skies thousands of miles away.\n\nBy the numbers: Another in a series of strong high-pressure areas, colloquially known as \"heat domes,\" has set up across the West. While not quite as strong as the event in late June and early July, it has still led to record-shattering temperatures.\n\n107.7°F : Warmest daily low temperature on record for the U.S., set Sunday at Stovepipe Wells, California.\n\n: Warmest daily low temperature on record for the U.S., set Sunday at Stovepipe Wells, California. 117°F : All-time high temperature record at Las Vegas McCarran International Airport, which was tied on Saturday, per a National Weather Service statement.\n\n: All-time high temperature record at Las Vegas McCarran International Airport, which was tied on Saturday, per a National Weather Service statement. 107°F : All-time high temperature record set July 9 at Grand Junction, Colorado, where records date back to 1893.\n\n: All-time high temperature record set July 9 at Grand Junction, Colorado, where records date back to 1893. 150,812 acres : Size of the Bootleg Fire in Oregon as of Sunday, after the fire doubled in size on three consecutive days. The fire was forecast to see \"extreme\" rates of growth as temperatures climbed on Sunday afternoon.\n\n: Size of the Bootleg Fire in Oregon as of Sunday, after the fire doubled in size on three consecutive days. The fire was forecast to see \"extreme\" rates of growth as temperatures climbed on Sunday afternoon. 4,000 acres: Size of the fast-growing River Fire in Mariposa and Madera Counties in California, forcing evacuations late Sunday.\n\nThreat level: On Sunday, Canada's Interagency Forest Fire Center elevated its readiness level to 5 — the top of the scale, noting \"active agencies may take emergency measures to sustain incident operations.\"\n\nDozens of wildfires are burning in diverse ecosystems ranging from temperate rainforests to the boreal region that rings the Arctic.\n\nThe fires in Canada erupted when a massive, slow-moving heat dome stalled over southwestern British Columbia in late June into early July, shattering all-time heat records and killing hundreds.\n\nFirefighting agencies in the U.S. are at a high state of readiness due to large wildfires burning in multiple states. On Saturday, two firefighters working with the Bureau of Land Management to conduct aerial reconnaissance of the Cedar Basin Fire in northwest Arizona died when their plane crashed.\n\nThe Bootleg Fire continues to threaten a key conduit of power between the Pacific Northwest and California. Known as Path 66, the high voltage power lines supply a total of 4,800 megawatts of electricity to the heat-stressed California grid.\n\nThe fire reduced that flow of electricity on Friday and Saturday and could do so again. Gov. Gavin Newsom signed an executive order to relieve some of the grid stress, and a \"Flex Alert\" to conserve power is in effect for Monday.\n\nContext: Drought conditions have created tinderbox dry conditions throughout the West, including high elevation forests, extending the length of the peak wildfire season.\n\nIn California, twice as many acres have burned so far this year than had burned by this point last year — and 2020 was California's worst wildfire year on record.\n\n“The fire behavior we are seeing on the Bootleg Fire is among the most extreme you can find and firefighters are seeing conditions they have never seen before,” Al Lawson, an incident commander for the fire, said in a statement on Sunday.\n\nBetween the lines: Human-caused global warming is a major factor behind the severity, longevity and frequency of the heat waves in the American West and other parts of the world.\n\nIn addition, studies show that the West is seeing more frequent and larger wildfires as climate change alters precipitation patterns and the timing of the wet and dry seasons.\n\nClimate change is also leading to more days with extreme fire weather conditions that feature unusually high temperatures, strong winds, and extremely low humidity values.\n\nWhat's next: Heat advisories and warnings in effect for the Central Valley of California, where farm workers have been laboring in lethal temperatures, continue on Monday — but temperatures are forecast to be a few degrees lower than they were over the weekend.", "center"], "the-washington-post": ["https://www.washingtonpost.com/weather/2021/07/11/heat-wave-west-las-vegas/", "Heat wave keeps baking West after all-time high in Las Vegas on Saturday", "The heat wave afflicting the West is the third in three weeks, after the event in the Pacific Northwest at the end of June and a record-setting blast in the Southwest in the middle of the month; together, they vaulted the nation to its hottest June on record. The heat wave in the Pacific Northwest was made at least 150 times as likely by human-caused climate change, according to a panel of scientists.", "liberal"], "the-hill": ["https://thehill.com/policy/equilibrium-sustainability/562415-death-valley-hits-130-in-historic-heat-wave", "Death Valley hits 130 in historic heat wave", " https://t.co/BwovUm42PE — NWS Las Vegas (@NWSVegas) July 10, 2021\n\nADVERTISEMENT\n\nWhile the highest observed temperature in Death Valley was recorded as 134 degrees on July 10, 1913, scientists have disputed this reading, meaning Friday’s temperature could be one of the highest ever measured on Earth, according to The Washington Post. You can track the latest Death Valley temps @ https://t.co/X7jNlWJpmM pic.twitter.com/FTnL4kfHwR — NWS Las Vegas (@NWSVegas) July 10, 2021\n\nADVERTISEMENT\n\nMillions of Americans in California, Nevada, Utah and Arizona as well as in the Pacific Northwest states of Oregon and Washington, have been issued excessive heat warnings, prompting officials to urge residents to limit their outdoor activities. Gavin Newsom Gavin NewsomDeath Valley hits 130 in historic heat wave Overnight Energy: Newsom asks Californians to cut personal water consumption to fight off drought | John Kerry to visit Moscow officials to discuss 'global climate ambition' | EPA bans sale of COVID-19 disinfectant authorized under Trump Newsom asks Californians to cut personal water consumption to fight off drought MORE (D) called on residents this week to cut their water use by 15 percent as he expanded a drought emergency declaration to 50 of the state’s 58 counties. The National Oceanic and Atmospheric Administration (NOAA) on Friday confirmed that last month was the hottest June ever recorded in the scientists’ 127 years of tracking temperatures in the U.S.\n\nNOAA reported that the average overall temperature of the month was 72.6 degrees, with states like Arizona, California, Nevada and Utah recording their hottest Junes ever.", "center"], "cnn": ["https://www.cnn.com/2021/07/08/weather/climate-change-extreme-heat/index.html", "Historic Northwest heat wave 'virtually impossible' without human-caused climate crisis, study finds", " The unprecedented heat wave in the Pacific Northwest in late June \"would have been virtually impossible without the influence of human-caused climate change,\" according to an analysis by more than two dozen scientists at World Weather Attribution\n\nEvery extreme heat event has the fingerprints of climate change on them, the authors wrote, but the unprecedented heat in late June — which set all-time records in Oregon, Washington and British Columbia — was made particularly possible by warming caused by fossil fuel emissions, the analysis concluded.", "liberal"]}, {"abc-news": ["positive", 0.694875], "axios": ["positive", 0.881896], "the-washington-post": ["positive", 0.720629], "the-hill": ["positive", 0.641957], "cnn": ["positive", 0.74282]}, 1, 1626108217.782402]]