[["Google", {"techcrunch": ["https://techcrunch.com/2021/08/18/planet-labs-and-google-cloud-join-forces-in-data-analysis-agreement/", "Planet Labs and Google Cloud join forces in data analysis agreement – TechCrunch", " This latest agreement will let Planet customers use products like BigQuery to analyze large volumes of satellite imaging data, reflecting “a growing demand for planetary-scale satellite data analysis, powered by the cloud,” Planet said in a news release.", "centrist", "https://techcrunch.com/wp-content/uploads/2021/08/planet-labs.jpeg?w=533"], "engadget": ["https://www.engadget.com/google-pixel-5-a-review-android-midrange-5g-smartphone-160051630.html", "Google Pixel 5a review", " Google Pixel 5a SCORE 86 Engadget 86 Critics - Not yet scored N/A Users - Not yet scored N/A Pros Epic battery life\n\nExcellent photo and video features\n\nIP67 water and dust resistance\n\nSolid construction Cons Middling performance\n\nOnly minor changes from Pixel 4a 5G\n\nKind of boring\n\nWell, it makes the Pixel 5a about as unexciting as a phone can be, for one. Terrence O'Brien / Engadget\n\nThe last difference between the Pixel 5a and the 4a 5G is in the size and construction, but it’s subtle.", "centrist", "https://s.yimg.com/os/creatr-uploaded-images/2021-08/bb81e872-feb9-11eb-bbff-0a2170ea78de"], "the-next-web": ["https://thenextweb.com/news/google-pixel-folding-phone-soon-maybe", "Here's more proof that Google is making a folding Pixel phone", " Developer cstark27, whom we’ve previously talked about for leaking the Pixel 6‘s camera sensor, also noticed that the Android 12 beta refers to a device codenamed ‘Passport.’ This has previously been rumored as the folding Pixel’s codename (and the name makes sense in terms of form factor). — cstark27 (@Cstark_27) August 11, 2021\n\n‘Oriole’ and ‘Raven’ are the codenames for the Pixel 6 and Pixel 6 Pro, so it would seem Google has at least two more devices on the way with the new chip. Considering the company already spoiled the ‘surprise’ of the Pixel 6 and Pixel 6 Pro, the Passport reveal could be a nice bonus for Google’s expected hardware event.", "centrist", "https://img-cdn.tnwcdn.com/image/plugged?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2020%2F08%2FSnag_e6a682.png&signature=3c3f9c1e6713341619f1ebde30e52d0e"], "techradar": ["https://www.techradar.com/news/google-facebook-join-forces-on-new-submarine-internet-cable", "Google, Facebook join forces on new submarine internet cable", "Google and Facebook have announced they will work together on a new undersea internet cable, with the goal of boosting network resilience and capacity in the Asia-Pacific (APAC) region.\n\nOnce complete, the 12,000km Apricot cable will dock in Japan, Taiwan, Guam, Indonesia, the Philippines and Singapore, and will go some way to satisfying the rising demand for data in the area.\n\nThe two companies say the new submarine web cable will be ready for action by 2024, with an initial capacity of circa 190 Tb/second, shy of the current record (held by Google’s Dunant cable at 250 Tb/second).\n\nWe've built a list of the best web hosting services right now\n\nCheck out our list of the best shared web hosting services\n\nHere's our list of the best dedicated hosting providers out there\n\nUndersea web cables\n\nAccording to a Google blog post , Apricot will reinforce the positive effects of its Echo cable system, which will eventually connect the US, Singapore, Guam and Indonesia.\n\n“The Echo and Apricot cables are complementary submarine systems that will offer benefits with multiple paths in and out of Asia, including unique routes through southern Asia, ensuring a significantly higher degree of resilience for Google Cloud and digital services,” the company explained.\n\nGoogle says the new cable systems will be a boon for businesses on both sides of the Pacific, providing lower latency and more bandwidth along routes between Asia and the US. Citing research into the effects of network investments between 2010 and 2019, the company says the new cables are also likely to lead to a boost in APAC jobs and GDP.\n\nApricot is the latest in a series of new submarine cables recently unveiled by Google; others include Firmina , Dunant , Blue and Raman . In total, the company now holds a share in nineteen different cable networks.\n\nGoogle has also previously collaborated with Facebook on submarine cable systems. Most famously, the pair worked together on the Pacific Light Cable Network , although the system later had to be scaled back as a result of tensions between the US and China.", "centrist", "https://cdn.mos.cms.futurecdn.net/chNaE6j2HNbEGzfMvhgeNE-1200-80.jpg"], "ars-technica": ["https://arstechnica.com/tech-policy/2021/08/apple-and-google-seem-spooked-by-bill-requiring-more-app-stores-and-sideloading/", "Apple and Google seem spooked by bill requiring more app stores and sideloading", " The lawmakers summarize the legislation as follows:\n\nThe Open App Markets Act would protect developers' rights to tell consumers about lower prices and offer competitive pricing; protect sideloading of apps; open up competitive avenues for startup apps, third party app stores, and payment services; make it possible for developers to offer new experiences that take advantage of consumer device features; give consumers more control over their devices; prevent app stores from disadvantaging developers; and set safeguards to continue to protect privacy, security, and safety of consumers. Blackburn said that \"Apple and Google want to prevent developers and consumers from using third-party app stores that would threaten their bottom line,\" while Blumenthal said the two companies \"have squashed competitors and kept consumers in the dark—pocketing hefty windfalls while acting as supposedly benevolent gatekeepers of this multi-billion dollar market.\" To obtain this exemption, Apple and Google would have to establish \"by clear and convincing evidence that the action described is applied on a demonstrably consistent basis to apps of the covered company or its business partners and to other apps; not used as a pretext to exclude, or impose unnecessary or discriminatory terms on, third-party apps, in-app payment systems, or app stores; and narrowly tailored and could not be achieved through a less discriminatory and technically possible means.\"", "centrist", "https://cdn.arstechnica.net/wp-content/uploads/2021/08/getty-app-store-760x380.jpg"]}, {"techcrunch": ["positive", 0.521451], "engadget": ["negative", 0.603411], "the-next-web": ["positive", 0.521462], "techradar": ["positive", 0.975613], "ars-technica": ["negative", 0.897811]}, 1, 1629322844.6409888], ["pelosi committee", {"breitbart-news": ["https://www.breitbart.com/clips/2021/07/25/pelosi-my-plan-is-to-appoint-rep-kinzinger-to-the-january-6-select-committee/", "Pelosi: ‘My Plan’ Is to Appoint Rep. Kinzinger to the January 6 Select Committee", " House Speaker Nancy Pelosi (D-CA) said Sunday on ABC’s “This Week” that she planned to appoint Rep. Adam Kinzinger (R-IL) to the House Select Committee investigating the Capitol riots. I’m very proud of the members of the committee, and I’m certain they will accomplish that goal.”\n\nAnchor George Stephanopoulos said, “Will you be appointing more Republicans to the committee like Congressman Adam Kinzinger?”\n\nPelosi said, “That would be my plan.”\n\nStephanopoulos said, “When will that be announced?”\n\nPelosi said, “Perhaps after I speak to Adam Kinzinger.”\n\nShe added, “You could say that’s the direction I would be going.", "conservative", "https://media.breitbart.com/media/2021/07/Pelosi-1-640x335.jpeg"], "axios": ["https://www.axios.com/pelosi-appoint-kinzinger-jan-6-committee-ca1f4955-5c39-4459-b630-83c086562975.html", "Pelosi appoints GOP Rep. Kinzinger to Jan. 6 committee", " What they're saying: \"Speaker Pelosi’s rejection of the Republican nominees to serve on the committee and self-appointment of members who share her pre-conceived narrative will not yield a serious investigation,\" McCarthy said in a statement on Sunday.", "center", "https://images.axios.com/eDtdOb3ThwD1NBJfAILF1Ei5cmM=/22x0:1762x979/1366x768/2021/07/25/1627221066365.png"], "abc-news": ["https://abcnews.go.com/Politics/pelosi-confident-bipartisan-committee-plans-add-republicans/story?id=79036536", "Pelosi confident in bipartisan Jan. 6 committee, plans to add more Republicans", " House Speaker Nancy Pelosi said she is confident in the bipartisan select committee to investigate the Jan. 6 attack on the U.S. Capitol and, despite House Minority Leader Kevin McCarthy pulling his recommendations for the panel, is moving forward with the addition of more Republicans with one accepting her invitation on Sunday afternoon. Despite McCarthy, R-Calif., slamming Pelosi last week for conducting \"a sham process\" after she rejected two of the five Republican members he recommended for the select committee, Pelosi said she plans to appoint more Republicans to the panel. McCarthy had threatened that Republicans \"will not participate\" if Pelosi did not accept all five of his recommendations, but Sunday afternoon Republican Rep. Adam Kinzinger of Illinois announced he'd accepted Pelosi's invitation to participate in the commission. While not mentioning Kinzinger by name, McCarthy said in a statement later Sunday afternoon that Pelosi's selection of members \"who share her pre-conceived narrative will not yield a serious investigation.\" \"Speaker Pelosi's departure from this serious-minded approach has destroyed the select committee's credibility,\" McCarthy said in the statement. Pelosi also scoffed at a letter the conservative House Freedom Caucus, for which Jordan is a member, sent to McCarthy on Friday asking him to try to remove Pelosi from her powerful position, writing, \"Speaker Pelosi's tenure is destroying the House of Representatives and our ability to faithfully represent the people we are here to serve.\" Stephanopoulos asked Pelosi if she is worried that her rejection of two of McCarthy's picks for the select committee would prompt Republicans to take similar action if they take back control of the House, she said, \"no.\"", "liberal", "https://s.abcnews.com/images/Politics/this-week-nancy-pelosi-01-gty-llr-210724_1627151283623_hpMain_16x9_992.jpg"], "fox-news": ["https://radio.foxnews.com/2021/07/23/andrew-mccarthy-reacts-to-speaker-pelosi-rejecting-gop-picks-for-jan-6th-committee/", "Andrew McCarthy Reacts To Speaker Pelosi Rejecting GOP Picks For Jan. 6th Committee", " \n\nListen To The Full Interview Below:\n\n\n\nAndrew McCarthy, Fox News Contributor, and former Assistant U.S. Attorney For Southern District Of NY joined Fox News Radio’s Guy Benson Show to react to Speaker Pelosi rejecting GOP picks for the January 6th committee. McCarthy said,\n\n“Well, I was against the commission guy because I think Congress you know, I’m really kind of tired of our new idea of representative democracy being that we elect people to Congress so that they can go on television and tell everyone how bad everything is while they delegate all their authorities to commissions and courts and bureaucracies.", "conservative", "https://radio.foxnews.com/wp-content/uploads/2020/06/Andrew-McCarthy.jpg"], "the-washington-post": ["https://www.washingtonpost.com/opinions/2021/07/21/pelosi-jan-6-committee-mccarthy-jordan/", "Opinion : Pelosi calls the GOP’s bluff on the Jan. 6 committee", " Will Republicans denounce any findings offered by a select committee with only Pelosi appointees — including, by the way, GOP Rep. Liz Cheney of Wyoming?", "liberal", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FOPEYOHKK4I6XIV2HPRR2NESLA.jpg&w=1440"], "cnn": ["https://www.cnn.com/2021/07/21/politics/nancy-pelosi-1-6-commission-jim-jordan-jim-banks/index.html", "Nancy Pelosi just doomed the already tiny chances of the 1/6 committee actually mattering", " However, in her statement on Wednesday announcing her decision to keep Jordan and Banks off the committee, she cited \"concern about statements made and actions taken by these Members,\" which would seem to suggest that their past views on January 6 -- including past votes, like when they both objected to the Electoral College votes in Pennsylvania and Arizona -- very much played a role. No matter Pelosi's reasoning, her decision to reject Jordan and Banks, the two most high-profile Republicans put forward by McCarthy, dooms even the possibility of the committee being perceived as bipartisan or its eventual findings being seen as independent. Both men would have, at every turn, sought to turn the tables on Democrats -- using the platform provided by the committee to push debunked claims about Antifa's involvement in the Capitol riot, questioning Democratic leadership's readiness for just such an attack and trying to broaden the committee's mandate to cover the Black Lives Matter protests of summer 2020.", "liberal", "https://cdn.cnn.com/cnnnext/dam/assets/210520140051-pelosi-0520-super-tease.jpg"], "the-hill": ["https://thehill.com/homenews/house/564122-pelosi-rejects-jordan-banks-for-jan-6-committee", "Pelosi rejects Jordan, Banks for Jan. 6 committee", " — for the Jan. 6 select committee.Both GOP lawmakers are staunch allies of former, and both had voted in January against certifying's election victory.In a statement, Pelosi said Democrats in her caucus had raised specific objections to Jordan and Banks \"and the impact their appointments may have on the integrity of the investigation. \"“With respect for the integrity of the investigation, with an insistence on the truth and with concern about statements made and actions taken by these Members, I must reject the recommendations of Representatives Banks and Jordan to the Select Committee,\" she said.She did not specify what statements and actions she was referring to.Jordan and Banks were part of a group of five GOP lawmakers nominated by House Minority Leader(R-Calif.) to serve on the 13-member select committee. Instead, he's yanked all of his picks from the panel.The rejections of Jordan and Banks underscore the lingering animosity surrounding the Jan. 6 attack on the Capitol, where a violent mob of Trump supporters attempted to block Congress from formalizing the results of the 2020 presidential contest.Leading up to the attack, a majority of House Republicans had signed on to a lawsuit challenging Biden's victory, essentially endorsing Trump's false claims that the election was \"stolen,\" or tainted by rampant voter fraud. \"But Jordan, the ranking member of the Judiciary Committee, and Banks, the head of the Republican Study Committee, have emerged as some of the most vocal Trump defenders in the wake of the insurrection, infuriating Democrats of all stripes who consider Trump's allies to be complicit in the attack.Both Jordan and Banks have said in recent days that they were hoping to use their positions on the select committee to investigate what Pelosi knew about the security threat ahead of the violence.", "center", "https://thehill.com/sites/default/files/article_images/jordanpelosibanks.jpg"]}, {"breitbart-news": ["positive", 0.548719], "axios": ["negative", 0.687238], "abc-news": ["negative", 0.717488], "fox-news": ["negative", 0.921199], "the-washington-post": ["negative", 0.709639], "cnn": ["negative", 0.806836], "the-hill": ["negative", 0.681528]}, 1, 1627405466.131364]]