[["Ron+Desantis", {"msnbc": ["https://www.msnbc.com/opinion/msnbc-opinion/desantis-black-history-course-ban-part-2024-plan-rcna68266", "DeSantis' Black history course ban is part of his 2024 plan", " J.B. Pritzker, a Democrat, called out DeSantis as an “extremist.”\n\nIn DeSantis’ view, banning a Black history course will make him more popular. In the November ruling addressing public universities and colleges, the judge slammed the law by quoting the first sentence of 1984, George Orwell’s famous novel about life under a totalitarian government: “‘It was a bright cold day in April, and the clocks were striking thirteen,’ and the powers in charge of Florida’s public university system have declared the State has unfettered authority to muzzle its professors in the name of ‘freedom.’” The judge added, “This is positively dystopian.”\n\nThe \"Stop WOKE\" law was part of the national GOP’s war on what they dubbed “critical race theory” (“CRT”) designed to curtail, and even ban, discussions on race in schools. Republicans, however, are now 30 points more likely to say schools should teach less black history.”\n\nFor that analysis, Tesler also cited a February 2018 poll which found that a third of people who’d voted for Donald Trump in 2016 believed “American children should solely be taught about Western civilization and European / US History.”\n\nRepublican voters’ hostility to teaching Black history in school did not happen overnight but has been building over the past two decades. She found that 73% of those who voted for Trump in 2020 believe “today discrimination against whites has become as big a problem as discrimination against blacks and other minorities.”\n\nThis rise of perceived white victimhood in the GOP helps explain why DeSantis is publicly defending the ban on the AP African American studies course, claiming that somehow the course “is somebody pushing an agenda on our kids.” Don’t be surprised if we soon learn of Republicans pushing to ban all Black history from being taught in schools. As Democratic Florida State Sen. Shevrin “Shev” Jones powerfully put it in opposing DeSantis efforts to erase Black history: “We have the potential of raising an entire generation of Black children who will not be able to see themselves represented in their own state or in their education.”\n\nFor DeSantis, the stakes are equally real as he eyes a 2024 run for president.", "liberal", "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-01/230130-ron-desantis-jm-1629-25ac54.jpg"], "breitbart-news": ["https://www.breitbart.com/politics/2023/01/30/donald-trump-ron-desantis-his-donors-are-globalists/", "Donald Trump: Ron DeSantis and His Donors Are Globalists", " “The Club For No Growth is a GLOBALIST group that I have been taking to the cleaners for years,” Trump wrote in a TruthSocial update, explaining that he worked with the group for a period of time but adding it “couldn’t get away from China, Europe, Asia, and part’s unknown.”\n\n“They know I won’t play that game, I am America First all the way. Trump has said it would be a “mistake” for DeSantis to run against him in 2024 and has accused him of “playing games.”\n\n“And now, Ron DeSanctimonious is playing games! The Fake News asks him if he’s going to run if President Trump runs, and he says, ‘I’m only focused on the Governor’s race, I’m not looking into the future.’ Well, in terms of loyalty and class, that’s really not the right answer…” he said in a statement and TruthSocial post in November 2022. I don’t think any governor got attacked, more particularly, by corporate media than me over my four year term,” DeSantis said, deeming it all “just noise.”\n\nThat same week, DeSantis addressed the speculation of a “civil war” between himself and the former president, telling reporters, “We just finished this election … People just need to chill out a little bit on some of this stuff.”\n\nTrump has long called out the dangers of globalism throughout his presidency, declaring himself a “nationalist” in 2018.", "conservative", "https://media.breitbart.com/media/2022/11/GettyImages-1244627968-1-640x335.jpg"], "fox-news": ["https://www.foxnews.com/media/philadelphia-inquirer-calls-ron-desantis-receiving-local-prestigious-award-step-backwards", "Philadelphia Inquirer calls Ron DeSantis receiving local prestigious award 'a step backwards'", " The Philadelphia Inquirer's editorial board published a piece Wednesday that criticized the Union League of Philadelphia, a prestigious private club founded during Abraham Lincoln's presidency, for awarding Florida Gov. STEFANIK SAYS ‘ABUSE AND WEAPONIZATION’ OF BIDEN FEDERAL AGENCIES MUST BE ‘ROOTED OUT’ BY GOP IN MAJORITY\n\n\"Instead, the league chose to honor DeSantis, a bully who has gained traction in Republican circles as a less Trumpier version of Donald Trump himself,\" the editors wrote. FLORIDA BATTLE BREWS OVER AP AFRICAN AMERICAN STUDIES PROGRAM, ATTORNEY CRUMP THREATENS DESANTIS WITH LAWSUIT\n\nThe Union's gold medal award is their highest honor and was first given to President Abraham Lincoln in 1863.", "conservative", "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/Ron-DeSantis-China-Protests.jpg"]}, [["democratic", 0.6376580977713738], ["republican", 0.9683400548413068], ["republican", 0.9399401248150082]], 2, 1675183428.945378], ["Joe+Biden", {"axios": ["https://www.axios.com/2023/03/01/jimmy-carter-joe-biden-friendship", "How Jimmy Carter and Joe Biden built an enduring friendship", " Zoom in: Biden and Carter bonded over always being \"underestimated\" and not being members of the Washington \"establishment,\" former top Carter advisor Gerald Rafshoon told Axios in an interview. The big picture: While at times Republicans have sought to compare President Biden's term to former President Carter's given their fights against inflation, what's clear is that the two men have been enduring friends. What he's saying: In a video tribute to Carter in the 2021 documentary \"Carterland,\" Biden recalled traveling to Wisconsin in 1976 to make his endorsement.", "center", "https://images.axios.com/UqYsh3TowdOJC1opBbVZimZqtEw=/0x92:5729x3314/1366x768/2023/02/27/1677528501934.jpg"], "breitbart-news": ["https://www.breitbart.com/politics/2023/02/27/poll-most-democrats-prefer-someone-else-nominee-2024-instead-joe-biden/", "Poll: Most Democrats Prefer to See 'Someone Else' as Nominee in 2024 Instead of Joe Biden", "Most Democrats prefer someone other than President Joe Biden to be their nominee in 2024, a recent Fox News survey found.\n\nThe survey asked Democrat primary voters if they believe Biden should be the Democrat nominee in 2024 or “someone else.”\n\nA majority, 53 percent, said “someone else,” while over one-third, 37 percent, said “keep Biden” as the nominee.\n\nThe article added further perspective to Biden’s figures among the Democrat base, noting that Trump saw far more support from his Republican base at the same point in his presidency, as 72 percent of Republican voters wanted to see him as the GOP nominee again in 2020.\n\nThe survey was taken February 19-22, 2023, among 1,006 registered voters and has a +/- 4.5 percent margin of error.\n\nIt follows a mix of polling data for the incumbent, as he has struggled to garner majority support for a 2024 presidential reelection bid. A Rasmussen Reports survey released ahead of the State of the Union Address this month, for example, actually found 56 percent not wanting Biden to run for reelection. Just 32 percent said they wanted him to run again, followed by 12 percent who remained unsure. These numbers included Democrat, Republican, and independent voters.\n\nIn that survey, 53 percent of Democrats said they supported the prospect of Biden running for reelection, while one quarter of Democrats and 51 percent of independents said they did not.\n\nSimilarly, a recent Washington Post/ABC News poll asked Democrats and Democrat-leaning independents if they would prefer to nominate Biden or someone else, and 58 percent said they would like to nominate someone else. Less than one-third, 31 percent, said they would want Biden.\n\nA recent NPR/PBS NewsHour/Marist Poll, however, found the tide could be changing in favor of Biden among Democrats, as 50 percent said they now believe Democrats will have the best chance of winning the presidency in 2024 with Biden at the helm.\n\nMeanwhile, surveys continue to show former President Donald Trump leading Biden in a hypothetical 2024 presidential matchup, prompting worries from some Democrats, including former Obama Cabinet member Julián Castro:", "conservative", "https://media.breitbart.com/media/2022/11/biden_leaving2-640x335.jpg"], "fox-news": ["https://www.foxnews.com/opinion/joe-biden-i-fought-deficit-disaster-together-senators-four-decades-later-we-need-fiscal-sanity", "Joe Biden and I fought deficit disaster together as senators. Four decades later, we need fiscal sanity", " In 1984, when faced with $200 billion deficits and a national debt nearing $2 trillion, an emphatic Democrat Sen. Joe Biden warned of \"economic disaster\" unless Congress took \"dramatic actions on deficits right now.\" GOP LOOKS TO REIN IN BIDEN’S INFLATIONARY EXECUTIVE ORDERS IN VOTE NEXT WEEK\n\nIt’s a product of repeated failures at all levels of the federal government and of both political parties to get serious about the budget, deficits and debt. Biden and his administration have thus far refused to entertain any discussion of the spending addiction that got us here. Contrary to Biden’s claims, the need for deficit reduction is not a ransom; it’s a reality. Biden and his administration have thus far refused to entertain any discussion of the spending addiction that got us here. Contrary to Biden’s claims, the need for deficit reduction is not a ransom; it’s a reality.", "conservative", "https://static.foxnews.com/foxnews.com/content/uploads/2019/06/Joe-Biden-1974.jpg"]}, [["democratic", 0.7006139313574787], ["republican", 0.9165185979249951], ["republican", 0.856509325049849]], 1, 1677767362.535529]]