[["Obama", {"breitbart-news": ["https://www.breitbart.com/clips/2021/07/02/obama-dhs-secy-johnson-the-situation-on-the-southern-border-is-troubling-number-of-attempted-crossings-way-too-high/", "Obama DHS Sec’y Johnson: ‘The Situation on the Southern Border Is Troubling’ – Number of Attempted Crossings ‘Way Too High’", " On Friday’s broadcast of CNN’s “New Day,” former DHS Secretary Jeh Johnson said that “the situation on the southern border is troubling” and that the 180,000 people attempting to enter the U.S. encountered by Border Patrol in May “is way too high.”\n\nJohnson said that South Dakota Gov.", "conservative"], "the-hill": ["https://thehill.com/blogs/in-the-know/in-the-know/561209-obama-michelle-is-top-dog-in-our-house", "Obama: Michelle is 'top dog' in our house", " \"I'm generally the brunt of every joke in my household,\" Obama said of life with wife Michelle and the couple's two adult daughters, in a Thursday interview on Dax Shepard and Monica Padman's Spotify podcast, \"Armchair Expert.\"", "center"], "cnn": ["https://www.cnn.com/2021/06/29/politics/obama-misinformation-comments-ala/index.html", "Obama says rise of misinformation 'worries me' and should worry everyone", " (CNN) Former President Barack Obama said Tuesday that the rise in misinformation that led to the January 6 insurrection was apparent during his administration, but the speed and prevalence with which misinformation has increased in recent years \"worries\" him and should worry everyone. \"But to see not only a riot in the Capitol around what historically had been a routine process of certifying an election, but to know that one of our two major political parties, a strong majority of people in this party, actually believed in a falsehood about those election results, the degree to which misinformation is now disseminated at warp speed in coordinated ways that we haven't seen before, and that the guardrails I thought were in place around many of our democratic institutions really depend on the two parties agreeing to those ground rules and that one of them right now doesn't seem as committed to them as in previous generations, that worries me,\" Obama said.", "liberal"]}, {"breitbart-news": ["negative", 0.536428], "the-hill": ["positive", 0.587656], "cnn": ["positive", 0.553308]}, 4, 1625620651.1521091], ["Republican", {"breitbart-news": ["https://www.breitbart.com/politics/2021/07/06/working-people-vote-republican-former-gov-paul-lepage-launches-comeback-bid-in-maine/", "Former Gov. Paul LePage Launches Comeback Bid in Maine", " Chip in: https://t.co/Xb5s7rREEO pic.twitter.com/i0tcinzQ2C — Paul LePage (@PaulLePage2022) July 5, 2021\n\nLePage, who has announced a formal fall kickoff for the campaign, was first elected to serve as governor of Maine in fall 2010 and was sworn in the following January.", "conservative"], "axios": ["https://www.axios.com/russian-hackers-breach-republican-national-committee-f4d69a30-338e-45f9-8344-020b29952938.html", "Republican National Committee says Russian-linked hackers breached one of its contractors", " Zoom out: Cozy Bear, also known as APT 29, has been tied to the Russian foreign intelligence service and accused of breaching the Democratic National Committee in 2016 as well as carrying out a supply-chain cyberattack involving SolarWinds Corp., which infiltrated nine U.S. government agencies.", "center"], "the-hill": ["https://thehill.com/homenews/campaign/561707-pompeo-to-headline-south-carolina-republican-partys-annual-fundraiser", "Pompeo to headline South Carolina Republican Party's annual fundraiser", " Ronald Reagan, former Sen. Rick Santorum (Pa.) and Sen. Ted Cruz Rafael (Ted) Edward CruzMatthew McConaughey says US 'going through puberty' in July 4 message Republicans eyeing White House take hard line on immigration DNC chair hits Cruz over Biden criticism: 'You aren't qualified enough to tie his shoes' MORE (Texas).", "center"], "fox-news": ["https://www.foxnews.com/us/gop-policy-adviser-chen-enters-california-controller-race", "Republican policy adviser Chen enters California controller race", " Lanhee Chen, an academic and former policy adviser for Republican candidates including 2012 GOP presidential nominee Mitt Romney, announced Tuesday he's running for California controller. While the state controller doesn't set policy, Chen said his policy background will help him bring ideas and fresh thinking to the office, including how to better provide oversight of state agencies and programs.", "conservative"], "cnn": ["https://www.cnn.com/2021/07/06/politics/republican-lanhee-chen/index.html", "Republican policy guru wants to end California's 'one-party monopoly'", " Chen, a fellow at the Hoover Institution who guided the policy agenda for the presidential campaigns of Mitt Romney and Marco Rubio and was a health policy advisor on the re-election campaign of former President George W. Bush, is launching his 2022 bid for state controller Tuesday.", "liberal"], "the-washington-post": ["https://www.washingtonpost.com/politics/republican-trump-2022-midterms-election-falsehoods/2021/07/04/3a43438c-d36f-11eb-ae54-515e2f63d37d_story.html", "In ramp-up to 2022 midterms, Republican candidates center pitches on Trump’s false election claims", " “What’s really frightening right now is the extent of the effort to steal power over future elections,” said Jena Griswold, the Democratic secretary of state in Colorado.", "liberal"]}, {"breitbart-news": ["positive", 0.869397], "axios": ["negative", 0.886406], "the-hill": ["positive", 0.746843], "fox-news": ["negative", 0.678923], "cnn": ["negative", 0.508578], "the-washington-post": ["positive", 0.526124]}, 2, 1625620872.3211021], ["Google", {"the-next-web": ["https://thenextweb.com/news/donald-trump-sues-facebook-twitter-google-zuckerberg-dorsey-pichai-social-media-censorship", "Trump claims he's suing Facebook, Twitter, and Google over censorship", "Writer at Neural by TNW — Thomas covers AI in all its iterations. Likes Werner Herzog films and Arsenal FC. Writer at Neural by TNW — Thomas covers AI in all its iterations. Likes Werner Herzog films and Arsenal FC.\n\nDonald Trump says he’s suing Facebook chief Mark Zuckerberg, Twitter boss Jack Dorsey, Google head Sundar Pichai, and their respective companies, alleging that they’ve violated First Amendment rights.\n\nUp-front: Trump said at a press conference on Tuesday that he’s the lead representative in the class-action lawsuits:\n\nWe’re asking the US district court for the southern district of Florida to order an immediate halt to social media companies’ illegal, shameful, censorship of the American people. And that’s exactly what they are doing. We’re demanding an end to the shadow banning, a stop to the silencing, and a stop to the blacklisting, banishing, and canceling that you know so well.\n\nThe former president also said his team would make sure that liability protections provided to tech firms under section 230 are “at a very minimum changed — and at a very maximum, taken away.”\n\nAs for who is taking on the case, Trump said he’s recruited the “best lawyers — the tobacco lawyers.”\n\nBackground: Trump’s announcement was his latest salvo against the social media giants.\n\nHe was banned from Facebook, Twitter, and YouTube in the wake of the US Capitol riots on January 6.\n\nTwitter has permanently banned him, while Facebook will consider reinstating his accounts in 2023 — a year before the next US presidential election. YouTube says it will lift the suspension “when we determine that the risk of violence has decreased.”\n\nTrump made the announcement on the same day that reports claimed he said Adolf Hitler “did a lot of good things.”\n\nQuick take: The loss of Trump‘s social media accounts has reduced the reach of his inflammatory rhetoric. Social media interactions about him fell 91% between January and May, according to data from NewsWhip.\n\nThe announcement of the litigation is Trump’s latest attempt to get his social media megaphones back. But his recent record of losing lawsuits suggests he’ll have a tough job winning the case — if it even gets filed. Trump has a record of threatening legal action but not following through."], "techcrunch": ["http://techcrunch.com/2021/07/07/trump-lawsuit-tech-companies/", "Trump is suing Twitter, Facebook and Google over censorship claims – TechCrunch", "In his first press event since ignominiously leaving office earlier this year, former President Donald Trump announced that he is launching a volley of class action lawsuits against Twitter, Facebook, Google and their CEOs, claiming that the three companies violated his First Amendment rights.\n\n“We’re demanding an end to the shadow-banning, a stop to the silencing and a stop to the blacklisting, banishing and canceling that you know so well,” Trump said at the press conference, held at his Bedminster, New Jersey golf club.\n\nFollowing the January 6 attack on the Capitol, social media platforms swiftly revoked then President Trump’s posting privileges. For years, Trump tested the boundaries of platforms’ policies around misinformation and even violent threats, but his role in the events of that day crossed a line. Trump soon found himself without a megaphone with which to reach his many millions of followers across Twitter, Facebook and YouTube.\n\nTrump’s fate on Twitter is known: the former president faces a lifetime ban there. But on Facebook and YouTube, there’s a possibility that his accounts could be restored. Facebook is still deliberating that decision after its external policy making body, the Facebook Oversight Board, kicked the issue back to the company. Facebook now needs to determine the length of Trump’s indefinite suspension, whether permanent or for a fixed period of time.\n\nTrump will be the lead plaintiff in the suits, which are being filed in the U.S. District Court for the Southern District of Florida. The lawsuits seek “compensatory and punitive damages” and the restoration of Trump’s social media accounts.\n\nThe lawsuits have already had their intended effect of generating attention, but they aren’t likely to go anywhere. Trump accuses Facebook, Twitter and Google of violating his First Amendment rights, but the First Amendment pertains to governments censoring free speech, not businesses.\n\nThe three companies are also well-guarded by Section 230 of the Communications Decency Act, which both protects platforms from legal liability for the content they host and empowers them to make content moderation decisions — including the decision to remove a sitting president from their platforms altogether."], "engadget": ["https://www.engadget.com/trump-sues-twitter-facebook-google-152555050.html", "Trump is suing Twitter, Facebook and YouTube", "As expected, former President Donald announced on Wednesday he plans to file lawsuits against Facebook, Twitter and YouTube as well as the CEOs of each respective company. Trump announced the legal bid at a press conference in Bedminster, New Jersey, promising the case would lead to an \"end of the shadow banning, a stop to the silencing and the canceling that you know so well.\" Trump and his lawyers, many of whom he said come from the tobacco industry, plan to file the lawsuits in the Southern District of Florida and hope to obtain class action status with each one.\n\nTrump alleges the tech giants violated his First Amendment rights and even calls Facebook a \"state actor\" in one of the suits. The lawsuit against Alphabet CEO Sundar Pichai names YouTube as a defendant. \"Our case will prove this censorship is unconstitutional,\" Trump said, adding that he plans to seek punitive damages from each of the companies. The decision to file the suits in Florida may prove an early roadblock for Trump. As noted by Reuters, both the Facebook and Twitter note in their terms of service that any case brought against them must done so at select courts in California.\n\nFollowing the January 6th US Capitol riot, both Twitter and Facebook suspended Trump from their respective platforms. \"We believe the risks of allowing the President to continue to use our service during this period are simply too great,\" Facebook CEO Mark Zuckerberg said at the time. The action comes more than two months after Facebook's Oversight Board said the company's suspension of the former president was \"appropriate.\" Facebook currently plans to uphold the ban until at least January 2023. Following the decision, Trump called Facebook's actions a \"total disgrace and an embarrassment to our country.\"\n\nWe've reached out to Facebook and YouTube for comment, and we'll update this article when we hear back from the companies. Twitter declined to comment."], "techradar": ["https://www.techradar.com/in/news/battlegrounds-mobile-india-now-has-10-million-downloads-on-google-play-store", "Battlegrounds Mobile India now has 10 million downloads on Google Play Store", "Krafton launched the Battlegrounds Mobile India in India in an understated manner after the ban of PUBG Mobile last September. The game is now available for download on Android devices and is set to release on iOS devices yet.\n\nAt launch the game had received 20 million early access registrations and 40 million pre-registrations. This was posted on the Korean website of Krafton and this honestly does not come as a surprise. PUBG Mobile's popularity corresponds with these numbers.\n\nAnd into almost a week into the launch of the game, it has been downloaded 10 million times from the Google Play Store and is currently featured on the 'Top Free Game' list. It is currently holding the second spot on the ‘Top Grossing Games’ list in India after Garena Free Fire.\n\nThe game went for pre-registration on May 18, and the developers gave it more than a month before it will be launched. But the time from the pre-registration of the game to the launch in early access it was reported that it was communicating with Chinese servers, the reason PUBG Mobile was banned.\n\nThis drew criticism from members of the ruling party in India but MEITY had previously clarified that it can't ban a game before launch. This was followed up by an update to the game, that apparently fixed the issue of data sharing with China. And Krafton even issued a statement regarding the data-sharing issue assuring that it is \"implementing the industry’s toughest standards for data security\".\n\nKrafton made some heavy investments in big players in the Indian gaming ecosystem as well in the meantime, which we can only assume is to get a stronger foothold in the market before officially launching BGMI. And now that Krafton has officially launched the game we expect that it has covered all bases so as to prevent a repeat of the past.\n\nAnd following the launch of the game multiple companies have announced teams that will be playing Battlegrounds Mobile India. Although Battlegrounds Mobile India team from Krafton has not announced any esports plans yet."], "ars-technica": ["https://arstechnica.com/gadgets/2021/07/google-play-dumps-apks-for-the-more-google-controlled-android-app-bundle/", "Google Play dumps APKs for the more Google-controlled “Android App Bundle”", "Android's app file format, the APK (Android PacKage), has been with us since the 2008 launch of Android. It's portable, easy to create since it's just a structured .zip file, and widely supported by a variety of tools. Windows 11 is even going to support the format as part of its upcoming Android compatibility. Google, though, doesn't want APKs to be the way to publish an Android app anymore. Google's Android Developer Blog recaps how, starting in August, new apps being uploaded to the Play Store will need to use the new Android App Bundles (AAB) format to distribute apps. This sounds like just the beginning, and Google says that App Bundles \"will replace the APK as the standard publishing format.\"\n\nAndroid App Bundles were introduced to the Android ecosystem in 2018, and I wrote a big section about them in the Android 9 review. The basic sales pitch is that Android devices have plenty of different hardware and language combinations that apps have to support, and shipping all of that code to every individual device is a waste of space. Android supports over 150 languages, four different CPU architectures (ARMv7, ARMv8, x86, and x86_64), and several screen resolution buckets. It's common to pile all of this into a single APK (though sometimes they are split up by CPU architecture), but doing so means each device gets a lot of code and resources that are irrelevant for its specific combination of CPU, locale, and screen size. While this waste of storage space doesn't matter much on high-end phones with good Internet connections, it can be a big deal for cheaper, storage-limited devices and in places where speedy Internet is hard to come by.\n\nGoogle's solution is the Android App Bundle, which turns Android app distribution from a monolithic, universal APK into a collection of \"split APKs\" that can be specifically doled out by the Google Play Store for each individual device. As the name suggests, these \"Split APKs\" aren't entire apps. They're parts of an app, each targeting a specific area of change, that combine to form the final app. With App Bundles, if you have a high-resolution, ARMv8 device with a locale set to English with App Bundles, the Play Store will spit out a set of Split APKs that supports only that device type. If your friend has a low-resolution ARM v7 phone set for English and Hindi, they'll get another set of APK that supports exactly that. Google Play can generate bespoke APKs for every user, giving them only the code they need and nothing more. Google says the result is apps that are 15 percent smaller than a universal APK.\n\nAdvertisement\n\nDevelopers using App Bundles can even modularize features of an app. This allows the features to only be delivered to devices that support them, or they're just not included in the initial download and are only available to users as an on-demand download. The same on-demand feature kicks in if a user changes the locale settings.\n\nWhile the App Bundle system would prefer to send out the fancy, new split APKs, it doesn't have to. Since it can format apps however it wants, a backward-compatible, monolithic APK can still be generated. That makes the approach universally compatible with all Android phones, no matter how neglected your current device is.\n\nApp bundles versus the non-Google Play ecosystem\n\nLike many new Android features, the change from APKs to Android App Bundles results in a more complex, sophisticated feature set for rolling out apps. But it also gives Google a lot more control over the Android ecosystem. Android App Bundles need to be processed by an app store's cloud computer in order to be useful. While App Bundles are an open source format, and Google has an open source \"bundletool\" app that can compile them, some other company would need to build its own infrastructure, pay the server costs to host it in the cloud, and handle the scary app signing requirements (more on that later).\n\nThe open source nature of App Bundles allows development tools to more easily support them. But an alternative app store would have to take on so much work and responsibility that it's doubtful the format will become anything other than the Google Play App Package.\n\nOne major security component of APKs is app signing. This is a digital certificate owned by the app developer that certifies it made the app. The app signature is not really relevant on the first install, but for every point after that, the signatures need to match. That means only the owner of the certificate—the original app developer—is able to update that app. No random third party can make an APK called \"Google-Pay.apk\" that overwrites the real Google Pay app and steal all your bank information.\n\nApp Bundles spit out APKs. That means an entire app build system must be hosted in the cloud. That also means hosting each individual developer app signing key in the cloud, effectively transferring the responsibility of an app from the developer to Google. Google calls this \"Google Play App Signing,\" and the company seriously pinky promises that you still own the app and will still have access to it. But this arrangement feels a bit like transferring the deed to your house to a third party.\n\nGoogle's control over the Play Store means it already owned the street and the driveway, but now it has even more control over your app. If Google Play's roving bands of automated terminator bots target your developer account for some perceived infraction, you'll have even less recourse.\n\nAdvertisement\n\nAndroid App Bundles place an enormous amount of power and responsibility in the hands of the app-store owner. If the app-store infrastructure gets compromised, a third party could get access to the developer keys and start pushing out malicious updates. If you don’t trust the app store owner, too bad. It owns the signing key now and can change your app without your knowledge, if it wanted to. A government could compel the app store owner to change your app, too. In the case of Google, the company is probably doing a better job of storage security than most app developers. But again, it's hard to imagine any non-Google stores adopting this.\n\nGoogle has made some concessions to alleviate concerns about this. Developers can keep a local copy of the signing key they upload to Google, allowing them to generate valid updates that can be installed over Google Play versions. Developers can also download signed \"Distribution APKs\" from the Google Play Developer Console, which are old-school universal APKs that can be uploaded to other app stores. If you're concerned about Google changing your app without your consent, Google says an optional new \"code transparency\" feature will let developers verify that the hashes on downloaded app code match what they uploaded.\n\nAs of August, App Bundles will be mandatory for new apps. Google says that, for now, \"Existing apps are currently exempt\" from the app-bundling requirement. We're going to take the presence of the word \"currently\" as a big indicator of future plans.\n\nFor Google, Android App Bundles are a big deal. At Google I/O 2018, the company said that if every app switched to bundles, Google would save 10 petabytes of bandwidth per day, which is an incredible number, indicating the scale the Play Store operates at. For those of us who don't care about Google's bandwidth bills, though, is a potential 15 percent space savings really worth upending the entire APK ecosystem and transferring even more power to the Play Store and Google's servers?\n\nListing image by Google"]}, {"the-next-web": ["negative", 0.543636]}, 1, 1625678998.28607], ["Hurricane Elsa", {"No Source Found": ["http://news-flash-proj.herokuapp.com", "No article found", "No recent news on the topic of Hurricane+Elsa"]}, {"No Source Found": ["positive", 0.537209]}, 1, 1625679341.634421]]