[["Joe Biden", ["bbc-news", "cnn", "fox-news", "abc-news", "breitbart-news", "axios", "the-hill", "the-washington-post"], {"bbc-news": ["No article found", ""], "cnn": ["President Joe Biden appoints Jessica Stern special envoy for LGBTQ rights", " (CNN) President Joe Biden named Jessica Stern as the US Special Envoy to Advance the Human Rights of LGBTQI+ Persons on Friday, reinstating a position that existed under the Obama administration but was not filled by President Donald Trump/\n\nStern currently serves as executive director of OutRight Action International, an organization aimed at ensuring human rights for LGBTQ people both domestically and abroad and joined Biden at the White House Friday for remarks commemorating Pride Month."], "fox-news": ["GOP House hopefuls come out swinging at vulnerable Dems: 'Retire Nancy Pelosi,' 'Put a check on Joe Biden'", " Virginia’s Tina Ramirez, the founder of the international human rights group Hardwired Global, and New Jersey’s Tom Toomey, a longtime businessman and self-styled political outsider, are looking to unseat Democratic Reps. Abigail Spanberger and Mikie Sherrill, respectively. Left-wing regulations, cancel culture and woke ideologies have run amok, according to the candidates, and, as Ramirez put it, the GOP needs to retake the house in order to \"retire [House Speaker] Nancy Pelosi and put a check on President Biden.\" VIRGINIA PARENTS, TEACHERS GROUP ACCUSED OF ‘RACKETEERING,’ INTIMIDATING CONSERVATIVE PARENTS\n\nRamirez’s nonprofit fights for the release of political and religious prisoners abroad, lobbies foreign dignitaries for human rights and consults on potential new legislation. Toomey, who got his business start working for a small New Jersey caterer and later managed a billion-dollar program at Samsung before moving on to industry startups,\n\n\"I have, from top to bottom, from as small as it is to as big as it is, an understanding of how businesses work,\" he said."], "abc-news": ["No article found", ""], "breitbart-news": ["Donald Trump Border Visit: Joe Biden Either ‘Incompetent’ or Actually Wants Open Borders", " “There’s only two things, you’re either incompetent or for some reason you have a screw loose and you want to have open borders,” he said. “Now it’s opened up and don’t kid yourself, they’re coming in from the Middle East and they’re coming in and they’re bad,” Trump said, referring to reports in April of men from Yemen who were stopped at the border. After taking office in January, President Joe Biden immediately rolled back many of Trump’s border policies, choosing to end the successful “Remain in Mexico” policy for migrants claiming asylum in the United States."], "axios": ["No article found", ""], "the-hill": ["No article found", ""], "the-washington-post": ["The remarkable party loyalty that propelled Joe Biden to the White House", " It was very clear by about the middle of 2019 that the candidate who had the best shot at winning the Democratic presidential nomination was named “whoever is most likely to defeat Donald Trump.” Over and over, both polling and conversations made clear that this was a critical priority for Democratic voters and, over and over, polling and conversations revealed that Joe Biden was believed to be that candidate."]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"bbc-news": null, "cnn": "https://www.cnn.com/2021/06/25/politics/lgbtq-envoy-jessica-stern/index.html", "fox-news": "https://www.foxnews.com/politics/gop-house-hopefuls-vulnerable-dems-pelosi-biden", "abc-news": null, "breitbart-news": "https://www.breitbart.com/politics/2021/06/30/donald-trump-border-visit-joe-biden-either-incompetent-or-actually-wants-open-borders/", "axios": null, "the-hill": null, "the-washington-post": "https://www.washingtonpost.com/politics/2021/06/24/remarkable-party-loyalty-that-propelled-joe-biden-white-house/"}, 6, 1625170165.054164, [["negative", 0.650239], ["positive", 0.897069], ["positive", 0.569835], ["negative", 0.662398], ["negative", 0.829561], ["negative", 0.662398], ["negative", 0.665727], ["positive", 0.666793]]], ["North Korea", ["bbc-news", "cnn", "fox-news", "abc-news", "breitbart-news", "axios", "the-hill", "the-washington-post"], {"bbc-news": ["Kim Jong-un: North Korea sees 'grave incident’ after Covid lapses", " North Korea has put in place strict restrictions and state media have continually exhorted citizens to be vigilant against the virus, even warning them late last year to be wary of \"yellow dust\" from China."], "cnn": ["No article found", ""], "fox-news": ["No article found", ""], "abc-news": ["EXPLAINER: How bad is the pandemic in North Korea?", " A look at some of the clues:\n\n———\n\nEXPERTS DIVIDED OVER EPIDEMIC\n\nDu Hyeogn Cha, an analyst at Seoul’s Asan Institute for Policy Studies, said the North could be dealing with a huge COVID-19 outbreak that has spread beyond border towns and rural areas and is now reaching urban centers, possibly including capital Pyongyang. Other experts, including Park Won Gon, a professor of North Korea studies at Seoul’s Ewha Womans University, said the large Politburo meeting attended by party officials from across the country would have been planned in advance and may have not taken place if the virus was circulating aggressively. The North’s state media said Kim berated senior party and government officials for neglecting “important decisions of the party on taking organizational, institutional, material, scientific and technological measures as required by the prolonged state emergency epidemic prevention campaign.”\n\nThe report also said that the party during the meeting recalled an unidentified member of the Politburo’s powerful Presidium, which consists of Kim and four other top officials."], "breitbart-news": ["North Korea TV: Nation ‘Heartbroken’ by Kim Jong-un’s Weight Loss", " Adding to theories that Kim is attempting to lose weight as a propaganda effort for his food security policies, an unnamed source suggested to the conservative South Korean newspaper Chosun Ilbo on Monday that Kim “is trying to show North Koreans that he is skipping meals and working hard in order to overcome the North’s food shortage.”\n\nOther government propaganda outlets have yet to address the interview about Kim’s weight, though they did appear to focus on the theme of sacrifice on the part of communist leaders – in contrast with North Korea’s typical reality, in which communist leaders enjoy lavish lifestyles while starving and oppressing the majority of the country. “The respected General Secretary Kim Jong Un stressed at the historic Third Plenary Meeting of the Eighth Central Committee of the Workers’ Party of Korea that it is high time to give full play to the indomitable revolutionary spirit,” KCNA asserted, “and the fighting traits of self-reliance and fortitude, the vital power peculiar to the Korean revolution.”\n\nAt the referenced meeting, Kim admitted the country was running out of food and on the brink of famine. “Saying that in particular, the people’s food situation is now getting tense as the agricultural sector failed to fulfill its grain production plan due to the damage by [the] typhoon last year, he stressed that the plenary meeting should take a positive measure for settling the problem.”\n\nOther top officials at the party meeting insisted on redirecting the nation’s attention towards ensuring a “good crop” the next year, blaming “natural disaster” for the food shortages – a change from Pyongyang’s typical claims that American-led global sanctions are responsible for its economic woes."], "axios": ["No article found", ""], "the-hill": ["North Korea reports 'grave incident' related to COVID-19", " North Korean leader Kim Jong Un Kim Jong UnNorth Korea reports 'grave incident' related to COVID-19 North Korean state TV acknowledges Kim Jong Un's 'emaciated looks' North Korea slams the door on dialogue — for now MORE reportedly lashed out at officials during a politburo meeting of the Workers' Party on Tuesday, South Korean-based news agency Yonhap reported, citing North Korea’s Korean Central News Agency (KCNA)."], "the-washington-post": ["No article found", ""]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"bbc-news": "https://www.bbc.co.uk/news/world-asia-57661653", "cnn": null, "fox-news": null, "abc-news": "https://abcnews.go.com/Health/wireStory/explainer-bad-pandemic-north-korea-78575178", "breitbart-news": "https://www.breitbart.com/asia/2021/06/28/north-korea-tv-nation-heartbroken-kim-jong-uns-weight-loss/", "axios": null, "the-hill": "https://thehill.com/policy/international/asia-pacific/560849-north-korea-reports-grave-incident-related-to-covid-19", "the-washington-post": null}, 3, 1625170180.84125, [["negative", 0.691604], ["negative", 0.685439], ["negative", 0.774294], ["negative", 0.576144], ["positive", 0.56285], ["negative", 0.606766], ["negative", 0.737549], ["negative", 0.599881]]], ["Google", ["ars-technica", "engadget", "hacker-news", "recode", "techcrunch", "techradar", "the-next-web", "wired"], {"ars-technica": ["Google Play dumps APKs for the more Google-controlled “Android App Bundle”", " Google's Android Developer Blog recaps how, starting in August, new apps being uploaded to the Play Store will need to use the new Android App Bundles (AAB) format to distribute apps. Google's solution is the Android App Bundle, which turns Android app distribution from a monolithic, universal APK into a collection of \"split APKs\" that can be specifically doled out by the Google Play Store for each individual device. App bundles versus the non-Google Play ecosystem\n\nLike many new Android features, the change from APKs to Android App Bundles results in a more complex, sophisticated feature set for rolling out apps."], "engadget": ["Google promotes YouTube TV's new 4K add-on with a free Chromecast", " \"To ensure our loyal YouTube TV members have a great viewing experience (including the ability to watch 4K content on our optional, new add-on service), we would like to offer you a free Chromecast with Google TV device,\" the company says in an email it sent out to some customers."], "hacker-news": ["No article found", ""], "recode": ["No article found", ""], "techcrunch": ["Google update will allow digital COVID-19 vaccination cards and test results to be stored on Android devices – TechCrunch", " The company on Wednesday announced it’s updating its Passes API, which will give developers at healthcare organizations, government agencies, and other organizations authorized by public health authorities the ability to create digital versions of tests and vaccination cards that can then be saved directly to the user’s device. The Passes API update doesn’t mean Android users can immediately create digital versions of their COVID vaccination cards — something people have been taking pictures of as a means of backup or, unfortunately in some cases, laminating it."], "techradar": ["Google furthers telco push with O-RAN Alliance and Ericsson 5G partnerships", " “We believe that industry-wide open reference architectures and interfaces for RAN are key to driving innovation across communication service provider (CSP) mobile networks—with the O-RAN ALLIANCE driving significant advances in the RAN layer and already gaining traction with a number of large CSPs who have become early adopters of the standard,” said Amol Phadke, Managing Director, Telecom Industry Solutions and Ankur Jain, Senior Director and Distinguished Engineer, Telecom at Google Cloud. “We are proud to partner with Ericsson to help build a foundation for communications service providers and enterprises alike to take advantage of cloud technology and cloud-native services, from telecom network core to the edge and enterprise premises.”\n\nGoogle’s other ventures in the area have included a partnership with Nokia, which is also moving its own infrastructure to the cloud, and a project with Vodafone that will see the creation of an “industry-first” global data platform."], "the-next-web": ["Pastbook launches a Google Photos-esque AI-powered photobook app", " PastBook provides dead-simple photobook solutions, which is cool, but what’s most interesting (to us here at Neural) is the way the company uses AI."], "wired": ["No article found", ""]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"ars-technica": "https://arstechnica.com/gadgets/2021/07/google-play-dumps-apks-for-the-more-google-controlled-android-app-bundle/", "engadget": "https://www.engadget.com/google-chromecast-youtube-tv-promotion-232336326.html", "hacker-news": null, "recode": null, "techcrunch": "http://techcrunch.com/2021/07/01/google-update-will-allow-digital-covid-19-vaccination-cards-and-test-results-to-be-stored-on-android-devices/", "techradar": "https://www.techradar.com/news/google-furthers-telco-push-with-o-ran-alliance-and-ericsson-5g-partnerships", "the-next-web": "https://thenextweb.com/news/pastbook-launches-google-photos-esque-ai-app-ios", "wired": null}, 1, 1625243590.5072498, [["negative", 0.720573], ["negative", 0.782875], ["negative", 0.696366], ["negative", 0.710732], ["negative", 0.700755], ["positive", 0.960537], ["positive", 0.805548], ["negative", 0.71205]]]]