[["Google", {"techradar": ["https://www.techradar.com/news/google-finds-zero-day-security-flaws-in-all-your-favorite-browsers", "Google finds zero-day security flaws in all your favorite browsers", " >> Click here to start the survey in a new window <<\n\nProtect your devices with these best antivirus software\n\nHere are the best ransomware protection tools\n\nThese are the best malware removal software on the market\n\nIn addition to breaking down the vulnerabilities, the researchers also note that there has been a definite increase in the number of attacks based on zero-day exploits.", "centrist", "https://cdn.mos.cms.futurecdn.net/S2k99RTyJJhGbDwQRHUsyg-1200-80.jpg"], "ars-technica": ["https://arstechnica.com/gaming/2021/07/google-rolls-out-more-generous-revenue-sharing-to-attract-new-stadia-games/", "Google tries to attract Stadia publishers with better revenue sharing", " Assuming the industry-standard 30 percent cut, that means publishers stand to make up to $450,000 more per game before Google's cut reverts back to the standard at the $3 million threshold (a Google representative told Ars that \"Stadia currently provides competitive revenue share terms with partners that matches what they typically see from other industry platforms\").", "centrist", "https://cdn.arstechnica.net/wp-content/uploads/2021/02/Stadia-760x380.jpg"], "engadget": ["https://www.engadget.com/google-pixel-4-sale-amazon-bh-131509963.html", "Google Pixel 4 drops to an all-time low of $400 at Amazon", " That's an all-time low for the former flagship, and makes it more affordable than a new Pixel 4a 5G — worth considering if processing power matters more than the latest wireless technology. Buy Pixel 4 (64GB) at Amazon - $400\n\nBuy Pixel 4 (64GB) at B&H - $400\n\nYou can also buy the 128GB version at a discount on both sites, although B&H currently offers a better deal at $430 versus Amazon's $470.", "centrist", "https://s.yimg.com/os/creatr-uploaded-images/2020-04/a2806360-7cfb-11ea-9ef5-1ddc5e7e29f2"], "the-next-web": ["https://thenextweb.com/news/google-tips-will-finding-stuff-easier-syndication", "These Google search tips will make finding stuff online way easier", " If you search ‘When to use Node.js’ (sans quotation marks), Google returns a set of results that contains all four or less of these words in any order. But if you use quotation marks and search for “When to use Node.js” instead, Google gives priority to the results that contain this phrase exactly. keyword1 and keyword2\n\nIf you want to search for pages that contain both of these terms, you can use the AND operator in between the two words to specify that both of them should be in search results. Exclude certain terms using minus sign\n\nkeyword1 -ignore\n\nIf you want to exclude web pages that contain a certain phrase from your search results, use the minus sign to indicate this in the search term. When you use an asterisk (*) in the search terms, this acts as a placeholder that Google automatically fills before delivering the results. To search for websites similar to another website, simply use a search syntax like this:\n\nrelated:[website_url]\n\nFor example, let’s search for websites that are similar to GitHub with this syntax. Find content in a specific file type\n\nkeyword1 filetype:[file type]\n\nLet’s say you want to find PDFs or PowerPoint slides discussing a specific topic, Google will allow you to search for content only in this file type. keyword1 after:[date]\n\nSimilarly, if you want to search for pages published after a certain date, use the ‘after’ operator with a specific year or date. Instead of using the search term, ‘my image doesn’t center on web page’, think of the kind of language websites use and search for centering images with CSS.", "centrist", "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2021%2F07%2FGoogle-search-hed.jpg&signature=2e4b45d5f40261b2abe9d0dbb2ac046b"], "techcrunch": ["http://techcrunch.com/2021/07/13/google-fined-592m-in-france-for-breaching-antitrust-order-to-negotiate-news-copyright-fees/", "Google fined $592M in France for breaching antitrust order to negotiate copyright fees for news snippets – TechCrunch", " France’s competition authority said today that it’s applying the sanction of €500 million ($592M) against the tech giant for failing to comply with a number of injunctions related to its earlier, April 2020 decision — when the watchdog ordered Google to negotiate in good faith with publishers to remunerate them for displaying their protected content. In a press release detailing its investigation, the Autorité said Google sought to unilaterally impose its global news licensing product, aka ‘Showcase’, under a partnership the tech giant calls Publisher Curated News — in negotiations with publishers — pushing for the legal neighbouring right to be incorporated as “an ancillary component with no separate financial valuation”. It also found the tech giant sought to exclude press agencies from renumeration related to their content when used by third party publishers — highlighting that as another breach of its April 2020 decision, by further noting: “The French legislator has been very explicit on the need to include press agencies.”\n\nIn another finding, it said Google had only provided publishers with “partial” and “insufficient” information for a “transparency assessment of renumeration due”; and further accused the tech giant of delaying until just a few days before the injunction deadline to provide it — so of being “late” too. The authority’s investigation highlights compliance problems with another injunction — related to an obligation of neutrality in how protected content is presented on Google’s platforms — with the watchdog writing on that: “The strategy put in place by Google has thus strongly encouraged publishers to accept the contractual conditions of the Showcase service and to renounce negotiations relating specifically to the current uses of protected content, which was the subject of the Injunctions, under penalty of seeing their exposure and their remuneration degraded compared to their competitors who would have accepted the proposed terms. Google has, the authority asserts, sought to use a global strategy to close down publishers’ ability to negotiate for remuneration for their content reuse at a national level — using its Showcase product as a cloak for “avoiding or limiting as much as possible” payments to publishers; and, simultaneously, seeking to use negotiations on neighboring rights as an opportunity to obtain access to new content by press publishers that could allow it to collect additional income, such as from subscriptions to press titles. “Our objective remains the same: We want to turn the page with a definitive agreement,” it added, saying it would take the French Competition Authority’s “feedback into consideration and adapt our offers” and that: “We are already engaging with press publishers and agencies beyond IPG, by covering publications that are recognised by the CPPAP as ‘online press services’, and we reiterate our offer to have an independent third party in a position to evaluate our offers and allow us to base our discussions on facts.”\n\nOther major fines for Google in France in recent years include the aforementioned $268M for adtech abuses last month; $120 for dropping tracking cookies without consent back in December; $166M in December 2019 for opaque and inconsistent ad rules; and $57M for privacy violations in January 2019.", "centrist", "https://techcrunch.com/wp-content/uploads/2016/05/524861124.jpg?w=600"]}, {"techradar": ["negative", 0.701959], "ars-technica": ["negative", 0.839546], "engadget": ["positive", 0.778491], "the-next-web": ["positive", 0.661439], "techcrunch": ["negative", 0.863506]}, 1, 1626384888.1927192]]