[["Google", ["ars-technica", "engadget", "hacker-news", "recode", "techcrunch", "techradar", "the-next-web", "wired"], {"ars-technica": ["Antitrust settlement forces Google to revamp ad platform", " “The AdX platform is only partially interoperable with DFP’s competing ad servers and does not allow the latter to organize a competition between AdX and its competitors—even though AdX itself has a privileged access to a significant portion of advertisers’ demand and while all of these competitors have adopted standards allowing for fairer competition,” the authority said."], "engadget": ["Google quietly ends support for its augmented reality Measure app", ""], "hacker-news": ["Ask HN: Has Google search got noticably worse recently?", " The specific example that pushed me over the edge to write this was searching for a news article I know exists on Battlefield 1 sales numbers, instead google's showing me the standard stuff (wiki articles that don't have what I'm looking for) and telling me about battlefield V or the new battlefield that's about to release."], "recode": ["No article found", ""], "techcrunch": ["Google announces EPYC-based Tau virtual machines for Cloud – TechCrunch", " “Customers across every industry are dealing with more demanding and data-intensive workloads and looking for strategic ways to speed up performance and reduce costs,” Google Cloud CEO Thomas Kurian said in a press release. “Our work with key strategic partners like AMD has allowed us to broaden our offerings and deliver customers the best price performance for compute-heavy, business-critical applications– all on the cleanest cloud in the industry.”\n\nGoogle has already signed up some high-profile customers for an early trial, including Twitter, Snap and DoIT."], "techradar": ["How to use Google Lens on your iPhone or iPad", " Whether you want to translate text, identify plants or find answers to equations, Google Lens is an incredibly useful image recognition tool – and it’s really easy to install and use on an iOS device. Install the app and you’ll be able to use Google Lens with your camera in real time on iPhone (though not on iPad, sadly), as well as searching with images already saved to your camera roll. (Image credit: Future)\n\nThe key difference, though, is that Google Photos does not allow you to search in real-time with your iPhone or iPad camera. (Image credit: Future)\n\nOnce you’ve selected the relevant mode, simply aim your camera at the object which you’d like Google Lens to search with. As above, you don’t need to take another photo: just tap on one of the white circles within the image you already shot, to find out what Google Lens has identified. Don’t worry: you can easily use Google Lens to search with photos saved to your iPhone or iPad’s camera roll, any time. Likewise, even if Google Lens does recognize the object, the suggested search results sometimes aren’t the most useful – or accurate."], "the-next-web": ["Google and Reliance’s ‘JioPhone Next’ will hit India in September", " Ivan covers Big Tech, India, policy, AI, security, platforms, and apps for TNW. Ivan covers Big Tech, India, policy, AI, security, platforms, and apps for TNW. Features of JioPhone Next developed by Reliance and Google\n\nIn a statement, Google’s CEO, Sundar Pichai said that Google has worked on baking features for the device through a special version of Android:\n\nOur teams have optimized a version of our Android OS, especially for this device."], "wired": ["Google Hopes AI Can Turn Search Into a Conversation", ""]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"ars-technica": "https://arstechnica.com/tech-policy/2021/06/google-will-pay-268m-revamp-ad-platform-to-settle-antitrust-claims/", "engadget": "https://www.engadget.com/google-ends-support-augmented-reality-measure-app-075038678.html", "hacker-news": "https://news.ycombinator.com/item?id=27379083", "recode": null, "techcrunch": "http://techcrunch.com/2021/06/17/google-announces-epyc-based-tau-virtual-machines-for-cloud/", "techradar": "https://www.techradar.com/how-to/how-to-use-google-lens-on-your-iphone-or-ipad", "the-next-web": "https://thenextweb.com/news/reliance-jio-google-jiophone-next-specs-price", "wired": "https://www.wired.com/story/google-hopes-ai-turn-search-conversation/"}, 9, 1624982027.962807, [["negative", 0.870649], ["negative", 0.878559], ["negative", 0.73468], ["negative", 0.710732], ["positive", 0.893015], ["positive", 0.855368], ["positive", 0.627505], ["positive", 0.801038]]], ["Florida Building Collapse", ["national-geographic", "new-scientist", "next-big-future"], {"national-geographic": ["No article found", ""], "new-scientist": ["No article found", ""], "next-big-future": ["No article found", ""]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"national-geographic": null, "new-scientist": null, "next-big-future": null}, 5, 1624982045.760778, [["negative", 0.561097], ["positive", 0.564363], ["negative", 0.504933]]], ["Joe Biden", ["bbc-news", "cnn", "fox-news", "abc-news", "breitbart-news", "axios", "the-hill", "the-washington-post"], {"bbc-news": ["Joe Biden shoos away pesky cicada", ""], "cnn": ["Carrie Johnson steps onto global stage with G7 role", ""], "fox-news": ["Chris Christie: Joe Biden 'knows he's a one-term president'", " Former New Jersey Governor Chris Christie compared President Biden to former President Jimmy Carter on \"America's Newsroom\" Friday, suggesting Biden knows he's a \"one-term president\" and that his $6 trillion budget plan will bring high inflation, deficits and unemployment. You watch, that's what this kind of budget's going to bring to the American people…\n\nWe've got to start talking about how this is destructive to the American economy that we helped to build when we were in charge of all parts of the government just five years ago. And this is the kind of thing that we need to be talking about and let the American people understand that every dollar the government spends is a dollar they can't spend, or save for their future, or invest in their small business."], "abc-news": ["Bidens meet privately with Queen Elizabeth II after royal salute, inspecting guards", " President Joe Biden and first lady Jill Biden visited Windsor Castle Sunday afternoon, where Queen Elizabeth II welcomed them on the dais in the castle's quadrangle and the president inspected the guards."], "breitbart-news": ["Carney: Joe Biden’s Budget Is About Reelecting Joe Biden", " Money for housing and community development in “Indian Country” rises from $134 million in 2024 to $240 million in 2025, $328 million in 2026, and $370 million in 2027. There’s no money budget for next year, just $15 million in 2023, $100 million in 2024, and then it explodes up to $260 million in 2025, $420 million in 2026, $570 million in 2027, and $685 million in 2028."], "axios": ["In photos: Biden meets Queen Elizabeth", ""], "the-hill": ["Bernie Sanders to Biden and Manchin: 'No reconciliation bill, no deal'", " Sen. Bernie Sanders Bernie SandersOn The Money: Headaches mount for Biden in spending fight | McConnell to Schumer: Don't hold bipartisan bill 'hostage' | Court dismisses FTC, state antitrust cases against Facebook Biden, Pelosi on collision course Equilibrium/Sustainability — Presented by NextEra Energy — NASA head doesn't think humans 'alone' in universe MORE (I-Vt.) is warning President Biden Joe BidenSenate Democrat introduces bill to protect journalists from government surveillance Biden touts bipartisan infrastructure deal in op-ed Death toll in Miami condo collapse climbs to 11 MORE and Sen. Joe Manchin Joe ManchinJudge temporarily halts West Virginia needle exchange law amid spike in HIV Why keeping the filibuster intact doesn't really promote bipartisanship Obama says Senate will vote again on voting rights MORE (D-W.Va.) that he will not support a bipartisan infrastructure bill that does not include a provision for reconciliation. “I recognize that he and his Democratic colleagues want more than that, they want other legislation as well,\" Sen. Mitt Romney Willard (Mitt) Mitt RomneyBiden, Pelosi on collision course Equilibrium/Sustainability — Presented by NextEra Energy — NASA head doesn't think humans 'alone' in universe McConnell undecided on bipartisan infrastructure plan MORE (R-Utah) said."], "the-washington-post": ["Biden says it ‘makes sense’ for enhanced jobless aid to end in September", ""]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"bbc-news": "https://www.bbc.co.uk/news/av/world-us-canada-57420206", "cnn": "https://www.cnn.com/2021/06/11/europe/carrie-johnson-g7-spouses-intl-cmd-gbr/index.html", "fox-news": "https://www.foxnews.com/media/chris-christie-joe-biden-one-term-president-jimmy-carter", "abc-news": "https://abcnews.go.com/Politics/bidens-meet-privately-queen-elizabeth-ii-royal-salute/story?id=78254105", "breitbart-news": "https://www.breitbart.com/economy/2021/05/31/carney-joe-bidens-budget-about-reelecting-joe-biden/", "axios": "https://www.axios.com/biden-queen-elizabeth-meet-7b207ce4-2ad0-4fc3-90e7-7058e46ee8a7.html", "the-hill": "https://thehill.com/homenews/senate/560496-bernie-sanders-to-biden-and-manchin-no-reconciliation-bill-no-deal", "the-washington-post": "https://www.washingtonpost.com/us-policy/2021/06/04/white-house-gop-unemployment/"}, 8, 1624982070.2361212, [["positive", 0.875052], ["positive", 0.970368], ["negative", 0.647585], ["positive", 0.764026], ["negative", 0.940292], ["positive", 0.951651], ["negative", 0.847399], ["negative", 0.786621]]], ["Universal healthcare", ["bbc-news", "cnn", "fox-news", "abc-news", "breitbart-news", "axios", "the-hill", "the-washington-post"], {"bbc-news": ["No article found", ""], "cnn": ["Don't just go back to 'normal.' Post-pandemic life can be much better than that", " As the United States rushes to get \"back to normal,\" there are some lessons learned from our time under lockdown that we should keep, and even build upon, to create a new normal -- better than the one before. That focus on our mental health allowed us to grow, to get to know ourselves better and face buried demons or forgotten dreams and work on our personal self-improvement. And from doctors' appointments to weddings to religious worship and concerts -- everyone learned to Zoom, where many amazing things happened over the last year\n\nMost notably, it proved that we are resilient -- and hopefully the darkest days of the pandemic are behind us. IQAir's 2020 World Air Quality Report said human-related emissions from industry and transport fell during lockdowns, and 65% of global cities analyzed experienced better air quality in 2020 compared to 2019."], "fox-news": ["House Progressives urge Biden to pass 'bold' $6T spending plan without GOP support", " Rep. Pramila Jayapal, chair of the liberal House caucus, said progressives want a $6 trillion to $10 trillion plan – far more than the $4 trillion President Biden initially proposed – and urged the president to go big on spending, even it means going alone without the GOP. PROGRESSIVES THINK BIDEN'S LATEST $1.8T FAMILIES PLAN ISN'T BIG ENOUGH\n\nBeyond traditional physical infrastructure, such as roads and bridges, progressives want the inclusion of major social welfare plans in the package, such as expanding Medicare, universal childcare, expansion of the child tax credit, affordable housing and climate change provisions."], "abc-news": ["Caitlyn Jenner says she wants to be 'a thoughtful disrupter' like Trump", " Behar also asked Jenner if she believes that former Trump won the 2020 election, something many Republicans across the country still question as they pursue post-election reviews to \"audit\" election results despite multiple recounts or audits that have resulted in the same outcome showing Trump lost."], "breitbart-news": ["No article found", ""], "axios": ["No article found", ""], "the-hill": ["The GOP's strategy is galvanizing Democrats ahead of 2022", " It’s not rocket science — instead of lulling Democrats to sleep and taking advantage of a party in complete control of every level of government, Republicans have found a way to activate the base of the Democratic party and ensure another cycle of record turnout."], "the-washington-post": ["No article found", ""]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"bbc-news": null, "cnn": "https://www.cnn.com/2021/05/30/health/better-than-normal-wellness/index.html", "fox-news": "https://www.foxnews.com/politics/house-progressives-biden-infrastructure-gop", "abc-news": "https://abcnews.go.com/Politics/caitlyn-jenner-thoughtful-disrupter-trump/story?id=78180142", "breitbart-news": null, "axios": null, "the-hill": "https://thehill.com/opinion/campaign/557550-the-gops-strategy-is-galvanizing-democrats-ahead-of-2022", "the-washington-post": null}, 2, 1624982332.883901, [["negative", 0.643402], ["positive", 0.979797], ["negative", 0.511849], ["negative", 0.660988], ["negative", 0.641591], ["negative", 0.655131], ["positive", 0.516116], ["negative", 0.647788]]], ["Champlain Towers", ["national-geographic", "new-scientist", "next-big-future"], {"national-geographic": ["No article found", ""], "new-scientist": ["No article found", ""], "next-big-future": ["No article found", ""]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"national-geographic": null, "new-scientist": null, "next-big-future": null}, 1, 1624983117.9968672, [["negative", 0.505207], ["positive", 0.618615], ["positive", 0.551084]]], ["Champlain towers collapse", ["national-geographic", "new-scientist", "next-big-future"], {"national-geographic": ["No article found", ""], "new-scientist": ["No article found", ""], "next-big-future": ["No article found", ""]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"national-geographic": null, "new-scientist": null, "next-big-future": null}, 1, 1624983138.200136, [["negative", 0.505207], ["positive", 0.618615], ["positive", 0.551084]]]]