[["Joe Biden", ["bbc-news", "cnn", "fox-news", "abc-news", "breitbart-news", "axios", "the-hill", "the-washington-post"], {"bbc-news": ["Biden backs $1.2tn infrastructure bill but places big condition", ""], "cnn": ["Biden meets with key Democratic senators as he pushes for path on voting, infrastructure", ""], "fox-news": ["Trevor Noah says he's glad he doesn't have to talk about Biden", " NBC'S CHUCK TODD DOUBLES DOWN ON DISMISSING CRITICAL RACE THEORY, SAYS IT'S ‘MANUFACTURED’ DURING PANEL CLASH\n\n\"Biden delivered on one thing that he promised on, and that was he’s going to be the president that nobody wants to talk about. \"In a new administration Noah dedicates less of the show to the president’s daily tweets and more to topics like climate change, gender discrimination, and recent violence against Asian-Americans,\" Geist said."], "abc-news": ["Biden celebrates Pride Month, highlighting LGBTQ rights", " President Joe Biden is celebrating Pride Month at the White House, a reflection of the growing stature of the LGBTQ community at the highest level of government\n\nWASHINGTON -- President Joe Biden celebrated Pride Month at the White House on Friday, a reflection of the growing stature of the LGBTQ community at the highest level of government. And above all, Pride Month stands for love.”\n\nTransportation Secretary Pete Buttigieg, the first openly gay person confirmed to a Cabinet post, joined the president and first lady in the White House's East Room and also gave remarks. “So many lives have been changed, saved by the sustained advocacy, the moral resolve, the political courage of countless LGBTQ-plus leaders and allies, some elected, some invisible, some long gone, some in this room right now.”\n\nA White House hallway was lit in the colors of the rainbow flag, a symbol of the LGBTQ movement, and Biden said he takes the hallway each day as he goes between the residence and the Oval Office."], "breitbart-news": ["Joe Rogan: Everyone Knows Biden Is ‘Out of His Mind, He’s Barely Hanging in There’", " During Thursday’s edition of Spotify’s popular The Joe Rogan Experience, comedian and podcast host Joe Rogan said during an interview with comedian Iliza Shlesinger that it’s common knowledge President Joe Biden is “out of his mind” and “barely hanging in there.”\n\nJoe Rogan doesn't hold back when talking about Joe Biden, \"we don't really have a leader in this country anymore.\" ROGAN: I bet a lot of people in the future are going to say that about the 20s, what’s happening right now."], "axios": ["Senators welcome Biden's infrastructure walk-back", " Joe Manchin (D-W.Va.) and Rob Portman (R-Ohio) said they were relieved by President Biden's statement on Saturday, walking back his implied veto threat of the bipartisan infrastructure deal."], "the-hill": ["Bernie Sanders to Biden and Manchin: 'No reconciliation bill, no deal'", " Sen. Bernie Sanders Bernie SandersOn The Money: Headaches mount for Biden in spending fight | McConnell to Schumer: Don't hold bipartisan bill 'hostage' | Court dismisses FTC, state antitrust cases against Facebook Biden, Pelosi on collision course Equilibrium/Sustainability — Presented by NextEra Energy — NASA head doesn't think humans 'alone' in universe MORE (I-Vt.) is warning President Biden Joe BidenSenate Democrat introduces bill to protect journalists from government surveillance Biden touts bipartisan infrastructure deal in op-ed Death toll in Miami condo collapse climbs to 11 MORE and Sen. Joe Manchin Joe ManchinJudge temporarily halts West Virginia needle exchange law amid spike in HIV Why keeping the filibuster intact doesn't really promote bipartisanship Obama says Senate will vote again on voting rights MORE (D-W.Va.) that he will not support a bipartisan infrastructure bill that does not include a provision for reconciliation. “I recognize that he and his Democratic colleagues want more than that, they want other legislation as well,\" Sen. Mitt Romney Willard (Mitt) Mitt RomneyBiden, Pelosi on collision course Equilibrium/Sustainability — Presented by NextEra Energy — NASA head doesn't think humans 'alone' in universe McConnell undecided on bipartisan infrastructure plan MORE (R-Utah) said."], "the-washington-post": ["As the last American forces prepare to leave Afghanistan, Biden says the country’s fate is in its own hands", ""]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"bbc-news": "https://www.bbc.co.uk/news/world-us-canada-57604121", "cnn": "https://www.cnn.com/2021/06/21/politics/biden-sinema-manchin/index.html", "fox-news": "https://www.foxnews.com/media/trevor-noah-says-glad-doesnt-have-talk-biden", "abc-news": "https://abcnews.go.com/Politics/wireStory/biden-names-special-diplomatic-envoy-lgbtq-rights-78485526", "breitbart-news": "https://www.breitbart.com/entertainment/2021/06/25/joe-rogan-everyone-knows-biden-is-out-of-his-mind-hes-barely-hanging-in-there/", "axios": "https://www.axios.com/bipartisan-senators-biden-statement-infastructure-f36a86eb-88f0-4e1d-a21d-f48ca3de6164.html", "the-hill": "https://thehill.com/homenews/senate/560496-bernie-sanders-to-biden-and-manchin-no-reconciliation-bill-no-deal", "the-washington-post": "http://www.washingtonpost.com/politics/biden-ghani-afghanistan/2021/06/25/78cc2d86-d5df-11eb-ae54-515e2f63d37d_story.html"}, 3, 1625025294.615534, [["negative", 0.601177], ["positive", 0.745959], ["negative", 0.507363], ["positive", 0.986737], ["positive", 0.882396], ["negative", 0.701058], ["negative", 0.847399], ["negative", 0.620213]]], ["python programming language", ["ars-technica", "engadget", "hacker-news", "recode", "techcrunch", "techradar", "the-next-web", "wired"], {"ars-technica": ["No article found", ""], "engadget": ["No article found", ""], "hacker-news": ["No article found", ""], "recode": ["No article found", ""], "techcrunch": ["No article found", ""], "techradar": ["Some official Python repos were infected with malware", ""], "the-next-web": ["Want to code and build robots and other cool gadgets? This Raspberry training can help", " It’s a five-course distillation that can help even first time creators understand the basics of modern programming, the fundamentals of crafting small electronics, and linking those two together through the popular Raspberry Pi microcomputer and Arduino electronics platform to help lift a learner’s technical training to the next level."], "wired": ["No article found", ""]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"ars-technica": null, "engadget": null, "hacker-news": null, "recode": null, "techcrunch": null, "techradar": "https://www.techradar.com/news/official-python-repos-contained-malware", "the-next-web": "https://thenextweb.com/news/want-to-code-and-build-robots-and-other-cool-gadgets-this-raspberry-training-can-help", "wired": null}, 1, 1625025360.831763, [["negative", 0.566412], ["positive", 0.611926], ["negative", 0.586843], ["negative", 0.60378], ["positive", 0.509442], ["negative", 0.801725], ["positive", 0.994902], ["negative", 0.605345]]], ["Big tech censorship", ["ars-technica", "engadget", "hacker-news", "recode", "techcrunch", "techradar", "the-next-web", "wired"], {"ars-technica": ["No article found", ""], "engadget": ["No article found", ""], "hacker-news": ["No article found", ""], "recode": ["No article found", ""], "techcrunch": ["Brave’s nontracking search engine is now in beta – TechCrunch", " Only by building our own index, which is a costly proposition, will we be in a position to offer true choice to the users for the benefit of all, whether they are Brave Search users or not.”\n\nAlthough, for now, it’s worth noting that Brave is relying on some provision from other search providers — for specific queries and in areas like image search (where, for example, it says it’s currently fetching results from Microsoft-owned Bing) — to ensure its results achieve adequate relevancy. “When we are ready, we will explore bringing private ads with BAT revenue share to search, as we’ve done for Brave user ads.”\n\nUsers of the search engine who do not also use Brave’s own browser will be served contextual ads. Asked about pricing of the forthcoming ad-free version of the search engine he says: “Although we have not finalized the launch date or the price yet, our ad-free paid search will be affordable because we believe search, and access to information, should be available on fair terms for everyone.”\n\nIn an interesting recent development in Europe, Google — under pressure from antitrust regulators — has agreed to ditch a pay-to-play auction model for the choice screen it offers regional users of its Android platform, letting them pick a default search engine from a list with a number of rivals and its own brand Google search. “After all, Brave Search is open to everyone who would like to use it, and we are open and happy to put Brave Search on any platform.”\n\n“We have localized browsers throughout the European market, so in addition to growth via the Brave browser growing, we intend to grow Brave Search’s usage by marketing our best-in-class privacy on all media that reach prospective users,” he adds."], "techradar": ["No article found", ""], "the-next-web": ["No article found", ""], "wired": ["No article found", ""]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"ars-technica": null, "engadget": null, "hacker-news": null, "recode": null, "techcrunch": "https://techcrunch.com/2021/06/22/braves-non-tracking-search-engine-is-now-in-beta/", "techradar": null, "the-next-web": null, "wired": null}, 3, 1625025393.558847, [["negative", 0.662398], ["positive", 0.524482], ["negative", 0.679571], ["negative", 0.695347], ["positive", 0.746275], ["negative", 0.65449], ["negative", 0.734073], ["negative", 0.696794]]], ["Pride month", ["bbc-news", "cnn", "fox-news", "abc-news", "breitbart-news", "axios", "the-hill", "the-washington-post"], {"bbc-news": ["Pride month: Five stories from around the world", " I answer the phone from mothers of transgender teenagers who just came out - and because there is no official education about it, they don't know what to do. They are coming to Tolerado saying 'please help us, my kid is transgender, what should I do?"], "cnn": ["Pride is a parenting opportunity", " He's bruised by their rejection, but not broken -- he's happily in a relationship with a man his parents have never met. Parents need to talk with their kids and listen to them, about their own sexuality, and acceptance of that of others. Remember, this is still the child you love\n\nMany parents have expressed to me, in a state of despair, that they will never be able to fully relate to their LGBTQ+ child again once they come out. By wishing only for conformity, parents don't get to enjoy a lifelong connection with their LGBTQ+ children -- the children they have raised, the children they say they have loved unconditionally. Even if you think you don't need to think about Pride because your kids aren't LGBTQ+, you face an opportunity to talk with all of your kids about unconditional love and acceptance."], "fox-news": ["Seattle Pride organizers apologize after raising issue with event charging White people 'reparations' fee", " Two Pride Month organizers in Seattle are now apologizing to the local community after writing a letter to the city taking issue with a separate upcoming event’s plans to charge a \"$10 to $50 reparations fee\" for White people, calling it \"reverse discrimination.\""], "abc-news": ["Biden celebrates Pride Month, highlighting LGBTQ rights", " President Joe Biden is celebrating Pride Month at the White House, a reflection of the growing stature of the LGBTQ community at the highest level of government\n\nWASHINGTON -- President Joe Biden celebrated Pride Month at the White House on Friday, a reflection of the growing stature of the LGBTQ community at the highest level of government. And above all, Pride Month stands for love.”\n\nTransportation Secretary Pete Buttigieg, the first openly gay person confirmed to a Cabinet post, joined the president and first lady in the White House's East Room and also gave remarks. “So many lives have been changed, saved by the sustained advocacy, the moral resolve, the political courage of countless LGBTQ-plus leaders and allies, some elected, some invisible, some long gone, some in this room right now.”\n\nA White House hallway was lit in the colors of the rainbow flag, a symbol of the LGBTQ movement, and Biden said he takes the hallway each day as he goes between the residence and the Oval Office."], "breitbart-news": ["NFL Releases Pride Month Video Saying, ‘Football Is Gay’", " The National Football League is going all in as Pride Month wraps up with a new video proclaiming that “football is gay.”\n\nIn a stark black-and-white, all text video, the NFL exclaimed that football is “accepting” and is “for everyone” including the LGBTQ community. The video adds, “Football is transgender,” “Football is bisexual,” “Football is for everyone.”\n\n“I am proud of the clear message this spot sends to the NFL’s LGBTQ+ fans: This game is unquestionably for you,” NFL Diversity Director Sam Rapoport, told Outsports. In a statement, the NFL added:\n\nIn the new film ‘Football is for Everyone’ from the NFL in partnership with The Trevor Project and creative agency 72andSunny Los Angeles, the league redefines the game to be inclusive of all different types of fans, coaches and players."], "axios": ["Miss Nevada crowned, Miss USA to have first transgender contestant", " Driving the news: Enriquez beat 21 other contestants days out from the end of Pride month to become the newly crowned Miss Nevada USA, and she's using the platform to raise awareness for the transgender community ahead of November's national pageant."], "the-hill": ["Biden names special envoy for LGBTQ rights", " President Biden Joe BidenSenate Democrat introduces bill to protect journalists from government surveillance Biden touts bipartisan infrastructure deal in op-ed Death toll in Miami condo collapse climbs to 11 MORE on Friday named Jessica Stern as the State Department’s U.S. special envoy to advance the human rights of LGBTQ people, an announcement that coincides with the White House’s celebration of Pride Month. The White House said that Stern will be critical to implementing a presidential memorandum Biden signed earlier this year on protecting LGBTQ rights worldwide and to “ensuring that U.S. diplomacy and foreign assistance promote and protect the human rights of LGBTQI+ persons around the world.”\n\n“At a time when the human rights of LGBTQI+ persons are increasingly threatened in all regions of the world, the Special Envoy will bring together like-minded governments, civil society organizations, corporations and international organizations to uphold dignity and equality for all,” the White House said."], "the-washington-post": ["AIDS disappeared from public view without ending. Will covid-19 do the same?", ""]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"bbc-news": "https://www.bbc.co.uk/news/world-57604310", "cnn": "https://www.cnn.com/2021/06/27/opinions/pride-coming-out-teen-wellness/index.html", "fox-news": "https://www.foxnews.com/us/seattle-pride-organizers-issue-apology-white-people-reparations-fee", "abc-news": "https://abcnews.go.com/Politics/wireStory/biden-names-special-diplomatic-envoy-lgbtq-rights-78485526", "breitbart-news": "https://www.breitbart.com/sports/2021/06/28/nfl-releases-pride-video-proclaiming-football-is-gay/", "axios": "https://www.axios.com/miss-usa-first-transgender-contestant-nevada-bcafbe37-66cf-4e91-b147-a2ccfaadf07b.html", "the-hill": "https://thehill.com/homenews/administration/560191-biden-names-special-envoy-for-lgbtq-rights", "the-washington-post": "https://www.washingtonpost.com/outlook/2021/06/29/aids-disappeared-public-view-without-ending-will-covid-19-do-same/"}, 3, 1625025421.6086872, [["negative", 0.683685], ["positive", 0.890345], ["positive", 0.708407], ["positive", 0.986737], ["positive", 0.968104], ["negative", 0.532705], ["positive", 0.729696], ["negative", 0.807992]]], ["Infrastructure bill", ["ars-technica", "engadget", "hacker-news", "recode", "techcrunch", "techradar", "the-next-web", "wired"], {"ars-technica": ["Biden silent on municipal broadband as he makes $65B deal with Republicans", " President Joe Biden announced a $65 billion broadband-deployment deal Thursday with Senate Republicans and Democrats, but he provided no details on whether the plan will prioritize municipal broadband networks as the president originally proposed. Congressional Republicans have tried to ban municipal broadband nationwide, so it's highly unlikely that they would have agreed to Biden's stated goal of giving public networks priority over private ISPs in the next big round of government subsidies."], "engadget": ["No article found", ""], "hacker-news": ["No article found", ""], "recode": ["No article found", ""], "techcrunch": ["Andreessen Horowitz triples down on blockchain startups with massive $2.2 billion Crypto Fund III – TechCrunch", " While the cryptocurrency market’s most recent hype wave seems to be dying down after a spectacular rise, Andreessen Horowitz’s crypto arm is reaffirming its commitment to startups building blockchain projects with a hulking new $2.2 billion crypto fund. The new multibillion dollar fund not only showcases how institutional backers are growing more comfortable with cryptocurrencies, but also how Andreessen Horowitz’s assets under management have been quickly swelling to compete with other deep-pocketed firms including the ever-prolific Tiger Global."], "techradar": ["Oracle offering new cost perks for customers moving to cloud", ""], "the-next-web": ["No article found", ""], "wired": ["A $26 Billion Plan to Save the Houston Area From Rising Seas", " “The next morning, I started sketching what I thought would look reasonable here,” he said, “and it turned out to be pretty close to what the Dutch would have done.”\n\nThese sketches were the beginning of the Ike Dike, a proposal for a coastal barrier intended to protect Galveston Bay."]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"ars-technica": "https://arstechnica.com/tech-policy/2021/06/biden-silent-on-municipal-broadband-as-he-makes-65b-deal-with-republicans/", "engadget": null, "hacker-news": null, "recode": null, "techcrunch": "https://techcrunch.com/2021/06/24/andreessen-horowitz-triples-down-on-blockchain-startups-with-massive-2-2-billion-crypto-fund-iii/", "techradar": "https://www.techradar.com/news/oracle-offering-new-cost-perks-for-customers-moving-to-cloud", "the-next-web": null, "wired": "https://www.wired.com/story/a-dollar26-billion-plan-to-save-the-houston-area-from-rising-seas/"}, 3, 1625025498.342628, [["negative", 0.662933], ["negative", 0.539944], ["negative", 0.726941], ["negative", 0.740672], ["positive", 0.665293], ["positive", 0.620329], ["negative", 0.774085], ["positive", 0.819855]]], ["Ethiopian rebels", ["bbc-news", "cnn", "fox-news", "abc-news", "breitbart-news", "axios", "the-hill", "the-washington-post"], {"bbc-news": ["Ethiopia Tigray conflict: Rebels build on capture of capital", ""], "cnn": ["Rebels in Tigray reject calls for ceasefire after Ethiopian government forces withdraw from regional capital", " (CNN) Rebel forces in the war-torn Ethiopian region of Tigray have rejected a ceasefire offer from the central government, raising fears of further violence a day after the fighters retook the regional capital Mekelle."], "fox-news": ["No article found", ""], "abc-news": ["No article found", ""], "breitbart-news": ["No article found", ""], "axios": ["No article found", ""], "the-hill": ["No article found", ""], "the-washington-post": ["Airstrike hit a crowded market in Ethiopia’s Tigray region, officials say", ""]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"bbc-news": "https://www.bbc.co.uk/news/world-africa-57642746", "cnn": "https://www.cnn.com/2021/06/29/africa/tigray-ethiopia-ceasefire-intl/index.html", "fox-news": null, "abc-news": null, "breitbart-news": null, "axios": null, "the-hill": null, "the-washington-post": "https://www.washingtonpost.com/world/2021/06/23/ethiopia-tigray-airstrikes/"}, 1, 1625025528.351816, [["positive", 0.776274], ["positive", 0.565102], ["negative", 0.752122], ["negative", 0.579858], ["negative", 0.566977], ["negative", 0.579858], ["negative", 0.583329], ["negative", 0.560511]]], ["Britney Spears", ["bbc-news", "cnn", "fox-news", "abc-news", "breitbart-news", "axios", "the-hill", "the-washington-post"], {"bbc-news": ["Jamie Lynn Spears: I'm so proud of Britney for using her voice", ""], "cnn": ["Jamie Lynn Spears breaks her silence about Britney", ""], "fox-news": ["Kennedy Saves Britney", " On this episode, Kennedy discusses the unconstitutionality of Britney Spears conservatorship, the miscarriage of justice by the state of California, and her hope for Britney’s future."], "abc-news": ["Britney Spears asks judge to end court conservatorship that has controlled her life and money for 13 years", ""], "breitbart-news": ["Rose McGowan: Britney Spears is ‘Ready to Blow the Lid’ on the ‘Rot’ in Hollywood", " Actress Rose McGowan, who famously exposed Harvey Weinstein’s years of sex crimes, says pop superstar Britney Spears is “ready to blow the lid” on the “rot” that persists in Hollywood. In an interview with Fox News’ Tucker Carlson, McGowan called Spears’ testimony a “cultural reset” and said she believes the pop star is “ready to blow the lid” on who has wronged her in Hollywood and what has been done to her over the last 13 years. “And I know it seems like one person but they’ve done this to women and humans and whistleblowers and people they don’t like and really like you said, Tucker, the people — the monsters in power — that control the puppet, not just her, but like the message it sends to every girl or every boy out there that you are disposable and the elite can own you.”\n\nMcGowan said that while the media “laughed and scorned” Spears when she infamously shaved her head in 2007, her father was devising a plan with “paid off doctors’ help” to put her on the conservatorship by declaring her as having dementia. “I lived in Hollywood at that time [Britney Spears shaved her head] and I’ve made it my life’s mission to tell all of you out there what so many of you really know deep down that fame and Hollywood and the media machine are rotten to the core and they do hurt and they do damage,” McGowan said:\n\nAt age 25, her father and a judge ruled — with many paid off doctors’ help — that Britney Spears had dementia."], "axios": ["No article found", ""], "the-hill": ["Obama says Senate will vote again on voting rights", " Speaking to supporters in his first fundraising call since the 2020 elections, Obama teamed up with House Speaker Nancy Pelosi Nancy PelosiOvernight Defense: Biden launches strikes on Iran-backed militias in Iraq, Syria | Book says Trump shouted at Milley over protest response | Questions remain on Afghan evacuations Biden, Pelosi on collision course Equilibrium/Sustainability — Presented by NextEra Energy — NASA head doesn't think humans 'alone' in universe MORE (D-Calif.) and former Attorney General Eric Holder Eric Himpton HolderObama says Senate will vote again on voting rights Obama: Voting rights bill must pass before next election NYC voters set to decide Vance's replacement amid Trump probe MORE to call for support for the National Democratic Redistricting Committee (NDRC), which organized the call. \"I have every confidence that Nancy working in conjunction with [Senate Majority Leader] Chuck Schumer Chuck SchumerObama says Senate will vote again on voting rights The Innovation and Competition Act is progressive policy Infrastructure deal: Major climate win that tees up more in reconciliation bill MORE, Joe Biden and others, including people like [Sen.] Joe Manchin Joe ManchinJudge temporarily halts West Virginia needle exchange law amid spike in HIV Why keeping the filibuster intact doesn't really promote bipartisanship Obama says Senate will vote again on voting rights MORE, are going to figure out a way in which there's an up and down vote on the For the People Act,\" said Obama. Obama said action on voting rights is even more important following the aftermath of the 2020 presidential election, where former President Trump Donald TrumpSenate Democrat introduces bill to protect journalists from government surveillance Trump lawyer says New York DA considering charges related to employee perks Trump lashes out at NY prosecutors as his lawyers argue against criminal charges MORE's unfounded claims of election fraud fueled anger among his supporters, leading to the attack on the U.S. Capitol on Jan. 6."], "the-washington-post": ["Britney Spears requests termination of her conservatorship: ‘It’s embarrassing and it’s demoralizing’", " “I’ve told the world I’m happy and okay,” she said, but went on to describe prescription drug therapy that had left her feeling drunk, as well as mandatory twice- and thrice-weekly therapy sessions held in places where the public could see her arriving and leaving, as opposed to in her home, as Spears had requested."]}, {"bbc-news": "center", "cnn": "liberal", "fox-news": "conservative", "abc-news": "liberal", "breitbart-news": "conservative", "axios": "center", "the-hill": "center", "the-washington-post": "liberal"}, {"bbc-news": "https://www.bbc.co.uk/news/entertainment-arts-57649648", "cnn": "https://www.cnn.com/videos/entertainment/2021/06/30/jamie-lynn-spears-britney-spears-conservatorship-mxp-vpx.cnn", "fox-news": "https://radio.foxnews.com/2021/06/25/kennedy-saves-britney/", "abc-news": "https://abcnews.go.com/Entertainment/wireStory/britney-spears-asks-judge-end-court-conservatorship-controlled-78451987", "breitbart-news": "https://www.breitbart.com/entertainment/2021/06/24/rose-mcgowan-britney-spears-tucker-carlson/", "axios": null, "the-hill": "https://thehill.com/latino/560571-obama-says-senate-will-vote-again-on-voting-rights", "the-washington-post": "https://www.washingtonpost.com/arts-entertainment/2021/06/23/britney-spears-conservatorship-dad-jamie/"}, 6, 1625025618.627498, [["negative", 0.781399], ["negative", 0.759165], ["positive", 0.784255], ["negative", 0.769855], ["negative", 0.666729], ["negative", 0.69457], ["negative", 0.513718], ["negative", 0.815948]]]]