[["Google", {"techcrunch": ["https://techcrunch.com/2021/08/18/planet-labs-and-google-cloud-join-forces-in-data-analysis-agreement/", "Planet Labs and Google Cloud join forces in data analysis agreement – TechCrunch", " This latest agreement will let Planet customers use products like BigQuery to analyze large volumes of satellite imaging data, reflecting “a growing demand for planetary-scale satellite data analysis, powered by the cloud,” Planet said in a news release.", "centrist", "https://techcrunch.com/wp-content/uploads/2021/08/planet-labs.jpeg?w=533"], "engadget": ["https://www.engadget.com/google-pixel-5-a-review-android-midrange-5g-smartphone-160051630.html", "Google Pixel 5a review", " Google Pixel 5a SCORE 86 Engadget 86 Critics - Not yet scored N/A Users - Not yet scored N/A Pros Epic battery life\n\nExcellent photo and video features\n\nIP67 water and dust resistance\n\nSolid construction Cons Middling performance\n\nOnly minor changes from Pixel 4a 5G\n\nKind of boring\n\nWell, it makes the Pixel 5a about as unexciting as a phone can be, for one. Terrence O'Brien / Engadget\n\nThe last difference between the Pixel 5a and the 4a 5G is in the size and construction, but it’s subtle.", "centrist", "https://s.yimg.com/os/creatr-uploaded-images/2021-08/bb81e872-feb9-11eb-bbff-0a2170ea78de"], "the-next-web": ["https://thenextweb.com/news/google-pixel-folding-phone-soon-maybe", "Here's more proof that Google is making a folding Pixel phone", " Developer cstark27, whom we’ve previously talked about for leaking the Pixel 6‘s camera sensor, also noticed that the Android 12 beta refers to a device codenamed ‘Passport.’ This has previously been rumored as the folding Pixel’s codename (and the name makes sense in terms of form factor). — cstark27 (@Cstark_27) August 11, 2021\n\n‘Oriole’ and ‘Raven’ are the codenames for the Pixel 6 and Pixel 6 Pro, so it would seem Google has at least two more devices on the way with the new chip. Considering the company already spoiled the ‘surprise’ of the Pixel 6 and Pixel 6 Pro, the Passport reveal could be a nice bonus for Google’s expected hardware event.", "centrist", "https://img-cdn.tnwcdn.com/image/plugged?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2020%2F08%2FSnag_e6a682.png&signature=3c3f9c1e6713341619f1ebde30e52d0e"], "techradar": ["https://www.techradar.com/news/google-facebook-join-forces-on-new-submarine-internet-cable", "Google, Facebook join forces on new submarine internet cable", "Google and Facebook have announced they will work together on a new undersea internet cable, with the goal of boosting network resilience and capacity in the Asia-Pacific (APAC) region.\n\nOnce complete, the 12,000km Apricot cable will dock in Japan, Taiwan, Guam, Indonesia, the Philippines and Singapore, and will go some way to satisfying the rising demand for data in the area.\n\nThe two companies say the new submarine web cable will be ready for action by 2024, with an initial capacity of circa 190 Tb/second, shy of the current record (held by Google’s Dunant cable at 250 Tb/second).\n\nWe've built a list of the best web hosting services right now\n\nCheck out our list of the best shared web hosting services\n\nHere's our list of the best dedicated hosting providers out there\n\nUndersea web cables\n\nAccording to a Google blog post , Apricot will reinforce the positive effects of its Echo cable system, which will eventually connect the US, Singapore, Guam and Indonesia.\n\n“The Echo and Apricot cables are complementary submarine systems that will offer benefits with multiple paths in and out of Asia, including unique routes through southern Asia, ensuring a significantly higher degree of resilience for Google Cloud and digital services,” the company explained.\n\nGoogle says the new cable systems will be a boon for businesses on both sides of the Pacific, providing lower latency and more bandwidth along routes between Asia and the US. Citing research into the effects of network investments between 2010 and 2019, the company says the new cables are also likely to lead to a boost in APAC jobs and GDP.\n\nApricot is the latest in a series of new submarine cables recently unveiled by Google; others include Firmina , Dunant , Blue and Raman . In total, the company now holds a share in nineteen different cable networks.\n\nGoogle has also previously collaborated with Facebook on submarine cable systems. Most famously, the pair worked together on the Pacific Light Cable Network , although the system later had to be scaled back as a result of tensions between the US and China.", "centrist", "https://cdn.mos.cms.futurecdn.net/chNaE6j2HNbEGzfMvhgeNE-1200-80.jpg"], "ars-technica": ["https://arstechnica.com/tech-policy/2021/08/apple-and-google-seem-spooked-by-bill-requiring-more-app-stores-and-sideloading/", "Apple and Google seem spooked by bill requiring more app stores and sideloading", " The lawmakers summarize the legislation as follows:\n\nThe Open App Markets Act would protect developers' rights to tell consumers about lower prices and offer competitive pricing; protect sideloading of apps; open up competitive avenues for startup apps, third party app stores, and payment services; make it possible for developers to offer new experiences that take advantage of consumer device features; give consumers more control over their devices; prevent app stores from disadvantaging developers; and set safeguards to continue to protect privacy, security, and safety of consumers. Blackburn said that \"Apple and Google want to prevent developers and consumers from using third-party app stores that would threaten their bottom line,\" while Blumenthal said the two companies \"have squashed competitors and kept consumers in the dark—pocketing hefty windfalls while acting as supposedly benevolent gatekeepers of this multi-billion dollar market.\" To obtain this exemption, Apple and Google would have to establish \"by clear and convincing evidence that the action described is applied on a demonstrably consistent basis to apps of the covered company or its business partners and to other apps; not used as a pretext to exclude, or impose unnecessary or discriminatory terms on, third-party apps, in-app payment systems, or app stores; and narrowly tailored and could not be achieved through a less discriminatory and technically possible means.\"", "centrist", "https://cdn.arstechnica.net/wp-content/uploads/2021/08/getty-app-store-760x380.jpg"]}, {"techcrunch": ["positive", 0.521451], "engadget": ["negative", 0.603411], "the-next-web": ["positive", 0.521462], "techradar": ["positive", 0.975613], "ars-technica": ["negative", 0.897811]}, 1, 1629322844.6409888], ["pelosi committee", {"fox-news": ["https://www.foxnews.com/video/6316172794112", "Biden calls for more gun control as GOP sets to takes House", "Log in to comment on videos and join in on the fun.", "conservative", "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/bf6ae647-1fd9-4ae3-9bc1-8872d50269d2/dc32632e-3bbb-467f-9e26-6f41ebf38763/1280x720/match/1024/512/image.jpg?ve=1&tl=1"], "breitbart-news": ["https://www.breitbart.com/politics/2022/11/25/politico-survey-65-of-registered-voters-say-joe-biden-should-not-run-in-2024/", "Poll: Majority Say Biden Should Not Run in 2024", " The survey asked respondents, “Do you believe Joe Biden should run for president in the 2024 election?” Overall, just over a quarter, 28 percent, said he should run for office, and of those, only 15 percent said he “definitely” should do so. Jobs:\n\n43 percent approve\n\n49 percent disapprove\n\nImmigration:\n\n34 percent approve\n\n57 percent disapprove\n\nClimate change:\n\n42 percent approve\n\n45 percent disapprove\n\nEnergy:\n\n41 percent approve\n\n48 percent disapprove\n\n\n\nEducation:\n\n44 percent approve\n\n46 percent disapprove\n\nNational security:\n\n41 percent approve\n\n49 percent disapprove\n\nThe same survey also asked respondents if former President Donald Trump should run in 2024, and he garnered more support than Biden with 34 percent expressing the belief that he should.", "conservative", "https://media.breitbart.com/media/2022/11/biden_leaving2-640x335.jpg"], "abc-news": ["https://abcnews.go.com/Politics/biden-reiterates-call-assault-weapons-ban-after-mass/story?id=93921163", "Biden reiterates call for assault weapons ban after mass shootings", " \"I’m going to try to get rid of assault weapons,\" the president said Thursday. President Joe Biden reiterated his call to pursue a ban on assault weapons following the latest mass shooting at a Walmart in Virginia and said it’s \"sick\" that the U.S. continues to sell semiautomatic weapons.", "liberal", "https://s.abcnews.com/images/US/uva-shooting-charlottesville-2-gty-thg-221114_1668435992603_hpMain_16x9_992.jpg"], "msnbc": ["https://www.msnbc.com/opinion/msnbc-opinion/presidents-pardon-turkeys-thanksgiving-rcna58359", "Presidents should pardon more than turkeys for Thanksgiving", " In typical fashion, he deflected questions about whether he’d pardon the perpetrators of the Iran-Contra scandal by joking about the turkey, Charlie, that was presented to him that year: “If they’d given me a different answer on Charlie and his future, I would have pardoned him.”\n\nGeorge H.W.", "liberal", "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-11/221123-george-w-bush-thanksgiving-turkey-pardon-2007-an-24c505.jpg"], "bbc-news": ["https://www.bbc.co.uk/news/world-us-canada-63724224", "Biden extends student loan repayments freeze amid lawsuits", "A federal judge in Texas struck down the plan on 10 November after a lawsuit filed by a conservative group on behalf of two borrowers who did not qualify for all of the programme's benefits.", "center", "https://ichef.bbci.co.uk/news/1024/branded_news/144DC/production/_127746138_gettyimages-1435390758.jpg"], "cnn": ["https://www.cnn.com/2022/11/22/politics/jill-biden-naomi-biden-vogue-magazine/index.html", "Jill Biden and Naomi Biden featured in Vogue magazine", "CNN —\n\nFirst lady Jill Biden and her granddaughter, Naomi Biden, are featured on the cover of the new digital version of Vogue magazine, which will be released Tuesday, a person familiar with the details told CNN.\n\nThe photos and story will also appear inside the print edition of the upcoming February issue, the person said.\n\nThe Bidens were photographed for the story on Thursday, inside the White House Green Room, two days before Naomi Biden married Peter Neal on the South Lawn. Naomi Biden wore her bridal gown for the Vogue shoot – a custom, long-sleeved dress and cathedral-length train by designer Ralph Lauren, which she told the magazine was inspired by a gown worn by actress Grace Kelly.\n\nElizabeth Alexander, communications director for Jill Biden, confirmed to CNN a photo shoot with Vogue took place on Thursday, November 17, but provided no further comment.\n\nThe first lady wore the same teal dress she would wear to the wedding reception Saturday evening. Photos released by Jill Biden on Sunday show her in the dress dancing with President Joe Biden at the reception.\n\nNaomi Biden was also photographed inside the Cross Hall of the White House, wearing her reception dress – a silk, strapless gown with sheer, opera-length gloves by designer Reem Acra – which she wore to the dessert and dancing portion of the wedding celebration.\n\nThe person with knowledge of the details told CNN that Naomi Biden shared with Vogue the story of her relationship with Neal, and how the couple undertook the planning of their White House wedding, the first-ever for a granddaughter of a president, and only the 19th wedding to take place on the grounds.", "liberal", "https://media.cnn.com/api/v1/images/stellar/prod/221119143621-01-naomi-biden-wedding-221119.jpg?c=16x9&q=w_800,c_fill"], "axios": ["https://www.axios.com/2022/11/22/pelosi-leadership-age-biden-democrats", "Pelosi throws down gauntlet for Biden, other aging leaders", " Like a seasoned CEO, House Speaker Nancy Pelosi (D-Calif.) handled her party's succession plan seamlessly — anointing a new generation of Democratic talent at a moment other aging leaders are reluctant to give up power. Driving the news: The percentage of Democratic voters who believe Biden should be the nominee in 2024 ticked up six points after the party's strong showing in the midterms — but 50% still believe he should be replaced, according to a new USA Today/Ipsos poll. The other side: Trump has boxed out a new generation of GOP leaders not just by announcing a third presidential bid, but by publicly attacking two of his party's rising stars on social media — DeSantis and Virginia Gov.", "center", "https://images.axios.com/8mUSiRBE4cupOYBZYnK7nODhvX0=/0x0:1920x1080/1366x768/2022/11/21/1669072330810.jpg"]}, {"fox-news": ["positive", 0.771667], "breitbart-news": ["negative", 0.942197], "abc-news": ["negative", 0.847587], "msnbc": ["positive", 0.680425], "bbc-news": ["negative", 0.896553], "cnn": ["positive", 0.939488], "axios": ["positive", 0.733943]}, 1, 1669433495.647129], ["Joe Biden", {"No Source Found": ["http://127.0.0.1:5000", "No article found", "rateLimited", "centrist", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Question_mark_%28black%29.svg/1200px-Question_mark_%28black%29.svg.png"]}, {"No Source Found": ["negative", 0.5]}, 1, 1629323503.666233], ["topic", {"techcrunch": ["https://techcrunch.com/2022/11/18/vcs-foodtech-savrpak-justo/", "VCs dish on why food tech investment was so light in Q3, while SAVRpak bags freshness deal with Jüsto", " “Ultimately, the sustainability story that drives the need for food innovation is only going to be more important in the world’s fight against climate change, as we cannot reach our greenhouse gas emission reduction goals without transitioning the food system away from animal agriculture, one of the highest polluting and most destructive industries in the world.”\n\nWeekly news\n\nSAVRpak said it is working with Mexico’s first online supermarket, Jüsto Partners, for it to be the first to market with SAVRpak’s plant-based thermodynamic pouch designed to remove 50% of condensation, which often leads to mold and early spoilage, and keep new condensation from forming, thus extending the shelf-life of produce, like strawberries, by up to three times, Scott Nelson, president of SAVRpak, said via email. “Consumers will start to see SAVRpak popping up in individual packaging of their favorite berries and greens at select supermarkets starting this spring, and in January, we’ll be announcing our consumer retail product with one of the largest big box retailers in the U.S.”\n\nOther big news this week came from Upside Foods, which announced, alongside the U.S. Food and Drug Administration, that its conclusions on if its cultivated chicken product was safe to eat warranted “no further questions.” This represents a milestone for the cultivated meat industry and prompted Upside founder and CEO Uma Valeti to say, “Cultivated meat has never been closer to the U.S. market than it is today. This historic announcement from the FDA is the foundational step in the regulatory process.”\n\nFrom Paul Sawers: “Meatable, a VC-backed Dutch company that recently debuted its first product lineup in the form of synthetic sausages, today announced a partnership with Singaporean food startup Love Handle to create what it touts as ‘the world’s first hybrid meat innovation center.’”\n\nIsraeli cultivated meat technology company Future Meat Technologies changed its name to Believer Meats, saying that its rebranding represents “a big step in the broader strategic transformation of Future Meat into a technology-rooted food company as Believer prepares for its product launch.” The company’s technology is pending U.S. regulatory approval and expects to break ground on a commercial-scale production facility in the United States by the end of the year. Beyond Meat unveils new plant-based chicken products\n\nDaring Foods launches on menu as first ever plant-based chicken offering at Bluestone Lane\n\nWild Earth announces the world’s first cell-based meat developed for dogs\n\nFunding and other food stories as seen on TechCrunch:\n\nGradient backs Butter’s operating system for food distribution businesses\n\nVow’s first cultured meat product close to Singapore unveiling after $49.2M Series A\n\nPerfekto bags $1.1M to find homes for imperfect produce in Mexico\n\nAnd elsewhere:\n\nProper Good, a home-delivered food company, closed on $3.5 million in seed funding\n\nFreight Farms raises $17.5M Series B3 to address access and sustainability in the food system through container farming\n\nJust a reminder, us TechCrunchers love scoops.", "centrist", "https://techcrunch.com/wp-content/uploads/2019/09/GettyImages-1148641847.jpg?resize=1200,808"], "wired": ["https://www.wired.com/story/twitter-alternative-discord-servers/", "Avoiding Twitter? Try These Interest-Based Discord Servers", " For anyone who’s retiring those Twitter fingers and feels open to trying something different, Discord is another great choice. Here are a few Discord servers worth checking out:\n\nYes, a lot of the communities revolve around video games, but that’s not the complete picture.", "centrist", "https://media.wired.com/photos/6378370bb2d6dcde3761542d/191:100/w_1280,c_limit/Hot-To-Find-Discord-Servers-Gear-1398472119.jpg"]}, {"techcrunch": ["positive", 0.917158], "wired": ["positive", 0.969686]}, 9, 1669433554.06446], ["musk", {"fox-news": ["https://www.foxnews.com/media/media-outlets-lament-musk-reinstating-banned-twitter-accounts-superspreaders-hate", "Media outlets lament Musk reinstating banned Twitter accounts: 'Superspreaders of hate'", " Axios, The Washington Post and The Associated Press reported that Musk granting \"amnesty\" for these Twitter accounts will \"spur a rise in harassment\" and \"hate speech\" on the platform and noted that the Twitter poll Musk used to justify his decision might have been manipulated, leading to an unfair result. After Musk’s latest poll, Washington Post left-wing tech columnist Taylor Lorenz channeled the rage and frustration of \"activists and online trust and safety experts\" over the news in a piece headlined, \"'Opening the gates of hell': Musk says he will revive banned accounts.\" On Thursday, the outlet reported Musk’s pro-amnesty decision, and noted the negative implications, stating, \"Why it matters: Online monitoring groups have reported a rise in racism, anti-Semitism and other hate speech on Twitter since free speech advocate Musk completed his $44 billion acquisition of the social media company last month, though the billionaire said Thursday it has declined.\" ELON MUSK MOCKS MEDIA CLAIMING NEUTRALITY AFTER TAKEOVER FREAKOUT: ‘WILL HAVE TO FACT-CHECK THAT’\n\nThe piece quoted several individuals alarmed at the decision, including Center for Countering Digital Hate CEO Imran Ahmed, who said, \"Superspreaders of hate, abuse and harassment will be the only people to benefit from this latest decision by Twitter.\" The piece provided its \"big picture\" perspective on the story, writing, \"Groups like the Center for Countering Digital Hate have reported a rise in racism on Twitter since Musk took over, including research indicating it failed to act on ‘99% of racist abuse’ of soccer players in the leadup to the men's World Cup in Qatar.\" And an Associated Press report fixated on the negatives of Musk’s amnesty, opening with the statement, \"New Twitter owner Elon Musk said Thursday that he is granting ‘amnesty’ for suspended accounts, which online safety experts predict will spur a rise in harassment, hate speech and misinformation.\" It then mentioned the potential rise in hate speech due to such decisions, stating, \"In the month since Musk took over Twitter, groups that monitor the platform for racist, anti-Semitic and other toxic speech say it’s been on the rise on the world’s de facto public square. CLICK HERE TO GET THE FOX NEWS APP\n\nThe report specifically blamed this crisis on Musk laying off many Twitter workers since he started, stating, \"The uptick in harmful content is in large part due to the disorder following Musk’s decision to lay off half the company’s 7,500-person workforce, fire top executives, and then institute a series of ultimatums that prompted hundreds more to quit.\"", "conservative", "https://static.foxnews.com/foxnews.com/content/uploads/2022/05/Musk-Twitter-Backfire-2.png"], "cnn": ["https://www.cnn.com/2022/11/25/tech/musk-verified-twitter-account-plans-colors/index.html", "Musk says new color-coded verified system at Twitter will roll out in a week", "New York CNN Business —\n\nElon Musk is ready to try his troubled new verification system for Twitter once again. This time, in color.\n\nThe CEO of Twitter announced - via a tweet of course - that Twitter will roll out its tentatively launching Verified on Friday next week. There’s changes to the program that he apparently hopes will stop people from paying the $8 a month fee just to impersonate celebrities or companies.\n\n“All verified accounts will be manually authenticated before check activates,” he tweeted. “Painful, but necessary.”\n\nMusk didn’t specify what will be done manually, or how much that might delay the verification process, especially in light of deep staff cuts and departures at Twitter since he took control a month ago.\n\nThe new system will have a gold check for companies, gray check for government entities and blue for individuals, whether or not they are celebrities.\n\nMusk’s earlier attempt to launch paid verified accounts sparked a flood of spoof accounts from people impersonating companies and famous Twitter users, including Musk himself, and caused Musk to announce another delay in the new system.\n\nHis plans for charging for verified accounts has been put on hold several times. Charging users for a verified account is a key to Musk’s plan to make Twitter less dependent upon advertising revenue, which has accounted for more than 90% of its revenue to date, and stem the loss of cash as advertisers pull back from the social media platform.\n\n“All verified individual humans will have same blue check, as boundary of what constitutes ‘notable’ is otherwise too subjective,” Musk tweeted. “Individuals can have secondary tiny logo showing they belong to an org if verified as such by that org. Longer explanation next week.”\n\nAmong the information missing from his tweets is details on pricing, and when the blue checks will go away for those who do not want to pay and had been verified pre-Musk. Twitter, which is believed to have fired most or all of its public relations staff since Musk took over, did not respond to a request for details. Musk’s other companies, Tesla (TSLA) and SpaceX, have long not responded to requests for comment from most media outlets.\n\nThe tweet chain on which Musk made the announcement started with Musk replying to a tweet from former US Labor Secretary Robert Reich, a liberal economist, who was criticizing Musk’s mass layoffs since taking over Twitter.\n\n“Here’s what Elon Musk fails to understand: Much of a corporations’ value lies in their workers — their knowledge, skills, and ideas,” Reich tweeted. “When he fired half of Twitter’s workforce and drove off even more, he wasn’t ‘cutting costs.’ He was actively destroying what he bought.”\n\n“Interesting … now pay $8,” Musk responded to Reich’s tweet.", "liberal", "https://media.cnn.com/api/v1/images/stellar/prod/221026143441-file-elon-musk-0903-restricted.jpg?c=16x9&q=w_800,c_fill"], "abc-news": ["https://abcnews.go.com/Business/wireStory/musk-plans-relaunch-twitter-premium-service-93954537", "Musk plans to relaunch Twitter premium service, again", " Elon Musk says that Twitter plans to relaunch its premium service that will offer different colored check marks to accounts next week\n\nLONDON -- Elon Musk said Friday that plans to relaunch its premium service that will offer different colored check marks to accounts next week, in a fresh move to revamp the service after a previous attempt backfired. It's the latest change to the social media platform that the billionaire Tesla CEO bought last month for $44 billion, coming a day after Musk said he would grant “amnesty” for suspended accounts and causing yet more uncertainty for users. On Thursday, Musk said he would grant “amnesty” for suspended accounts, following the results of an online poll he conducted on whether accounts that have not “broken the law or engaged in egregious spam” should be reinstated. Vox Populi, Vox Dei,” Musk tweeted Thursday using a Latin phrase meaning “the voice of the people, the voice of God.”\n\nThe move is likely to put the company on a crash course with European regulators seeking to clamp down on harmful online content with tough new rules, which helped cement Europe’s reputation as the global leader in efforts to rein in the power of social media companies and other digital platforms. Zach Meyers, senior research fellow at the Centre for European Reform think tank, said giving blanket amnesty based on an online poll is an “arbitrary approach\" that's “hard to reconcile with the Digital Services Act,\" a new EU law that will start applying to the biggest online platforms by mid-2023. Recent layoffs at Twitter and results of the EU's review “are a source of concern,” the bloc's commissioner for justice, Didier Reynders tweeted Thursday evening after meeting with Twitter executives at the company's European headquarters in Dublin. In the meeting, Reynders said he “underlined that we expect Twitter to deliver on their voluntary commitments and comply with EU rules,” including the Digital Services Act and the bloc's strict privacy regulations known as General Data Protection Regulation, or GDPR.", "liberal", "https://s.abcnews.com/images/Politics/WireAP_41d556e78d7c442392778e64d46476ff_16x9_992.jpg"], "breitbart-news": ["https://www.breitbart.com/tech/2022/11/25/elon-musk-claims-he-will-grant-amnesty-to-blacklisted-twitter-accounts/", "Elon Musk Claims He Will Grant ‘Amnesty’ to Blacklisted Twitter Accounts", " Musk says the amnesty will be for users that had not “broken the law or engaged in egregious spam,” which may mean that many conservatives unfairly banned will be restored to the platform. AP News reports that Elon Musk announced on Thursday that he will be granting “amnesty” for blacklisted accounts on the platform, leading many leftists to worry about a rise in “hate speech” and “misinformation.”\n\nMusk’s announcement comes shortly after he launched a poll asking Twitter users to vote on reinstatements for accounts that have not “broken the law or engaged in egregious spam.” 72 percent of those that answered the poll voted yes. On October 28, Musk tweeted that no suspended accounts would be reinstated to the platform until Twitter had formed a “content moderation council” with diverse viewpoints to consider each case.", "conservative", "https://media.breitbart.com/media/2022/05/Elon-Musk-Twitter-640x480-5-3-1-640x335.jpg"], "bbc-news": ["https://www.bbc.co.uk/news/business-63752208", "Elon Musk says Twitter will offer 'amnesty' to suspended accounts", "He has since laid off half of the firm's 7,500-strong workforce, and hundreds more staff are believed to have left, following an email saying that long hours and \"hardcore\" work would be required of those who remained.", "center", "https://ichef.bbci.co.uk/news/1024/branded_news/6FF1/production/_127775682_musk-index-getty.jpg"], "axios": ["https://www.axios.com/2022/11/22/trump-truth-social-parler-musk-twitter", "Elon Musk's Twitter leaves Truth Social and Parler in limbo", "A key shareholder vote on Tuesday served as a lifeline for the financial future of Donald Trump's Twitter alternative, Truth Social, while the status of Ye's plans to acquire Parler remains cloudy.\n\nWhy it matters: Elon Musk's reinstatement of both Trump and Ye's accounts is creating major growth challenges for both Truth Social and Parler.\n\nDriving the news: Shareholders in Digital World Acquisition Corp., the blank check company trying to take Truth Social public, approved a merger extension until next September, after several vote postponements.\n\nThis does not, however, guarantee that the deal will close, particularly as it remains the subject of multiple government investigations. It also doesn't provide any upfront cash to Truth Social, which previously said its financial runway only extends until next April.\n\nBe smart: Musk's populist takeover of Twitter is likely to pull momentum from \"free speech\" Twitter alternatives.\n\nAfter joining Parler a month ago, Ye has fewer than 60,000 followers on the platform.\n\nSources say that odds are growing longer that Ye's takeover of Parler will close by year-end, as originally anticipated, and the company didn't respond to a request for comment.\n\nDonald Trump has a little over 5 million followers on Truth Social, but that pales in comparison to the 88 million followers he has on Twitter.\n\nOf note, it's unclear what impact Trump's 2024 presidential run would have on Truth Social.", "center", "https://images.axios.com/AkGNrbMBs_Nr_iO2vf3miUQylUI=/0x114:4331x2550/1366x768/2022/11/22/1669137168899.jpg"], "msnbc": ["https://www.msnbc.com/opinion/msnbc-opinion/elon-musk-trump-twitter-account-republican-rcna57861", "Elon Musk's revival of Trump's Twitter account shows his political mission", " Twitter CEO Elon Musk over the weekend reactivated Donald Trump’s previously banned Twitter account, triggering big questions about how the move might reshape Trump's 2024 appeal and how it could affect extremist activity on the platform. Consider Musk's botched rollout of Twitter Blue, which he initially pitched as a way for Twitter to build revenue by charging users $8 a month to unlock, among other things, a blue verification badge typically reserved for public figures like government officials, journalists and celebrities. Of course Musk is permitted to express his views, but his instant partisan intervention also raised questions of whether he'd exploit his power over Twitter's algorithms and policies to favor political movements that he sympathizes with or finds more personally profitable.", "liberal", "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-11/221121-elon-musk-twitter-right-wing-activism-an-730b35.jpg"]}, {"fox-news": ["negative", 0.865993], "cnn": ["negative", 0.771642], "abc-news": ["negative", 0.706683], "breitbart-news": ["negative", 0.83233], "bbc-news": ["negative", 0.714231], "axios": ["positive", 0.737663], "msnbc": ["negative", 0.58287]}, 1, 1669433592.118954]]