[["Google", {"ars-technica": ["https://arstechnica.com/gadgets/2021/07/google-maps-massively-expands-its-mass-transit-crowd-reporting-service/", "Google Maps massively expands its mass transit crowd-reporting service", "Today, Google announced a major expansion of its ability to warn users of crowded mass transit ahead of time. The feature originally launched in June 2019 and covered roughly 200 cities globally, using user-reported data similar to Waze to discover and predict overcrowded trains and buses. Google is expanding that 200-city initial rollout to (eventually) over 10,000 transit agencies in 100 countries, according to today's announcement.\n\nUnsurprisingly, Google Maps' mass transit predictions don't just rely on direct user-reported data. They utilize AI models trained on that data.\n\n\"We apply world-class anonymization technology and differential privacy techniques to Location History Data to make sure your data remains private and secure,\" the announcement declares—although we must point out that attempts to anonymize location data frequently fail.\n\nGoogle\n\nGoogle\n\nGoogle\n\nGoogle says its mass transit crowd reporting lets users know whether their transit line is likely to \"have lots of open seats, hit full capacity, or be anywhere or in between,\" letting users make a more informed decision about whether to \"hop on board or wait for another train.\" In New York and Sydney, the program is piloting even deeper information, offering live crowdedness information \"right down to the transit car level.\" Today's announcement also notes that across the USA, mass transit is less crowded after morning rush hour and prior to evening rush hour—information unlikely to surprise anyone who uses mass transit regularly.\n\nAdvertisement\n\nMaps is also upgrading its Timeline feature to include mass transit travel history, letting users know how much time they've spent and distance they've traveled via mass transit, walking, driving, and more. If you don't like that feature—or don't trust Google's \"world-class anonymization technology\"—you can disable your Android device's Location History entirely. (Disabling Location History will have a significant impact on ride-share, weather, and mapping apps, among others—and it may render some entirely unusable.)", "centrist", "https://cdn.arstechnica.net/wp-content/uploads/2021/07/GettyImages-1228418167-760x380.jpg"], "techradar": ["https://www.techradar.com/news/microsofts-new-collaboration-tool-wants-to-replace-google-workspace-for-good", "Microsoft's new collaboration tool wants to replace Google Workspace for good", " Here are the best video conferencing services around\n\nThese are the best productivity tools on the market\n\nAlso check out our roundup of the best free office software\n\nProject Moca\n\nFollowing a successful trial and beta period, Microsoft has now confirmed that Project Moca will be rolling out to users in July 2021 as part of the new board view on Outlook.", "centrist", "https://cdn.mos.cms.futurecdn.net/iUgP53ugxxnPUSpVG4thcn-1200-80.jpg"], "engadget": ["https://www.engadget.com/google-maps-features-post-lockdown-life-100004041.html", "Google Maps' new features are designed to help you navigate life after lockdown", "Google has introduced a few Maps features that could help you ease back into the world, now that COVID-19 vaccines are available. One of the most useful changes to Maps is the expansion of transit crowdedness predictions to over 10,000 cities in 100 countries.\n\nCompanies are expecting their staff to get back to the office in the near future, and crowdedness prediction can let you know if the train or bus line you're waiting for has a lot of open seats, or if it's already crowded. That way, you can decide whether to hop on or wait for the next one in hopes that it isn't as jam-packed. Maps can make predictions by combining AI tech with contributions from people using Google Maps, along with historical location trends.\n\nGoogle\n\nIf you're in New York and Sydney, you can even see a train's level of crowdedness down to transit car level in real time. Maps will mark the least crowded cars, so you can line up for one of them, thanks to data from transport agencies in the areas. It's still a pilot at the moment, but Google says the feature will be available in more cities soon.\n\nIn addition, the tech giant has launched a new Timeline Insights tab for the Maps app. So long as you're on Android and you have Location History switched on, you'll be able to view \"monthly trends about how you’re navigating the world.\" For instance, that's where you can see how much time you spend at different places, such as shops or airports, and the distance and time for each mode of transportation you've taken. The tech giant says it developed the feature after users told the company that they want \"to be more intentional about how they spend their time\" after living through the pandemic.\n\nFinally, Trips in the Timeline tab is now available to everyone on Android, so you can relive the vacations you've had in the past. In case your favorite travel destination still isn't welcoming tourists, you can go to the section and virtually visit hotels, restaurants and other places you've previously enjoyed.", "centrist", "https://s.yimg.com/os/creatr-images/2020-03/7c707a70-6914-11ea-bbc2-8ad1adea04d7"]}, {"ars-technica": ["positive", 0.583144], "techradar": ["positive", 0.898604], "engadget": ["positive", 0.886225]}, 1, 1626914493.4904718], ["pelosi committee", {"breitbart-news": ["https://www.breitbart.com/clips/2021/07/25/pelosi-my-plan-is-to-appoint-rep-kinzinger-to-the-january-6-select-committee/", "Pelosi: ‘My Plan’ Is to Appoint Rep. Kinzinger to the January 6 Select Committee", " House Speaker Nancy Pelosi (D-CA) said Sunday on ABC’s “This Week” that she planned to appoint Rep. Adam Kinzinger (R-IL) to the House Select Committee investigating the Capitol riots. I’m very proud of the members of the committee, and I’m certain they will accomplish that goal.”\n\nAnchor George Stephanopoulos said, “Will you be appointing more Republicans to the committee like Congressman Adam Kinzinger?”\n\nPelosi said, “That would be my plan.”\n\nStephanopoulos said, “When will that be announced?”\n\nPelosi said, “Perhaps after I speak to Adam Kinzinger.”\n\nShe added, “You could say that’s the direction I would be going.", "conservative", "https://media.breitbart.com/media/2021/07/Pelosi-1-640x335.jpeg"], "axios": ["https://www.axios.com/pelosi-appoint-kinzinger-jan-6-committee-ca1f4955-5c39-4459-b630-83c086562975.html", "Pelosi appoints GOP Rep. Kinzinger to Jan. 6 committee", " What they're saying: \"Speaker Pelosi’s rejection of the Republican nominees to serve on the committee and self-appointment of members who share her pre-conceived narrative will not yield a serious investigation,\" McCarthy said in a statement on Sunday.", "center", "https://images.axios.com/eDtdOb3ThwD1NBJfAILF1Ei5cmM=/22x0:1762x979/1366x768/2021/07/25/1627221066365.png"], "abc-news": ["https://abcnews.go.com/Politics/pelosi-confident-bipartisan-committee-plans-add-republicans/story?id=79036536", "Pelosi confident in bipartisan Jan. 6 committee, plans to add more Republicans", " House Speaker Nancy Pelosi said she is confident in the bipartisan select committee to investigate the Jan. 6 attack on the U.S. Capitol and, despite House Minority Leader Kevin McCarthy pulling his recommendations for the panel, is moving forward with the addition of more Republicans with one accepting her invitation on Sunday afternoon. Despite McCarthy, R-Calif., slamming Pelosi last week for conducting \"a sham process\" after she rejected two of the five Republican members he recommended for the select committee, Pelosi said she plans to appoint more Republicans to the panel. McCarthy had threatened that Republicans \"will not participate\" if Pelosi did not accept all five of his recommendations, but Sunday afternoon Republican Rep. Adam Kinzinger of Illinois announced he'd accepted Pelosi's invitation to participate in the commission. While not mentioning Kinzinger by name, McCarthy said in a statement later Sunday afternoon that Pelosi's selection of members \"who share her pre-conceived narrative will not yield a serious investigation.\" \"Speaker Pelosi's departure from this serious-minded approach has destroyed the select committee's credibility,\" McCarthy said in the statement. Pelosi also scoffed at a letter the conservative House Freedom Caucus, for which Jordan is a member, sent to McCarthy on Friday asking him to try to remove Pelosi from her powerful position, writing, \"Speaker Pelosi's tenure is destroying the House of Representatives and our ability to faithfully represent the people we are here to serve.\" Stephanopoulos asked Pelosi if she is worried that her rejection of two of McCarthy's picks for the select committee would prompt Republicans to take similar action if they take back control of the House, she said, \"no.\"", "liberal", "https://s.abcnews.com/images/Politics/this-week-nancy-pelosi-01-gty-llr-210724_1627151283623_hpMain_16x9_992.jpg"], "fox-news": ["https://radio.foxnews.com/2021/07/23/andrew-mccarthy-reacts-to-speaker-pelosi-rejecting-gop-picks-for-jan-6th-committee/", "Andrew McCarthy Reacts To Speaker Pelosi Rejecting GOP Picks For Jan. 6th Committee", " \n\nListen To The Full Interview Below:\n\n\n\nAndrew McCarthy, Fox News Contributor, and former Assistant U.S. Attorney For Southern District Of NY joined Fox News Radio’s Guy Benson Show to react to Speaker Pelosi rejecting GOP picks for the January 6th committee. McCarthy said,\n\n“Well, I was against the commission guy because I think Congress you know, I’m really kind of tired of our new idea of representative democracy being that we elect people to Congress so that they can go on television and tell everyone how bad everything is while they delegate all their authorities to commissions and courts and bureaucracies.", "conservative", "https://radio.foxnews.com/wp-content/uploads/2020/06/Andrew-McCarthy.jpg"], "the-washington-post": ["https://www.washingtonpost.com/opinions/2021/07/21/pelosi-jan-6-committee-mccarthy-jordan/", "Opinion : Pelosi calls the GOP’s bluff on the Jan. 6 committee", " Will Republicans denounce any findings offered by a select committee with only Pelosi appointees — including, by the way, GOP Rep. Liz Cheney of Wyoming?", "liberal", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FOPEYOHKK4I6XIV2HPRR2NESLA.jpg&w=1440"], "cnn": ["https://www.cnn.com/2021/07/21/politics/nancy-pelosi-1-6-commission-jim-jordan-jim-banks/index.html", "Nancy Pelosi just doomed the already tiny chances of the 1/6 committee actually mattering", " However, in her statement on Wednesday announcing her decision to keep Jordan and Banks off the committee, she cited \"concern about statements made and actions taken by these Members,\" which would seem to suggest that their past views on January 6 -- including past votes, like when they both objected to the Electoral College votes in Pennsylvania and Arizona -- very much played a role. No matter Pelosi's reasoning, her decision to reject Jordan and Banks, the two most high-profile Republicans put forward by McCarthy, dooms even the possibility of the committee being perceived as bipartisan or its eventual findings being seen as independent. Both men would have, at every turn, sought to turn the tables on Democrats -- using the platform provided by the committee to push debunked claims about Antifa's involvement in the Capitol riot, questioning Democratic leadership's readiness for just such an attack and trying to broaden the committee's mandate to cover the Black Lives Matter protests of summer 2020.", "liberal", "https://cdn.cnn.com/cnnnext/dam/assets/210520140051-pelosi-0520-super-tease.jpg"], "the-hill": ["https://thehill.com/homenews/house/564122-pelosi-rejects-jordan-banks-for-jan-6-committee", "Pelosi rejects Jordan, Banks for Jan. 6 committee", " — for the Jan. 6 select committee.Both GOP lawmakers are staunch allies of former, and both had voted in January against certifying's election victory.In a statement, Pelosi said Democrats in her caucus had raised specific objections to Jordan and Banks \"and the impact their appointments may have on the integrity of the investigation. \"“With respect for the integrity of the investigation, with an insistence on the truth and with concern about statements made and actions taken by these Members, I must reject the recommendations of Representatives Banks and Jordan to the Select Committee,\" she said.She did not specify what statements and actions she was referring to.Jordan and Banks were part of a group of five GOP lawmakers nominated by House Minority Leader(R-Calif.) to serve on the 13-member select committee. Instead, he's yanked all of his picks from the panel.The rejections of Jordan and Banks underscore the lingering animosity surrounding the Jan. 6 attack on the Capitol, where a violent mob of Trump supporters attempted to block Congress from formalizing the results of the 2020 presidential contest.Leading up to the attack, a majority of House Republicans had signed on to a lawsuit challenging Biden's victory, essentially endorsing Trump's false claims that the election was \"stolen,\" or tainted by rampant voter fraud. \"But Jordan, the ranking member of the Judiciary Committee, and Banks, the head of the Republican Study Committee, have emerged as some of the most vocal Trump defenders in the wake of the insurrection, infuriating Democrats of all stripes who consider Trump's allies to be complicit in the attack.Both Jordan and Banks have said in recent days that they were hoping to use their positions on the select committee to investigate what Pelosi knew about the security threat ahead of the violence.", "center", "https://thehill.com/sites/default/files/article_images/jordanpelosibanks.jpg"]}, {"breitbart-news": ["positive", 0.548719], "axios": ["negative", 0.687238], "abc-news": ["negative", 0.717488], "fox-news": ["negative", 0.921199], "the-washington-post": ["negative", 0.709639], "cnn": ["negative", 0.806836], "the-hill": ["negative", 0.681528]}, 1, 1627405466.131364]]