{"CNN": ["Rebels in Tigray reject calls for ceasefire after Ethiopian government forces withdraw from regional capital ", "(CNN)Rebel forces in the war-torn Ethiopian region of Tigray have rejected a ceasefire offer from the central government, raising fears of further violence a day after the fighters retook the regiona… [+6942 chars]", "https://www.cnn.com/2021/06/29/africa/tigray-ethiopia-ceasefire-intl/index.html"], "New York Times": ["As the U.S. Pulls Out of Afghanistan, Kabul’s Airport Is a Final Stand ", "Security at the airport in whatever form or fashion it takes will be important, not only for the United States, but for any other nation that likewise plans to maintain a diplomatic presence in Kabul… [+1461 chars]", "https://www.nytimes.com/2021/06/29/us/politics/us-afghanistan-withdrawal-airport.html"], "The Guardian": ["Delta variant: LA recommends indoor masks regardless of vaccination status", "Health officials in Los Angeles county now strongly recommend that people wear masks indoors in public places, regardless of their vaccination status, to prevent the spread of the highly transmissibl… [+1967 chars]", "https://amp.theguardian.com/us-news/2021/jun/29/delta-variant-los-angeles-indoor-masks-vaccine-status"], "CNET": ["Venus can't sustain life in the clouds, but Jupiter has potential", "Venus clouds have captivated Earthlings for decades. They form a dazzling mirror that obscures the planet's surface and, in the 1950s, one Israeli scholar even speculated the clouds may hide a world … [+11343 chars]", "https://www.cnet.com/features/venus-cant-sustain-life-in-the-clouds-but-jupiter-has-potential/"], "Vox": ["How Nancy Pelosi hopes to back Joe Manchin into a corner on infrastructure ", "President Joe Biden and a bipartisan group of 10 senators were all smiles Thursday when they announced theyd struck a deal on a framework for an infrastructure bill. \r\nBut since then, leaders and ide… [+5700 chars]", "https://www.vox.com/2021/6/29/22554042/pelosi-manchin-infrastructure-deal-reconciliation"], "Fox Business": ["Rolling blackouts for parts of US Northwest amid heat wave", "The unprecedented Northwest U.S. heat wave that slammed Seattle and Portland, Ore., moved inland Tuesday — prompting an electrical utility in Spokane, Wash., to warn that people will face more rollin… [+4587 chars]", "https://www.foxbusiness.com/economy/rolling-blackouts-northwest-heat-wave"], "Daily Beast": ["Indicting the Trump Organization Could Be Just the Start", "Prosecutors appear to be poised to indict the Trump Organization. And that could mean significant pain ahead for the former president, his family, and their business associates.\r\nAccording to media r… [+4901 chars]", "https://www.thedailybeast.com/indicting-the-trump-organization-could-be-just-the-start-for-the-manhattan-da"], "HuffPost": ["Astronomers See Black Hole Swallow Neutron Star For First Time Ever", "Talk about a heavy snack. For the first time, astronomers have witnessed a black hole swallowing a neutron star, the most dense object in the universe all in a split-second gulp.\r\nTen days later they… [+2402 chars]", "https://www.huffpost.com/entry/black-hole-neutron-star-swallow_n_60db4755e4b02f1aed4e2f30"], "Gizmodo.com": ["Everything You Need to Know About Windows 11's Confusing PC Requirements ", "BetweenTPMs, CPUs, and UEFIs, the system requirements for upgrading to Windows 11 havent been the easiest to figure out. Microsoft changed them only hours after pushing out the first Insider Preview … [+5212 chars]", "https://gizmodo.com/everything-you-need-to-know-about-windows-11s-confusing-1847192504"], "Yahoo Entertainment": ["Windfall of big bank dividends point to more shareholder return ", "The large banks are raining dividends on their shareholders after getting a clean bill of health from the Federal Reserve. And bank analysts say the windfall of capital returns is only just beginning… [+1951 chars]", "https://finance.yahoo.com/news/windfall-of-big-bank-dividends-point-to-more-shareholder-return-160951895.html"], "Google News": ["Shea Weber Gets Away With Slash On Nikita Kucherov Late In Game 1 ", null, "https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9Sm85UWtQNE9QNTTSAQA?oc=5"], "Cyclingnews.com": ["Mark Cavendish: I didn't think I'd get to come back to the Tour de France", "Mark Cavendish rolled back the years to take victory on stage 4 of the Tour de France in Fougères, taking his first stage win at the race since 2016.\r\nThe Deceuninck-QuickStep sprinter beat Nacer Bou… [+2530 chars]", "https://www.cyclingnews.com/news/mark-cavendish-i-didnt-think-id-get-to-come-back-to-tour-de-france/"], "Polygon": ["Xbox Games with Gold July 2021 free games announced", "Xbox Live Gold and Xbox Game Pass Ultimate subscribers get four free games in July with Microsofts Xbox Games with Gold program or maybe they get 34 free games, if you count all the retro arcade hits… [+1145 chars]", "https://www.polygon.com/22555691/xbox-games-with-gold-july-2021-free-games-list"], "NBC News": ["Christina Aguilera tweets support for Britney Spears after conservatorship testimony", "Christina Aguilera posted a series of tweets in support of her longtime friend and fellow pop singer Britney Spears, who gave rare public testimony last week asking to end her conservatorship.\r\n\"Thes… [+2337 chars]", "https://www.nbcnews.com/pop-culture/music/christina-aguilera-tweets-support-britney-spears-after-conservatorship-testimony-n1272588"]}