{"CNN": ["Bidens to travel to Florida in wake of building collapse - CNN ", "(CNN)President Joe Biden and first lady Jill Biden will travel to Surfside, Florida, on Thursday after a residential building partially collapsed in the coastal city last week, the White House announ… [+3663 chars]", "https://www.cnn.com/2021/06/29/politics/president-florida-building-collapse/index.html"], "WRAL.com": ["Venomous cobra loose in north Raleigh neighborhood - WRAL.com", "By Kasey Cunningham &amp; Matt Talhelm, WRAL reporters &amp; Heather Leah, multiplatform producer\r\nRaleigh, N.C. — A venomous cobra is on the loose in Raleigh.\r\nThe zebra cobra was last seen on Sandr… [+2460 chars]", "https://www.wral.com/deadly-venomous-cobra-loose-in-raleigh-neighborhood/19748492/"], "The Verge": ["Windows 11 will leave millions of PCs behind, and Microsoft is struggling to explain why - The Verge", "Microsoft has had six years to prepare for the launch of Windows 11, but the company is still struggling to explain its new hardware requirements. Windows 11 will officially support Intel 8th Gen Cof… [+7645 chars]", "https://www.theverge.com/2021/6/29/22555371/microsoft-windows-11-cpu-support-hardware-requirements-tpm-response"], "NBC News": ["South African court orders ex-president to jail for contempt - NBC News", "JOHANNESBURG South Africas former President Jacob Zuma has been found guilty of contempt of court and sentenced to 15 months in prison for defying a court order to appear before an inquiry probing wi… [+3145 chars]", "https://www.nbcnews.com/news/world/update-south-african-court-orders-ex-president-jail-contempt-n1272585"], "Kotaku": ["RIP The Xbox Game Pass Joke - Kotaku", "Fact: If you cover games, someone will call you a shill at some point. Over the weekend, a contingent of games-focused writers and influencers pushed back on that claim by plastering Twitter with ton… [+3450 chars]", "https://kotaku.com/rip-the-xbox-game-pass-joke-1847193482"], "Ars Technica": ["SpaceX to launch second rideshare, pressuring small-launch industry - Ars Technica", "47 with 40 posters participating\r\n<ul><li>\r\n SpaceX's second Transporter mission is scheduled to lift off at 2:56 pm EDT, carrying 88 spacecraft on a southerly trajectory from Cape Canaveral Space Fo… [+2865 chars]", "https://arstechnica.com/science/2021/06/spacex-to-launch-second-rideshare-pressuring-small-launch-industry/"], "New York Times": ["A Black Hole Feasted on a Neutron Star. 10 Days Later, It Happened Again. - The New York Times", "Alessandra Buonanno, director at the Max Planck Institute for Gravitational Physics in Potsdam, Germany, and a member of the LIGO science team, said the collisions generally fit with what they had ex… [+1322 chars]", "https://www.nytimes.com/2021/06/29/science/black-holes.html"], "HuffPost": ["Ed Sheeran Reveals The NSFW Prank He Keeps Pulling On Courteney Cox - HuffPost", "BDSM bondage hoods keep showing up at Courteney Coxs home, and pop star Ed Sheeran said hes to blame.\r\nOn Mondays episode of The Late Late Show, the British singer-songwriter remembered first prankin… [+1113 chars]", "https://www.huffpost.com/entry/ed-sheeran-courteney-cox-prank_n_60db1dfde4b02f1aed4db81f"], "CBS Sports": ["Clippers-Suns: Paul George says he's been criticized too much in his NBA playoff career; here's why he's right - CBS Sports", "Paul George just played perhaps the best game of his career as the Clippers staved off elimination by defeating the Phoenix Suns 116-102 in Game 5 of the Western Conference finals on Monday. In 41 mi… [+7288 chars]", "https://www.cbssports.com/nba/news/clippers-suns-paul-george-says-hes-been-criticized-too-much-in-his-nba-playoff-career-heres-why-hes-right/"], "Detroit Free Press": ["Henry Ford Health System to require workers to get COVID-19 vaccine - Detroit Free Press", "Henry Ford Health System is the first in Michigan to announce it is requiring employees, students, volunteers and contractors to get a COVID-19 vaccine. \r\n“We acknowledge the magnitude of this decisi… [+5540 chars]", "https://www.freep.com/story/news/health/2021/06/29/henry-ford-health-require-covid-19-vaccine-workers/7794364002/"], "The Hill": ["Manchin says he's on board with Democratic-only infrastructure bill | TheHill - The Hill", "Sen. Joe ManchinJoe ManchinJudge temporarily halts West Virginia needle exchange law amid spike in HIVWhy keeping the filibuster intact doesn't really promote bipartisanshipObama says Senate will vot… [+3946 chars]", "https://thehill.com/homenews/senate/560686-manchin-says-hes-on-board-with-democratic-only-infrastructure-bill"], "TMZ": ["Angels' Dylan Bundy Throws Up All Over Yankee Stadium Mound, Pulled From Game - TMZ", "Incredibly gross scene at Yankee Stadium on Monday ... Angels pitcher Dylan Bundy was so bothered by the New York heat, he straight-up blew chunks all over the mound!!\r\nIt all went down in Los Angele… [+1290 chars]", "https://www.tmz.com/2021/06/29/dylan-bundy-angels-yankees-throw-up-mound-pitcher-vomit-mlb/"], "The Guardian": ["The ‘heat dome’ explained: why the Pacific north-west is facing record temperatures - The Guardian", "US weatherPortland and Seattle are among cities grappling with 100F-plus days in a typically moderate climate\r\nTue 29 Jun 2021 06.00 BST\r\nThe Pacific north-west, known for its moderate climate, is ex… [+5783 chars]", "https://amp.theguardian.com/us-news/2021/jun/28/portland-seattle-heatwave-heat-dome-temperatures"], "Google News": ["Lightning Surge To Convincing Win Over Canadiens In Game 1 Of Cup Final | Morning Glory - SPORTSNET", null, "https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9QzRUdVloYlZIdlnSAQA?oc=5"], "Deadline": ["‘Good Omens’ Renewed For Season 2 At Amazon - Deadline", "Michael Sheen and David Tennant are returning for a second season of fantasy drama Good Omens.\r\nAmazon has ordered a second, six-part series of the drama adaptation of Neil Gaiman and Terry Pratchett… [+3070 chars]", "https://deadline.com/2021/06/good-omens-neil-gaiman-season-2-amazon-renewed-1234783163/"], "NPR": ["2 Americans Have Apologized To A Tokyo Court For Their Role In Carlos Ghosn's Escape - NPR", "This Dec. 30, 2019 image from security camera video shows Michael L. Taylor, center, and George-Antoine Zayek at passport control at Istanbul Airport in Turkey. Taylor and his son Peter, are charged … [+3204 chars]", "https://www.npr.org/2021/06/29/1011246349/2-americans-have-apologized-to-a-tokyo-court-for-their-role-in-carlos-ghosns-esc"], "CNBC": ["Walmart unveils low-price insulin as more patients with diabetes struggle to pay for drug - CNBC", "Walmart said Tuesday it will offer a less expensive version of insulin that could better fit into the budgets of millions of Americans who don't have health insurance or struggle to pay for the lifes… [+3731 chars]", "https://www.cnbc.com/2021/06/29/walmart-unveils-low-price-analog-insulin-amid-rising-diabetes-drug-costs.html"], "KMOV.com": ["Federal plea deal could be behind Derek Chauvin's mysterious comment during sentencing - KMOV.com", "MINNEAPOLIS (WCCO/CNN) Derek Chauvin is reportedly close to a plea deal on federal charges.\r\nThe former Minneapolis police officer was sentenced to 22.5 years for the death of George Floyd, but he st… [+1665 chars]", "https://www.kmov.com/news/federal-plea-deal-could-be-behind-derek-chauvins-mysterious-comment-during-sentencing/article_fefd3c6c-d8d0-11eb-9815-2b768ceee213.html"]}