[{"The Philadelphia Inquirer": ["Bill Cosby released from prison after Pa. Supreme Court overturns sexual assault conviction", "Bill Cosby was released from prison Wednesday after the Pennsylvania Supreme Court overturned his sexual assault conviction and barred him from being retried.\r\nThe 83-year-old comedian was released f… [+3364 chars]", "https://www.inquirer.com/news/bill-cosby-conviction-overturned-appeal-andrea-constand-20210630.html"], "CNN": ["Putin says US sanctions on Russia 'even did us good' ", null, "https://www.cnn.com/2021/06/30/europe/putin-us-sanctions-intl/index.html"], "Fox News": ["Trump likely to blast Biden during U.S.", "Former President Trump returns to the nations southern border on Wednesday, as fellow Republicans continue to hammer President Biden over the increase in migrants crossing the U.S.-Mexico border.\r\nTr… [+6884 chars]", "https://www.foxnews.com/politics/trump-likely-to-blast-biden-during-u-s-mexico-border-trip-with-texas-gov-abbott"], "New York Times": ["Answers About Masks, the Delta Variant and Breakthrough Infections ", "The risk of being hospitalized or dying as a result of a breakthrough infection is minuscule (less than .003 percent), based on data collected from the C.D.C. As of June 21, more than 150 million peo… [+2540 chars]", "https://www.nytimes.com/2021/06/30/well/live/delta-variant-vaccines-masks.html"], "Financial Times": ["Robinhood ordered to pay $70m penalty to US regulator", "A Wall Street regulator has ordered the retail trading platform Robinhood to pay more than $70m in penalties for causing what it described as “widespread and significant” harm to its customers.\r\nThe … [+2640 chars]", "https://www.ft.com/content/3de60b3b-fa83-466a-b38d-d5cde3680b36"], "NBC News": ["Allison Mack sentenced to 3 years in prison for her role in NXIVM sex cult", "A federal judge Wednesday sentenced \"Smallville\" actress Allison Mack to three years in prison for her role in a purported self-help group that prosecutors say doubled as a secret sex cult.\r\nAllison … [+2169 chars]", "https://www.nbcnews.com/news/us-news/allison-mack-sentenced-3-years-prison-her-role-nxivm-sex-n1272707"], "CNBC": ["Didi shares pop more than 17%, valuing Chinese ride", "Shares of Didi Chuxing were up a modest 4% Wednesday afternoon after spiking as much as 28.6% in the Chinese ride-hailing giant's market debut.\r\nThe company's stock began trading at $16.65 per share,… [+4087 chars]", "https://www.cnbc.com/2021/06/30/didi-ipo-begins-trading-on-the-nyse.html"], "Politico": ["Trump debuts at 41st in C-SPAN presidential rankings ", "In the administrative skills category, Trump was ranked last among the 45 former presidents. He also fell in last in the category of moral authority, just below Buchanan who is most widely known for … [+3130 chars]", "https://www.politico.com/news/2021/06/30/trump-cspan-president-ranking-497184"], "CBS Sports": ["Suns", "I cite the following trend not as a definitive stance on my position, but simply to inform those considering betting on Game 6 Wednesday night. In the three games Chris Paul has played in this series… [+3729 chars]", "https://www.cbssports.com/nba/news/suns-clippers-picks-nba-playoff-betting-odds-why-paul-george-los-angeles-will-force-a-game-7-wednesday/"], "NPR": ["Death Toll Climbs To 16 In The Surfside Condo Collapse, With 147 Missing", "Search and rescue personnel work alongside heavy machinery Wednesday to sift through the rubble at the Champlain Towers South condo building, where scores of people remain missing almost a week after… [+1739 chars]", "https://www.npr.org/sections/live-updates-miami-area-condo-collapse/2021/06/30/1011759062/death-toll-climbs-to-16-in-the-surfside-condo-collapse-with-147-missing"], "Yahoo Entertainment": ["'Extreme' white dwarf sets cosmic records for small size, huge mass ", "By Will Dunham\r\nWASHINGTON (Reuters) - In their death throes, roughly 97% of all stars become a smoldering stellar zombie called a white dwarf, one of the densest objects in the cosmos. A newly disco… [+3185 chars]", "https://news.yahoo.com/extreme-white-dwarf-sets-cosmic-163311879.html"], "The Wall Street Journal": ["Amazon Seeks Recusal of FTC Chairwoman Lina Khan in Antitrust Investigations of Company", "WASHINGTON Amazon.com Inc. filed a request with the Federal Trade Commission seeking the recusal of new Chairwoman Lina Khan from antitrust investigations of the company, in light of her extensive pa… [+845 chars]", "https://www.wsj.com/articles/amazon-seeks-recusal-of-ftc-chairwoman-lina-khan-in-antitrust-investigations-of-company-11625067962"], "Engadget": ["Loki and the Simpsons meet on Disney+ July 7th", "Fans of Loki will have more than just a new episode of Marvels live-action series to look forward to next Wednesday. On July 7th, Disney will also release The Good, The Bart, and The Loki, a new Simp… [+612 chars]", "https://www.engadget.com/the-good-the-bart-and-the-loki-disney-plus-july-7th-160218644.html"], "The Verge": ["AT&T is switching all Android phones to Google’s Messages app for RCS", "Verizon is the last big carrier not to switch\r\nPhoto by Amelia Holowaty Krales / The Verge\r\nAT&amp;T and Google have announced that all Android phones on the network will use Googles Android Messages… [+2170 chars]", "https://www.theverge.com/2021/6/30/22556686/att-android-phones-rcs-google-messages"], "Nature.com": ["Age-related immune response heterogeneity to SARS-CoV", "<li>Cambridge Institute of Therapeutic Immunology &amp; Infectious Disease (CITIID), Cambridge, UK\r\nDami A. Collier, Isabella A. T. M. Ferreira, Prasanti Kotagiri, Rawlings Datir, Bo Meng, Adam Abdul… [+6231 chars]", "https://www.nature.com/articles/s41586-021-03739-1"], "KELOLAND.com": ["Delta variant confirmed in South Dakota", "PIERRE, S.D. (KELO) — The first case of the delta variant of the coronavirus has been confirmed in South Dakota. \r\nThe South Dakota Department of Health reported the first case of the B.1.617.2 on We… [+1547 chars]", "https://www.keloland.com/news/healthbeat/coronavirus/delta-variant-confirmed-in-south-dakota/"]}, 1625080740.504035]