[{"Daily Mail": ["Death toll from Miami condo collapse surges to 86 as 43 still remain 'unaccounted for'", "The death toll from the Miami condo collapse reached 84 on Saturday, as workers recovered the bodies of seven new victims overnight. \r\nAnother 43 people still remain 'unaccounted for' - 17 days after… [+7781 chars]", "https://www.dailymail.co.uk/news/article-9776131/Death-toll-Miami-condo-collapse-surges-86-43-remain-unaccounted-for.html", 0.315995, ["negative", 0.800032]], "NPR": ["How We'll Know When The COVID", "People relax at the Georgetown Waterfront Park on Monday in Washington, D.C. While pandemic restrictions have been lifted for much of the country, the Delta variant of COVID-19 is hospitalizing thous… [+9028 chars]", "https://www.npr.org/2021/07/10/1014374383/covid-19-coronavirus-pandemic-when-its-over", 0.157961, ["positive", 0.604281], ["positive", 0.604281], ["positive", 0.604281]], "Page Six": ["Ashley Olsen goes hiking with a drink in one hand and a machete in the other", "Louis Eisner shared a rare photo of girlfriend Ashley Olsen as they hiked together Friday, with the fashion designer carrying a machete along the trail.\r\nOlsen, 35, was snapped by her beau wearing a … [+1168 chars]", "https://pagesix.com/2021/07/10/ashley-olsen-goes-hiking-with-a-machete/", 0.342554, ["positive", 0.767198]], "MLB.com": ["All", "Major League Baseball on Saturday announced the selections of 10 players to the active All-Star rosters as replacements for All-Stars unable to participate in Tuesdays 91st Midsummer Classic.\r\nThe 10… [+1746 chars]", "https://www.mlb.com/news/2021-mlb-all-star-game-replacements", 0.119183, ["positive", 0.547323]], "Los Angeles Times": ["Temperatures in Southern California could top 120 today", "An intense heat wave is already bringing dangerous conditions to inland and desert regions of Southern California.\r\nOfficials believe records could fall in these areas Saturday after some desert comm… [+2126 chars]", "https://www.latimes.com/california/story/2021-07-10/temperatures-could-top-120-in-inland-southern-california-today-as-heat-wave-bears-down", 0.171188, ["positive", 0.780952]], "Kotaku": ["Man Arrested For Selling Modded Zelda Save Files", "A 27-year old man in Japan was arrested after he was caught attempting to sell modified Zelda: Breath of The Wild save files. \r\nAs reported by the Broadcasting System of Niigata (and spotted by Dextr… [+1831 chars]", "https://kotaku.com/man-arrested-for-selling-modded-zelda-save-files-1847265984", 0.900719, ["negative", 0.660116]], "Fox News": ["Michigan carnival ride disaster: Video shows bystanders rush to stop 'Magic Carpet' from falling over", "A Michigan festival almost turned disastrous when a carnival park ride started swaying and threatened to tip over. \r\nAttendees at the 95th Annual National Cherry Festival in Traverse City intervened … [+1113 chars]", "https://www.foxnews.com/us/michigan-festival-ride-disaster-bystanders-stop-magic-carpet-falling", 0.362271, ["positive", 0.62321], ["positive", 0.62321], ["positive", 0.62321], ["positive", 0.62321]], "The Wall Street Journal": ["Egypt and Ethiopia Clash Over Nile River Dam as Water Scarcity Looms World", "A dispute over the Nile, the worlds longest river, is coming to a head. At stake are the lives and livelihoods of millions of people who depend on its water.\r\nEgypt is objecting to efforts by Ethiopi… [+916 chars]", "https://www.wsj.com/articles/egypt-and-ethiopia-clash-over-nile-river-dam-as-water-scarcity-looms-world-wide-11625925602", 0.837741, ["positive", 0.76785]], "USA Today": ["Common colds rising as pandemic restrictions ease; door-to-door vaccine push becomes political battleground: Live COVID-19 updates ", "New Jersey Gov. Phil Murphy says the number one priority of the Biden administration should be to ramp up production of the COVID-19 vaccine. Murphy said the state will struggle to meet its vaccinati… [+6752 chars]", "https://www.usatoday.com/story/news/nation/2021/07/10/white-house-calls-out-door-to-door-vaccine-push-critics/7922041002/", 0.828819, ["positive", 0.568624]], "BuzzFeed News": ["Here’s Why You Probably Won't Need A Booster Shot Against The Delta Variant Anytime Soon", "Facing the threat of a more infectious Delta variant, vaccine makers Pfizer and BioNTech released a statement on Thursday saying it may be beneficial for people to get a third dose of their COVID vac… [+10363 chars]", "https://www.buzzfeednews.com/article/danvergano/covid-vaccines-delta-boosters", 0.538502, ["positive", 0.710232]], "NBC News": ["Robert E. Lee statue removed in Charlottesville, Virginia", "Statues honoring two Confederate generals came down Saturday, nearly four years after white supremacist and neo-Nazi groups stormed the Virginia college town to protect it.\r\nThe removal of the bronze… [+1608 chars]", "https://www.nbcnews.com/news/us-news/robert-e-lee-statue-removed-charlottesville-n1273612", 0.397897, ["negative", 0.862656]], "The Verge": ["Apple AirTag vs. Samsung SmartTag Plus vs. Tile Pro", "If you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement.This year will go down in history as the year we entered the golden age of Not Losing Your Stuff. Wel… [+12284 chars]", "https://www.theverge.com/22570161/apple-airtag-samsung-smarttag-tile-pro-bluetooth-tracker-review-test-comparison", 0.555674, ["positive", 0.645008]], "The Athletic": ["Fame, fiery speeches and fake names: On Giannis Antetokounmpo, a reluctant superstar and his first Finals...", "PHOENIX — If only for a moment, Giannis Antetokounmpo had his anonymity back on Monday night.It was getting late inside a hotel on the outskirts of Phoenix, where the NBA’s most reluctant superstar r… [+540 chars]", "https://theathletic.com/2699249/2021/07/10/giannis-antetokounmpo-is-ready-for-the-nba-finals-spotlight-on-the-court-but-remains-a-reluctant-superstar-off-of-it/", 0.879585, ["negative", 0.622449]], "Associated Press": ["Democrats craft voting bill with eye on Supreme Court fight", "WASHINGTON (AP) As congressional Democrats gear up for another bruising legislative push to expand voting rights, much of their attention has quietly focused on a small yet crucial voting bloc with t… [+6457 chars]", "https://apnews.com/article/government-and-politics-supreme-courts-courts-voting-race-and-ethnicity-4fc2deafafca64248dad4dfceaf7a05d", 0.981212, ["positive", 0.745738]], "KY3": ["2 drownings reported in the Ozarks on Friday", "NOEL &amp; KAISER, Mo. (KY3) -The Missouri State Highway Patrol investigated two drownings on Friday.\r\nThe patrol says Louis Janowski, 98, of Frankfort, Il., fell into the water near Kaiser after he … [+373 chars]", "https://www.ky3.com/2021/07/10/2-drownings-reported-ozarks-friday/", 0.150186, ["positive", 0.688256]]}, 1625947921.988116]