[{"Fortune": ["Stocks and crypto slump after inflation data heats up", "Skip to Content", "https://fortune.com/2021/07/13/stocks-and-crypto-slump-after-inflation-data-heats-up/", "Computers", ["negative", 0.52539]], "Fox News": ["Death toll mounts in South Africa rioting after Zuma jailing", "JOHANNESBURG The death toll from rioting in South Africa rose to 45 on Tuesday as police and the military tried to halt the unrest in poor areas of two provinces that began last week after the impris… [+2950 chars]", "https://www.foxnews.com/world/death-toll-mounts-in-south-africa-rioting-after-zuma-jailing", "Society", ["positive", 0.620544]], "NPR": ["Tennessee's Top Vaccine Boss Is Fired After She Addresses Parental Consent : Coronavirus Updates", "A technician fills a syringe from a vial of the Moderna COVID-19 vaccine earlier this year.\r\nJon Cherry/Getty Images\r\nTennessee's top vaccine official says she has been fired as punishment for doing … [+5374 chars]", "https://www.npr.org/sections/coronavirus-live-updates/2021/07/13/1015742588/tennessees-ousted-vaccination-chief-blasts-politics-over-teen-vaccines", "Health", ["positive", 0.649255]], "NBC News": ["Chicago officials issue travel advisory amid spread of Covid delta variant in Arkansas and Missouri", "Chicago officials issued a travel warning on Tuesday for Missouri and Arkansas amid an increase of Covid-19 cases there, authorities said.\r\nThis is the first time in weeks the city has issued a trave… [+2845 chars]", "https://www.nbcnews.com/news/us-news/chicago-officials-issue-travel-advisory-amid-spread-covid-delta-variant-n1273865", "Society", ["positive", 0.799963], "Society", ["positive", 0.799963]], "MacRumors": ["Apple's MagSafe Battery Pack Unlocks Long Rumored Reverse Charging Feature", "Apple's MagSafe Battery Pack designed for the iPhone 12 models has a unique feature that's long been rumored but never introduced in an Apple product -- reverse wireless charging. \r\nWhen attached to … [+1200 chars]", "https://www.macrumors.com/2021/07/13/apple-magsafe-battery-pack-reverse-charging/", "Computers", ["negative", 0.563924]], "CNBC": ["Harris, Manchin to meet Texas Democrats who left state in effort to block GOP election bill", "Vice President Kamala Harris will meet Tuesday with Texas Democratic legislators who fled the state in an effort to block a Republican-backed election bill that they say is discriminatory, a White Ho… [+2183 chars]", "https://www.cnbc.com/2021/07/13/harris-manchin-to-meet-with-texas-democrats-trying-to-block-gop-election-law.html", "Society", ["positive", 0.528397], "Society", ["positive", 0.528397], "Society", ["positive", 0.528397], "Society", ["positive", 0.528397]], "New York Post": ["NASA claims moon's natural 'wobble' will lead to record floods, study claims ", "A cyclical shift in the moons orbit, coupled with rising sea levels due to climate change, is set to cause record flooding across the world in the next decade, a new study shows.\r\nThe study, conducte… [+3102 chars]", "https://nypost.com/2021/07/13/moon-wobble-climate-change-will-create-record-floods-study/", "Science", ["negative", 0.605953]], "CBS Sports": ["Team USA men's basketball: Americans are not taking it easy, but they should not hit the panic button either", "In the middle of the NBA Finals, nobody expected the story to become the United States men's basketball team dropping two straight exhibition games in the leadup to the Tokyo Olympics this summer. Bu… [+4197 chars]", "https://www.cbssports.com/nba/news/team-usa-mens-basketball-americans-are-not-taking-it-easy-but-they-should-not-hit-the-panic-button-either/", "Sports", ["negative", 0.836786]], "ESPN": ["Milwaukee Bucks star Giannis Antetokounmpo motivated by Phoenix Suns' defense designed to slow him down", "MILWAUKEE -- After dominating the first three games of the NBA Finals, Bucks superstar Giannis Antetokounmpo is expected to do more of the same in Game 4 on Wednesday night, as he and his teammates h… [+5708 chars]", "https://www.espn.com/nba/story/_/id/31813089/milwaukee-bucks-star-giannis-antetokounmpo-motivated-phoenix-suns-defense-designed-slow-down", "Sports", ["positive", 0.607754]], "Associated Press": ["US COVID-19 cases rising again, doubling over three weeks", "The COVID-19 curve in the U.S. is rising again after months of decline, with the number of new cases per day doubling over the past three weeks, driven by the fast-spreading delta variant, lagging va… [+4520 chars]", "https://apnews.com/article/coronavirus-pandemic-us-cases-rising-03150d6404004711b80e9bd6ff0d410d", "Games", ["negative", 0.725041]], "Lifehacker.com": ["How to Go Back to Windows 10 If You Regret Installing Windows 11 - Lifehack", "The Windows 11 beta recently got its first big version update, but it brought a major change that some users arent happy with: You can no longer revert back to the classic Windows start menu layout. … [+3425 chars]", "https://lifehacker.com/how-to-go-back-to-windows-10-if-you-regret-installing-w-1847283558", "Computers", ["negative", 0.674443]], "WAPT Jackson": ["10 children on life support as Mississippi sees surge in delta variant cases", "JACKSON, Miss. —Concern about the spread of the COVID-19 delta variant is rising in Mississippi.\r\nState health officer Dr. Thomas Dobbs said in a tweet Tuesday that 12 children are in the ICU and 10 … [+2285 chars]", "https://www.wapt.com/article/10-children-on-life-support-as-mississippi-sees-surge-in-delta-variant-cases/37010954", "Society", ["positive", 0.818909]], "CNN": ["Ransomware gang that hit meat supplier mysteriously vanishes from the internet ", "Washington (CNN Business)REvil, the ransomware gang that attacked meat supplier JBS Foods this spring and a major IT software vendor this month, has mysteriously vanished from the internet, according… [+4287 chars]", "https://www.cnn.com/2021/07/13/tech/revil-ransomware-disappears/index.html", "Arts", ["positive", 0.513989], "Arts", ["positive", 0.513989]], "The Hill": ["1 million people in France make vaccine appointments after Macron warning | TheHill", "More than 1 million people in France have made appointments to get the coronavirus vaccine after French President Emmanuel MacronEmmanuel Jean-Michel MacronThe tool we need to expand COVID-19 vaccina… [+1303 chars]", "https://thehill.com/policy/international/562764-1-million-people-in-france-make-vaccine-appointments-after-macron", "Health", ["negative", 0.647864]], "Ars Technica": ["If we want to look for life on Europa, we’d better bring a drill", "20 with 17 posters participating\r\nJupiter's moon Europa, a large world with a vast sub-ice ocean, is thought to be one of the best candidates for hosting life elsewhere in the Solar System. NASA has … [+4919 chars]", "https://arstechnica.com/science/2021/07/if-we-want-to-look-for-life-on-europa-we-better-bring-a-drill/", "Arts", ["positive", 0.635226]]}, 1626219075.242468]