[{"Fox Business": ["Ransomware attack thought tied to Russia", "A cybercrime organization with ties to Russia is believed to have launched a massive ransomware attack that involves hundreds of companies, according to a cybersecurity firm.\r\nThe ongoing attack has … [+1332 chars]", "https://www.foxbusiness.com/technology/ongoing-ransomware-attack-hitting-hundreds-of-businesses-cybersecurity-expert-says", "Society", ["negative", 0.56365]], "Fox News": ["Experts sound alarm over American media’s celebratory tone of Chinese Communist Party’s 100", "The mainstream media had a celebratory tone leading up to the 100-year anniversary of Chinas Communist Party, and coverage of the \"ominous\" speech by Chinas leader Xi Jinping to mark the event left e… [+6668 chars]", "https://www.foxnews.com/media/china-media-ccp-anniversary", "Society", ["positive", 0.719122]], "New York Times": ["Absentee Ballots May Determine if Eric Adams Wins Mayor's Race ", "Mr. Adams was the first choice on 2,999 absentee ballots from Manhattan, or about 13 percent, and the second or third choice on another 5,304. Manhattan was the only borough he did not win in the in-… [+1524 chars]", "https://www.nytimes.com/2021/07/02/nyregion/nyc-mayor-race-voting-count-eric-adams.html", "Society", ["positive", 0.611971]], "CNBC": ["Hurricane winds could make Surfside building structure collapse further, structural engineer warns", "The potential impact of hurricane winds on the search-and-rescue operations at the collapsed Surfside, Florida condominium could make the building structure collapse further, structural engineer Rich… [+1830 chars]", "https://www.cnbc.com/2021/07/02/hurricane-winds-could-make-surfside-building-structure-collapse-further-structural-engineer-warns.html", "Science", ["negative", 0.693575]], "NBC News": ["North Miami Beach building deemed unsafe, evacuations ordered", "Evacuations were ordered Friday for residents of a North Miami Beach, Florida, condominium complex after building officials determined it was unsafe.\r\nThe Crestview Towers Condominium, built in 1972,… [+1958 chars]", "https://www.nbcnews.com/news/us-news/north-miami-beach-building-deemed-unsafe-evacuations-ordered-n1273032", "Science", ["negative", 0.899018]], "New York Post": ["Biden bloat: West Wing payroll near $50 million, highest on record ", "The Biden administration’s Executive Office of the President (EOP) has 560 employees and a payroll of close to $50 million — the highest of any administration in at least 12 years, according to data … [+2715 chars]", "https://nypost.com/2021/07/02/bidens-west-wing-payroll-near-50m-highest-on-record/", "Sports", ["negative", 0.670894]], "TMZ": ["Kelly Clarkson Asks Judge to Declare Her Legally Single Amid Divorce", "Kelly Clarkson's getting a head start on her Fourth of July weekend ... filing for her own independence from her estranged husband.\r\nClarkson's lawyer, disso-queen, Laura Wasser, filed legal docs Fri… [+1242 chars]", "https://www.tmz.com/2021/07/02/kelly-clarkson-divorce-prenup-child-custody-declare-legally-single/", "Society", ["negative", 0.526693]], "BBC News": ["Ethiopia's Tigray crisis: Rebel resurgence raises questions for Abiy Ahmed", "By Vivienne NunisBBC Africa correspondent, Nairobi\r\nimage captionRebel fighters celebrated capturing Mekelle last week\r\nThe rebel capture of Tigray's capital city Mekelle is a significant milestone i… [+7367 chars]", "https://www.bbc.com/news/world-africa-57693784", "Recreation", ["positive", 0.927077]], "The Hill": ["Five takeaways from the June jobs report | TheHill", "The employment report for June showed the labor market heating up as the summer began with employers adding 850,000 jobs.\r\nWhile it wasnt a pre-Fourth of July fireworks show, Fridays numbers from the… [+4993 chars]", "https://thehill.com/policy/finance/561424-five-takeaways-from-the-june-jobs-report", "Sports", ["positive", 0.60655]], "Engadget": ["The Blue Screen of Death in Windows 11 is going black", "The start menu may not end up the only element of Microsofts desktop operating system that gets a visual overhaul in Windows 11\r\n. According to The Verge\r\n, Windows 11 will feature a Black Screen of … [+934 chars]", "https://www.engadget.com/windows-11-black-screen-of-death-231414884.html", "Computers", ["negative", 0.80632]], "CNN": ["White House goes into damage control mode after reports of dysfunction in Kamala Harris' office ", "(CNN)The White House dove into damage control this week after reports of dysfunction and infighting in Vice President Kamala Harris' office, with the administration trying to stop a drama-filled narr… [+6681 chars]", "https://www.cnn.com/2021/07/02/politics/kamala-harris-office-dynamics/index.html", "Health", ["negative", 0.758963]], "The Washington Post": ["15 million people in the U.S. have missed their second dose of the coronavirus vaccine, CDC says", "The second shot is recommended three weeks after the first Pfizer-BioNTech shot or four weeks after the first Moderna shot. Second doses were considered missed if more than 42 days had passed since t… [+2619 chars]", "https://www.washingtonpost.com/health/2021/07/02/missed-second-dose-covid19-vaccine/", "Health", ["negative", 0.618277]], "Hawaii News Now": ["WATCH: Coast Guard video shows dramatic rescue after cargo plane crash off Oahu", "HONOLULU (HawaiiNewsNow) - US Coast Guard video shows the dramatic rescue of two pilots whose Boeing 737-200 cargo plane crashed about two miles off West Oahu early Friday.\r\nWhen a Coast Guard helico… [+1559 chars]", "https://www.hawaiinewsnow.com/2021/07/02/watch-coast-guard-releases-video-cargo-plane-crash-rescue-off-oahu/", "Recreation", ["negative", 0.602164]], "Raw Story": ["Missouri man in his 40s 'so sorry' he didn't get the COVID vaccine. Then he died", "Authors of the book titled \"Forget the Alamo,\" and the publisher Penguin Random House say the cancellation of the event, which had 300 RSVPs, amounts to censorship from Republican elected leaders, an… [+4848 chars]", "https://www.rawstory.com/missouri-man-in-his-40s-so-sorry-he-didn-t-get-the-vaccine-then-he-died/", "Society", ["negative", 0.781696]], "Barron's": ["Jeff Bezos Steps Down as CEO on Monday. Here’s What It Means for Amazon’s Stock.", "Amazon.com\r\n founder Jeff Bezos is stepping down as the companys CEO on Monday, the companys 27th birthday. Hes handing over the baton to Andy Jassy, a 24-year Amazon veteran who built and ran Amazon… [+4989 chars]", "https://www.barrons.com/articles/amazon-ceo-jeff-bezos-andy-jassy-51625253171", "Society", ["positive", 0.648629]]}, 1625281973.549674]