[{"TwinCities.com-Pioneer Press": ["Montana town of grizzly attack a popular stop for cyclists", "By AMY BETH HANSON and MATTHEW BROWN\r\nHELENA Mont. (AP) — A tiny western Montana town where a grizzly bear pulled a woman from her tent and killed her this week welcomes visitors year-round to the mo… [+6464 chars]", "https://www.twincities.com/2021/07/09/montana-town-of-grizzly-attack-a-popular-stop-for-cyclists/", "Sports", ["positive", 0.765283]], "Variety": ["Matt Damon Took a Road Trip to Meet Trump Supporters Before Playing One in ‘Stillwater’", "Matt Damon went deep into red state identity politics to build his character in Tom McCarthy’s Cannes premiere “Stillwater.”\r\nTo portray Oklahoma oil rig worker Bill Baker — a father who sacrifices e… [+1942 chars]", "https://variety.com/2021/film/news/matt-damon-stillwater-trump-1235015666/", "Sports", ["positive", 0.638676]], "POLITICO.eu": ["EU regulator: mRNA coronavirus vaccines possibly linked to heart swelling ", "The mRNA vaccines from BioNTech/Pfizer and Moderna are possibly linked to rare cases of heart inflammation, according to analysis of 321 cases post-vaccination released Friday by the European Medicin… [+2115 chars]", "http://www.politico.eu/article/eu-regulator-mrna-coronavirus-vaccines-possibly-linked-to-heart-swelling/", "Health", ["positive", 0.73186]], "9to5Mac": ["M1 MacBook battery life so good Apple thought indicator was broken", "Apple has claimed in a new interview that the M1 MacBook battery life was so good they originally thought the battery indicator was buggy, failing to respond as the remaining life fell.\r\nThe claim is… [+2511 chars]", "https://9to5mac.com/2021/07/09/m1-macbook-battery-life/", "Computers", ["negative", 0.792865]], "Fox News": ["Fire in food factory in Bangladesh kills at least 49 people", "At least 49 people have died in a fire that broke out at a food and beverage factory outside Bangladesh's capital, fire officials and local TV stations said Friday.\r\nA fire service official, Russel S… [+2201 chars]", "https://www.foxnews.com/world/fire-in-food-factory-in-bangladesh-kills-at-least-49-people", "Health", ["positive", 0.537544], ["positive", 0.537544], ["positive", 0.537544]], "CNN": ["London police officer pleads guilty to murder of Sarah Everard ", null, "https://www.cnn.com/2021/07/09/europe/sarah-everard-murder-guilty-plea-couzens-intl/index.html", "Society", ["positive", 0.611614], ["positive", 0.611614], ["positive", 0.611614]], "The Verge": ["Biden executive order will target right to repair, ISPs, net neutrality, and more", "All in the name of promoting competition in the US economy\r\nPhoto by Demetrius Freeman/The Washington Post via Getty Images\r\nThe White House has issued a fact sheet listing the industries and policie… [+1609 chars]", "https://www.theverge.com/2021/7/9/22569869/biden-executive-order-right-to-repair-isps-net-neutrality", "Society", ["negative", 0.769831]], "PEOPLE": ["Jason Momoa Goes Shirtless and Rubs Hand Sanitizer All Over His Chest on Jimmy Kimmel Live! ", "Jason Momoa is baring it all!\r\nWhile appearing virtually on Jimmy Kimmel Live! Thursday, the 41-year-old actor took part in a \"Make It Sexy Challenge,\" where he was tasked with transforming everyday … [+2491 chars]", "https://people.com/movies/jason-momoa-goes-shirtless-during-make-it-sexy-challenge/", "Arts", ["positive", 0.593981]], "USA Today": ["New York City subway stations flooded in waist-high water ahead of Tropical Storm Elsa ", "NEW YORK — Heavy thunderstorms caused a deluge of rain, flooding subway stations and roadways in New York City hours before Tropical Storm Elsa arrived Friday.\r\nThe thunderstorms Thursday evening cau… [+2035 chars]", "https://www.usatoday.com/story/news/nation/2021/07/09/nyc-flooding-soaks-subways-roads-ahead-tropical-storm-elsa/7912206002/", "Arts", ["positive", 0.558065]], "NBC News": ["Alaskan teen passenger causes plane to nosedive after taking over controls", "JUNEAU, Alaska A passenger on a small plane bound for a tiny western Alaska community said he tried to end his life when he took control of the plane's yoke and caused it to nosedive before the pilot… [+3947 chars]", "https://www.nbcnews.com/news/us-news/alaskan-teen-passenger-causes-plane-nosedive-after-taking-over-controls-n1273448", "Recreation", ["negative", 0.911936]], "The Wall Street Journal": ["Richard Branson’s Virgin Galactic Flight Kick", "Space tourism is trying to take off.\r\nRichard Bransons planned flight to the edge of space on Sunday brings the nascent industry closer to realitythough it could be years before most travelers can af… [+1306 chars]", "https://www.wsj.com/articles/richard-bransons-virgin-galactic-flight-kick-starts-space-tourism-11625832000", "Society", ["positive", 0.692606]], "NFL News": ["Cameron Kinley: 'I definitely have a chip on my shoulder' entering Bucs training camp ", "Defense Secretary Lloyd Austin's about-face this week to allow Tampa Bay Buccaneers rookie cornerback Cameron Kinley to attend training camp surprised everyone, including the former Navy team captain… [+1699 chars]", "https://www.nfl.com/news/cameron-kinley-i-definitely-have-a-chip-on-my-shoulder-entering-bucs-training-ca", "Sports", ["positive", 0.522919]], "The Washington Post": ["South Korea reverses loosening of mask mandate, ramps up curbs as cases soar", "South Korea was one of the first East Asian countries to lay a path out of the pandemic. In June, it announced plans to permit partially inoculated residents to go mask-free outdoors, while also allo… [+2859 chars]", "https://www.washingtonpost.com/world/2021/07/09/korea-seoul-covid-distancing-virus/", "Society", ["positive", 0.723809]], "Space.com": ["Mars helicopter Ingenuity spotted a 'heart' in Perseverance rover's tracks on 9th flight (video)", "Is there something going on between Perseverance and the Mars helicopter Ingenuity?\r\nDuring its latest Red Planet flight on Monday\r\n (July 5), NASA's 4-lb. (1.8 kilograms) Ingenuity Mars helicopter p… [+3525 chars]", "https://www.space.com/mars-helicopter-ingenuity-rover-track-heart-9th-flight-video", "Recreation", ["positive", 0.965716]], "SamMobile": ["Galaxy S22 might come with a next", "Smartphones are getting thinner and more powerful than ever before. Running the internals at max performance generates heat. These devices thus need robust cooling solutions. Otherwise, the only opti… [+1628 chars]", "https://www.sammobile.com/news/galaxy-s22-next-level-cooling-solution/", "Games", ["positive", 0.676764]], "The Guardian": ["First Thing: Two US", "First ThingFlorida entrepreneur James Solages and Joseph Vincent accused of involvement in the killing of Haitis president. Plus, storms batter US east coast, and the Syrian refugee who lived in an a… [+8022 chars]", "https://amp.theguardian.com/us-news/2021/jul/09/first-thing-two-us-haitians-arrested-in-connection-with-jovenel-moise-assassination", "Society", ["negative", 0.653532]]}, 1625848816.51917]