[{"CNN": ["Democrats look to avoid 'circus' as they push forward with new select committee ", null, "https://www.cnn.com/2021/07/08/politics/january-6-select-committee-democratic-strategy/index.html", "Society", ["negative", 0.819659], ["negative", 0.819659], ["negative", 0.819659], ["negative", 0.819659]], "Reuters": ["Stellantis makes 30 billion euro wager on electric vehicle market", "MILAN/DETROIT, July 8 (Reuters) - Stellantis (STLA.MI), the world's No. 4 automaker, said on Thursday it plans to invest more than 30 billion euros ($35.54 billion) through 2025 on electrifying its v… [+3822 chars]", "https://www.reuters.com/business/autos-transportation/stellantis-says-h1-margin-expected-top-annual-target-55-75-2021-07-08/", "Business", ["negative", 0.679226]], "Fox News": ["Delta COVID", "The Centers for Disease Control and Prevention (CDC) now predicts that the Delta COVID-19 variant is the dominant strain in the U.S., having overtaken Alpha to account for 51.7% of infections, accord… [+2784 chars]", "https://www.foxnews.com/health/delta-covid-19-variant-dominant-us-cdc", "Society", ["positive", 0.558301], ["positive", 0.558301], ["positive", 0.558301]], "Yahoo Entertainment": ["Bella Hadid Goes ‘Clueless’ in a Checkered Shirt & Pink Mini Skirt With Trendy Thong Heels ", "Bella Hadid channeled a memorable film during her time in Cannes, France, this week.\r\nIn town for the 2021 Cannes Film Festival, the model took to Instagram to show off one of her outfits of the day … [+2749 chars]", "https://www.yahoo.com/lifestyle/bella-hadid-goes-clueless-checkered-125029723.html", "Arts", ["positive", 0.745941]], "The Washington Post": ["Japan declares state of emergency in Tokyo during Olympics", "In light of the announcement, the organizers of the Games held a meeting Thursday evening to discuss whether to implement further restrictions on spectators, or whether to ban them entirely. They ann… [+6915 chars]", "https://www.washingtonpost.com/sports/olympics/2021/07/08/olympics-spectators-japan/", "Sports", ["positive", 0.730854]], "CNBC": ["U.S. weekly jobless claims unexpectedly rise to 373,000, as job growth slows", "Initial filings for unemployment insurance unexpectedly rose last week, a possible hint that the rapid job growth seen in the first half of 2021 could face hurdles in the months ahead, the Labor Depa… [+2176 chars]", "https://www.cnbc.com/2021/07/08/us-weekly-jobless-claims.html", "Home", ["positive", 0.68839]], "Cosmopolitan.com": ["Jamie Lynn Spears Says She's \"Broke\" Amid Britney Spears Payroll Speculation ", "Jamie Lynn Spears has shut down claims that she's on her sister Britney Spears' payroll. The actress reportedly reposted a screenshot of a news outlet's headline reading \"Britney Spears’ sister Jamie… [+1472 chars]", "https://www.cosmopolitan.com/entertainment/celebs/a36966142/jamie-lynn-spears-broke-britney-spears-payroll/", "Arts", ["negative", 0.943207]], "The Hill": ["Arizona secretary of state seeks investigation into Trump, allies | TheHill", "Arizona Secretary of State Katie Hobbs (D) is calling on state Attorney General Mark Brnovich (R) to look into reports that former President TrumpDonald TrumpTrump golf club reaches 0K settlement wit… [+3160 chars]", "https://thehill.com/homenews/state-watch/562010-arizona-secretary-of-state-seeks-investigation-into-trump-allies", "Society", ["positive", 0.887222]], "Investor's Business Daily": ["Dow Jones Futures Tumble As Treasury Yields Keep Falling; Tesla China Sales Strong, Newegg Is New Meme Stock Rocket", "Dow Jones futures fell sharply Thursday morning, along with S&amp;P 500 futures and Nasdaq futures, as the 10-year Treasury yield continued to tumble amid concerns about global economic growth. China… [+9690 chars]", "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-tumble-as-treasury-yields-keep-falling-tesla-china-sales-strong-newegg-meme-stock/", "Computers", ["positive", 0.652202]], "NPR": ["Haiti's President Was Assassinated: What's The Latest?", "Police stand near a mural featuring Haitian President Jovenel Moïse near the leader's residence, where he was killed by gunmen in the early morning hours in Port-au-Prince, Haiti, on Wednesday.\r\nJose… [+4907 chars]", "https://www.npr.org/2021/07/08/1014105912/what-we-know-about-the-assassination-of-haitis-president", "Society", ["positive", 0.611617]], "NFL News": ["Sean McVay thought 49ers might have traded up to draft TE Kyle Pitts at No. 3 ", "When the San Francisco 49ers traded a bundle of draft picks to move into the No. 3 overall slot in the 2021 NFL Draft, questions about which player the Niners targeted flew with fury in the weeks lea… [+2593 chars]", "https://www.nfl.com/news/sean-mcvay-thought-the-49ers-might-have-traded-up-to-draft-te-kyle-pitts-at-no-3", "Sports", ["positive", 0.748924]], "ESPN": ["Conor McGregor says he was 'looking past' Dustin Poirier in January, eyed boxing match with Manny Pacquiao", "LAS VEGAS -- Conor McGregor said Dustin Poirier was not his complete focus heading into UFC 257 earlier this year.\r\nIn a video interview with ESPN commentator Stephen A. Smith published Thursday, McG… [+2706 chars]", "https://www.espn.com/mma/story/_/id/31781425/conor-mcgregor-says-was-looking-dustin-poirier-january-eyed-boxing-match-manny-pacquiao", "Sports", ["positive", 0.988081]], "nj.com": ["N.J. weather: Tropical Storm Elsa to slam state today. Flash flood watch, 60 mph winds in latest forecast. ", "Tropical Storm Elsa could bring up to 4 inches of rain and wind gusts up to 60 mph to parts of New Jersey, particularly along the Jersey Shore, starting Thursday evening and continuing into Friday mo… [+3954 chars]", "https://www.nj.com/weather/2021/07/nj-weather-tropical-storm-elsa-to-slam-state-today-flash-flood-watch-60-mph-winds-in-latest-forecast.html", "Sports", ["negative", 0.673073]], "New York Post": ["Kim Jong Un's major weight loss reportedly not affecting his rule ", "North Korean leader Kim Jong Uns major weight loss has not affected his ability to rule the Hermit Kingdom, a South Korea lawmaker briefed by a spy agency says in a new report.\r\nIf there is an abnorm… [+1946 chars]", "https://nypost.com/2021/07/08/kim-jong-uns-weight-loss-reportedly-not-affecting-his-rule/", "Games", ["positive", 0.650702]], "Business Insider": ["How well COVID-19 vaccines protect against the Delta variant, according to the best available data ", "The highly-infectious Delta coronavirus variant is causing a surge in COVID-19 cases around the world, from the US to India. The variant has mutations that help it partially escape the immune respons… [+3667 chars]", "https://www.businessinsider.com/delta-variant-covid-vaccine-effectiveness-protection-pfizer-moderna-astrazeneca-2021-7", "Health", ["positive", 0.848468]]}, 1625762361.846596]