[{"The Guardian": ["‘Significant concerns’ over Florida condo near collapsed Miami building", "Miami condo collapseSurfside mayor says Champlain Towers North is essentially the same building, built by the same developer\r\nFlorida officials have said they have significant concerns regarding the … [+2450 chars]", "https://amp.theguardian.com/us-news/2021/jul/06/florida-surfside-condo-concerns-champlain-towers-north-south", "Home", ["positive", 0.600573], ["positive", 0.600573]], "New York Times": ["Cuomo Declares a Gun Violence Emergency in New York ", "It is a matter of saving lives, and New Yorks future depends on it, Mr. Cuomo said at a news conference at John Jay College of Criminal Justice in Manhattan. People are not coming back to this city, … [+1448 chars]", "https://www.nytimes.com/2021/07/06/nyregion/new-york-gun-violence-emergency.html", "Society", ["negative", 0.691947]], "CNN": ["Pfizer vaccine protection takes a hit as Delta variant spreads, Israeli government says ", "The Israeli government says its analysis has shown the Pfizer-BioNTech coronavirus vaccine appears to be less effective against infections caused by the Delta variant compared to other strains of Cov… [+6127 chars]", "https://www.cnn.com/2021/07/06/health/israel-pfizer-efficacy-delta-variant-intl/index.html", "Health", ["positive", 0.754681], ["positive", 0.754681]], "Cbslocal.com": ["Elsa Regains Hurricane Status Southwest Of Tampa Bay ", "MIAMI (CBSMiami) – Elsa has regained hurricane status southwest of Tampa Bay. A reconnaissance aircraft is on the way to investigate.\r\nAs of the 8 p.m. advisory, the center of Elsa is located about 1… [+2620 chars]", "https://miami.cbslocal.com/2021/07/06/tropical-storm-elsa-regains-hurricane-status/", "Science", ["positive", 0.713852]], "NPR": ["Eric Adams Is The Democratic Nominee For New York's Mayor", "Mayoral candidate Eric Adams mingles with supporters during his election night party on June 22 in New York. Adams has won the Democratic primary for mayor of New York City.\r\nKevin Hagen/AP\r\nNEW YORK… [+5303 chars]", "https://www.npr.org/2021/07/06/1013586197/new-york-city-mayor-race-eric-adams", "Society", ["positive", 0.781972]], "Deadline": ["Britney Spears’ Lawyer Now Quits Controversial Conservatorship; Singer Indicated She Wanted New Representation", "Less than 24 hours after Britney Spears’ longtime manager tendered his resignation, the singer’s court appointed attorney and legal firm want out of the restrictive conservatorship that has controlle… [+4806 chars]", "https://deadline.com/2021/07/britney-spears-lawyer-resigns-conversatorship-freebritney-samuel-ingham-loeb-1234787181/", "Society", ["negative", 0.720514]], "CBS News": ["Latest ransomware attack compromises up to 1,500 businesses, Kaseya CEO says", "Kaseya, the software company targeted by a holiday weekend ransomware attack, said as many as 1,500 small businesses managed by its customers were compromised.\r\nStill, Kaseya says the cyberattack it … [+3652 chars]", "https://www.cbsnews.com/news/ransomware-attack-hackers-70-million-demand-1500-businesses/", "Computers", ["negative", 0.685592], ["negative", 0.685592]], "Kotaku": ["You Can Buy The New Nintendo Switch OLED Model's Dock Separately", "Nintendos new Switch model has most of its improvements, like a bigger and better screen, on the unit itself. But its dock has also been upgraded with a new look and more features, and Nintendo says … [+1724 chars]", "https://kotaku.com/you-can-buy-the-new-nintendo-switch-oled-models-dock-se-1847239784", "Computers", ["positive", 0.738168]], "KSL.com": ["Smart foam material gives robotic hand the ability to self", "SINGAPORE (Reuters) Singapore researchers have developed a smart foam material that allows robots to sense nearby objects, and repairs itself when damaged, just like human skin.\r\nArtificially innerva… [+1299 chars]", "https://www.ksl.com/article/50199722/smart-foam-material-gives-robotic-hand-the-ability-to-self-repair", "Computers", ["positive", 0.646814]], "Al Jazeera English": ["Italy edge out Spain on penalties to reach Euro 2020 final", "Jorginho converted the decisive spot-kick as Italy beat Spain 4-2 on penalties after their Euro 2020 semi-final ended 1-1 after extra time on Tuesday, earning them a place in Sundays final against ei… [+2078 chars]", "https://www.aljazeera.com/news/2021/7/6/italy-edge-out-spain-on-penalties-to-reach-euro-2020-final", "Sports", ["positive", 0.636588]], "The Verge": ["Microsoft issues emergency Windows patch to fix critical ‘PrintNightmare’ vulnerability", "Microsoft is even patching Windows 7\r\nIllustration by Alex Castro / The Verge\r\nMicrosoft has started rolling out an emergency Windows patch to address a critical flaw in the Windows Print Spooler ser… [+1532 chars]", "https://www.theverge.com/2021/7/6/22565868/microsoft-printnightmare-windows-print-spooler-service-emergency-patch-hotfix", "Computers", ["negative", 0.82614]], "KOB": ["New Mexico reports 2 new deaths, 203 additional COVID-19 cases over four-day period ", "The latest cases include:\r\n<ul><li>60 new cases in Bernalillo County</li><li>2 new cases in Chaves County</li><li>4 new cases in Cibola County</li><li>4 new cases in Curry County</li><li>32 new cases… [+1184 chars]", "https://www.kob.com/new-mexico-news/new-mexico-reports-2new-deaths-203additional-covid-19-cases-over-four-day-period/6163227/", "Society", ["positive", 0.513696]], "Polygon": ["Universal movies to stream on Peacock after they open in theaters", "Peacock will get a much more consistent stream of new movies starting in 2022. Next year, Universals films will stream on Peacock no later than four months after they hit theaters, the two companies … [+1320 chars]", "https://www.polygon.com/22565766/universal-movies-stream-peacock-jurassic-park-dominion-hbo", "Arts", ["positive", 0.522232]], "WRAL.com": ["Faculty say UNC-Chapel Hill's reputation damaged by Hannah", "By Sarah Krueger, WRAL Durham reporter, &amp; Matt Talhelm, WRAL reporter\r\nChapel Hill, N.C. — University of North Carolina at Chapel Hill faculty were stung Tuesday by Nikole Hannah-Jones' rejection… [+7497 chars]", "https://www.wral.com/faculty-say-hannah-jones-tenure-saga-tarnished-unc-chapel-hill-s-reputation/19759371/", "Arts", ["positive", 0.714861]], "Eonline.com": ["Every Stunning Photo and Detail From Gwen Stefani and Blake Shelton’s Country Glam Wedding ", "It's officially official: Gwen Stefani and Blake Shelton are married!\r\nThe couple, who got engaged eight months ago, tied the knot on Saturday, July 3 at the country singer's ranch in Oklahoma. Takin… [+747 chars]", "https://www.eonline.com/news/1286591/every-stunning-photo-and-detail-from-gwen-stefani-and-blake-sheltons-country-glam-wedding", "Arts", ["positive", 0.914074]], "Fox News": ["2021 Cannes Film Festival: Candice Swanepoel, Bella Hadid and more stars pose on the red carpet", "The 74th Cannes Film Festival is back after being canceled last year due to the COVID-19 pandemic.\r\nThe red carpet was rolled out on Tuesday, launching the French Riviera spectacular with the premier… [+372 chars]", "https://www.foxnews.com/entertainment/celebs-2021-cannes-film-festival-red-carpet", "Arts", ["positive", 0.745227]], "Yahoo Entertainment": ["Apple stock is on fire but will it last? ", "Apple's stock has caught an under-the-radar bid over the past four weeks, and the momentum may be sticking around says JPMorgan (JPM) telecom and networking analyst Samik Chatterjee. \r\n\"The upside pr… [+3166 chars]", "https://finance.yahoo.com/news/apple-stock-is-on-fire-but-will-it-last-200735528.html", "Computers", ["negative", 0.760425]]}, 1625620408.6162932]