[{"New York Times": ["Heat-Related Death Toll Climbs to Nearly 100 in Washington State and Oregon ", "Dr. Steve Mitchell, the medical director for emergency services at Harborview Medical Center in Seattle, said vulnerable people were disproportionately affected by the heat wave, which caused many to… [+1671 chars]", "https://www.nytimes.com/2021/07/01/us/heat-wave-deaths-oregon-canada-washington.html", "Recreation", ["negative", 0.56169]], "CNN": ["182 human remains discovered in unmarked graves near former residential school ", "(CNN)A search has revealed 182 human remains in unmarked graves at the site of another residential school in British Columbia.\r\nThe Lower Kootenay Band, a member band of the Ktunaxa Nation, has annou… [+921 chars]", "https://www.cnn.com/2021/07/01/americas/unmarked-graves-human-remains-british-columbia/index.html", "Society", ["positive", 0.828012]], "NBC News": ["Attorney General Merrick Garland orders pause of federal executions", "Attorney General Merrick Garland ordered a temporary stop Thursday to scheduling further federal executions.\r\nIn a memo to senior officials, he said serious concerns have arisen about the arbitrarine… [+1501 chars]", "https://www.nbcnews.com/politics/justice-department/attorney-general-merrick-garland-orders-pause-federal-executions-n1272951", "Society", ["negative", 0.631032]], "ESPN": ["Atlanta Hawks' Trae Young ruled out for Game 5 vs. Milwaukee Bucks", "MILWAUKEE -- The Atlanta Hawks were without superstar guard Trae Young for Game 5 of the Eastern Conference finals because of a bone bruise in his right foot.\r\nYoung had been a game-time decision Thu… [+1692 chars]", "https://www.espn.com/nba/story/_/id/31746556/sources-atlanta-hawks-trae-young-game-5-vs-milwaukee-bucks", "Sports", ["positive", 0.820237]], "Fox News": ["Britney Spears' mom Lynne has 'concerns' with her conservatorship: report", "Britney Spears mom Lynne Spears reportedly has concerns over the pop stars conservatorship.  \r\n\"Lynne feels there are a lot of concerns with the conservatorship,\" a family source told People magazine… [+2387 chars]", "https://www.foxnews.com/entertainment/britney-spears-lynne-concerns-jamie-conservatorship-court-battle", "Society", ["negative", 0.702202]], "Associated Press": ["California sets date for recall election targeting Newsom", "SACRAMENTO (AP) California on Thursday scheduled a Sept. 14 recall election that could drive Democratic Gov. Gavin Newsom from office, the result of a political uprising largely driven by angst over … [+4590 chars]", "https://apnews.com/article/california-governor-gavin-newsom-recall-a2326a90364bf7ce502fa9f8e64532e9", "Society", ["positive", 0.652047]], "CNET": ["NASA preps 'more complex and riskier' Hubble Space Telescope fix", "The NASA/ESA Hubble Space Telescope during deployment in 1990.\r\nNASA/Smithsonian Institution/Lockheed\r\nThe Hubble Space Telescope has spent over three decades delivering glorious images and data, but… [+2784 chars]", "https://www.cnet.com/news/nasa-prepares-more-complex-riskier-hubble-space-telescope-fix/", "Science", ["negative", 0.598396]], "CNBC": ["Toyota tops GM sales in the U.S., expected to be America's best", "A Totota dealership is seen in Annapolis, Maryland on May 27, 2021, as many car dealerships across the country are running low on new vehicles as a computer chip shortage has caused production at man… [+2650 chars]", "https://www.cnbc.com/2021/07/01/toyota-tops-gm-sales-expected-to-be-americas-best-selling-automaker.html", "Recreation", ["negative", 0.571611]], "Yahoo Entertainment": ["As Delta variant surges, Fauci and Walensky say vaccines, not masks, are the solution ", "WASHINGTON Top science officials in the Biden administration sought on Thursday to allay concerns about the highly transmissible Delta variant of the coronavirus, which has prompted renewed calls for… [+3726 chars]", "https://news.yahoo.com/as-delta-variant-surges-fauci-and-walensky-says-vaccines-not-masks-are-the-solution-205956639.html", "Computers", ["positive", 0.555807]], "CBS Sports": ["As NIL rules go into effect, these NCAA athletes moved quickly to profit from name, image and likeness", "Thursday marked the beginning of a new era in college sports as rules allowing athletes to benefit from their name, image and likeness went into effect around the country. Immediately, the effects of… [+6257 chars]", "https://www.cbssports.com/college-football/news/as-nil-rules-go-into-effect-these-ncaa-athletes-moved-quickly-to-profit-from-name-image-and-likeness/", "Sports", ["positive", 0.727287]], "TMZ": ["Gwen Stefani, Blake Shelton File for Marriage License, Weekend Wedding in Works", "Gwen Stefani and Blake Sheltonare planning to say their vows soon -- like, potentially, July 4 weekend soon.\r\nThe engaged singers applied for their marriage license Tuesday in Oklahoma ... according … [+1105 chars]", "https://www.tmz.com/2021/07/01/gwen-stefani-blake-shelton-file-marriage-license-oklahoma-wedding-weekend/", "Society", ["negative", 0.562328]], "New York Post": ["Howard University says Phylicia Rashad's Cosby tweet 'lacked sensitivity' ", "Howard University attempted to distance itself from actress Phylicia Rashad’s tweet praising Bill Cosby’s release — saying her post “lacked sensitivity” toward sexual abuse survivors.\r\nThe private sc… [+1631 chars]", "https://nypost.com/2021/07/01/howard-university-phylicia-rashads-cosby-tweet-lacked-sensitivity/", "Arts", ["positive", 0.882881]], "WCVB Boston": ["West Nile virus found for first time this year in Massachusetts mosquito sample", "MEDFORD, Mass. —West Nile virus has been detected in mosquitoes in Massachusetts for the first time this year, the Massachusetts Department of Public Health said. \r\nThe state health department said t… [+1794 chars]", "https://www.wcvb.com/article/west-nile-virus-medford-massachusetts-mosquito-sample-first-time-2021/36905845", "Health", ["negative", 0.51272]], "USA Today": ["'What can you do?' He was in Paris. His wife was 4,500 miles away in a Surfside, Florida, condo that had started to collapse. ", "Philippe Naïm was in his Paris apartment when he got a call early June 24 from his wife who was at the couple's beachside condo.\r\nIt was the middle of the night in Surfside, Florida, but Margarita Ch… [+3259 chars]", "https://www.usatoday.com/story/news/nation/2021/07/01/florida-building-collapse-survivor-tells-story-rescue-and-reunion/7824928002/", "Arts", ["positive", 0.627637]], "KTLA Los Angeles": ["Veteran who fatally shot 12 at Borderline bar in Thousand Oaks had hatred for ‘college", "An investigative report on a 2018 mass shooting during a Ventura County bars Country College Night found the likely motive of the military veteran who carried out the attack was disdain for civilians… [+2542 chars]", "https://ktla.com/news/local-news/veteran-who-fatally-shot-12-at-borderline-bar-in-thousand-oaks-had-hatred-for-college-civilians-report-finds/", "Society", ["negative", 0.755596]], "Ars Technica": ["Humble Bundle stops purchasers from giving full payment to charity", "Enlarge/ The kind of \"everything to charity\" slider option shown on the right here will soon be impossible for Humble Bundle customers.\r\n35 with 31 posters participating, including story author\r\nSinc… [+3342 chars]", "https://arstechnica.com/gaming/2021/07/humble-bundle-imposing-limits-on-users-charitable-giving-percentages/", "Business", ["negative", 0.759306]]}, 1625192105.392063]